[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:34:66
     @Inject(ID_TOKEN_VERIFIER) private readonly verifier: IdTokenVerifier,
   ) {}
 
-  async canActivate(execCtx: ExecutionContext): Promise<boolean> {
-    assertConfigComplete(this.cfg);
-    const headers = execCtx
-      .switchToHttp()
-      .getRequest<{ headers: Record<string, string | string[] | undefined> }>().headers;
-    const token = extractBearerToken(headers['authorization']);
-    const payload = await this.verifyToken(token);
-    assertGoogleIssuer(payload);
-    assertNotExpired(payload);
-    assertAudience(payload, this.cfg.webhookAudience);
-    assertInvoker(payload, this.cfg.invokerSaEmail);
-    return true;
-  }
+  async canActivate(execCtx: ExecutionContext): Promise<boolean> {}
 
   private async verifyToken(token: string): Promise<IdTokenPayload> {
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
lib/video/webhook/pubsub-push.guard.ts:45:12
     assertNotExpired(payload);
     assertAudience(payload, this.cfg.webhookAudience);
     assertInvoker(payload, this.cfg.invokerSaEmail);
-    return true;
+    return false;
   }
 
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:48:69
     return true;
   }
 
-  private async verifyToken(token: string): Promise<IdTokenPayload> {
-    let payload: IdTokenPayload | undefined;
-    try {
-      const ticket = await this.verifier.verifyIdToken(token);
-      payload = ticket.getPayload();
-    } catch (err) {
-      throw new PubSubInvalidTokenException((err as Error).message);
-    }
-    if (!payload) throw new PubSubInvalidTokenException('empty payload');
-    return payload;
-  }
+  private async verifyToken(token: string): Promise<IdTokenPayload> {}
 }
 
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:50:9
 
   private async verifyToken(token: string): Promise<IdTokenPayload> {
     let payload: IdTokenPayload | undefined;
-    try {
-      const ticket = await this.verifier.verifyIdToken(token);
-      payload = ticket.getPayload();
-    } catch (err) {
+    try {} catch (err) {
       throw new PubSubInvalidTokenException((err as Error).message);
     }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Survived] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:65:55
 // wiring, the later `payload.email !== this.cfg.invokerSaEmail` check would
 // silently compare `undefined !== undefined` and pass. Fail loudly here
 // instead, before touching any other check.
-function assertConfigComplete(cfg: VideoConfig): void {
-  if (!cfg.invokerSaEmail || !cfg.webhookAudience) {
-    throw new PubSubInvalidTokenException('webhook invoker config missing');
-  }
-}
+function assertConfigComplete(cfg: VideoConfig): void {}
 
 function extractBearerToken(header: string | string[] | undefined): string {

[Killed] BooleanLiteral
lib/video/webhook/pubsub-push.guard.ts:66:30
 // silently compare `undefined !== undefined` and pass. Fail loudly here
 // instead, before touching any other check.
 function assertConfigComplete(cfg: VideoConfig): void {
-  if (!cfg.invokerSaEmail || !cfg.webhookAudience) {
+  if (!cfg.invokerSaEmail || cfg.webhookAudience) {
     throw new PubSubInvalidTokenException('webhook invoker config missing');
   }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Killed] BooleanLiteral
lib/video/webhook/pubsub-push.guard.ts:66:7
 // silently compare `undefined !== undefined` and pass. Fail loudly here
 // instead, before touching any other check.
 function assertConfigComplete(cfg: VideoConfig): void {
-  if (!cfg.invokerSaEmail || !cfg.webhookAudience) {
+  if (cfg.invokerSaEmail || !cfg.webhookAudience) {
     throw new PubSubInvalidTokenException('webhook invoker config missing');
   }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:71:76
   }
 }
 
-function extractBearerToken(header: string | string[] | undefined): string {
-  if (typeof header !== 'string' || !header.startsWith('Bearer ')) {
-    throw new PubSubInvalidTokenException('missing or malformed Authorization header');
-  }
-  const token = header.slice('Bearer '.length).trim();
-  if (!token) throw new PubSubInvalidTokenException('empty bearer token');
-  return token;
-}
+function extractBearerToken(header: string | string[] | undefined): string {}
 
 function assertGoogleIssuer(payload: IdTokenPayload): void {
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: expected "vi.fn()" to be called with arguments: [ 'the-token' ]

Received:

  1st vi.fn() call:

  [
-   "the-token",

[Killed] EqualityOperator
lib/video/webhook/pubsub-push.guard.ts:72:7
 }
 
 function extractBearerToken(header: string | string[] | undefined): string {
-  if (typeof header !== 'string' || !header.startsWith('Bearer ')) {
+  if (typeof header === 'string' || !header.startsWith('Bearer ')) {
     throw new PubSubInvalidTokenException('missing or malformed Authorization header');
   }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:72:7
 }
 
 function extractBearerToken(header: string | string[] | undefined): string {
-  if (typeof header !== 'string' || !header.startsWith('Bearer ')) {
+  if (true) {
     throw new PubSubInvalidTokenException('missing or malformed Authorization header');
   }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:80:60
   return token;
 }
 
-function assertGoogleIssuer(payload: IdTokenPayload): void {
-  if (payload.iss !== GOOGLE_ISSUER) {
-    throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
-  }
-}
+function assertGoogleIssuer(payload: IdTokenPayload): void {}
 
 function assertNotExpired(payload: IdTokenPayload): void {
killedBy: PubSubPushGuard rejects when issuer is wrong
statusReason: promise resolved "true" instead of rejecting

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:81:38
 }
 
 function assertGoogleIssuer(payload: IdTokenPayload): void {
-  if (payload.iss !== GOOGLE_ISSUER) {
-    throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
-  }
+  if (payload.iss !== GOOGLE_ISSUER) {}
 }
 
killedBy: PubSubPushGuard rejects when issuer is wrong
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:81:7
 }
 
 function assertGoogleIssuer(payload: IdTokenPayload): void {
-  if (payload.iss !== GOOGLE_ISSUER) {
+  if (true) {
     throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
   }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Killed] StringLiteral
lib/video/webhook/pubsub-push.guard.ts:82:43
 
 function assertGoogleIssuer(payload: IdTokenPayload): void {
   if (payload.iss !== GOOGLE_ISSUER) {
-    throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
+    throw new PubSubInvalidTokenException(``);
   }
 }
killedBy: PubSubPushGuard rejects when issuer is wrong
statusReason: expected VideoException: Pub/Sub OIDC token invali… { …(3) } to match object { code: 'PUBSUB_INVALID_TOKEN', …(1) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:86:58
   }
 }
 
-function assertNotExpired(payload: IdTokenPayload): void {
-  if (typeof payload.exp !== 'number' || payload.exp * 1000 < Date.now()) {
-    throw new PubSubInvalidTokenException('token expired');
-  }
-}
+function assertNotExpired(payload: IdTokenPayload): void {}
 
 function assertAudience(payload: IdTokenPayload, expected: string | undefined): void {
killedBy: PubSubPushGuard rejects when the token carries no numeric exp claim
statusReason: promise resolved "true" instead of rejecting

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:87:75
 }
 
 function assertNotExpired(payload: IdTokenPayload): void {
-  if (typeof payload.exp !== 'number' || payload.exp * 1000 < Date.now()) {
-    throw new PubSubInvalidTokenException('token expired');
-  }
+  if (typeof payload.exp !== 'number' || payload.exp * 1000 < Date.now()) {}
 }
 
killedBy: PubSubPushGuard rejects when the token carries no numeric exp claim
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:87:7
 }
 
 function assertNotExpired(payload: IdTokenPayload): void {
-  if (typeof payload.exp !== 'number' || payload.exp * 1000 < Date.now()) {
+  if (false) {
     throw new PubSubInvalidTokenException('token expired');
   }
killedBy: PubSubPushGuard rejects when the token carries no numeric exp claim
statusReason: promise resolved "true" instead of rejecting

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:92:86
   }
 }
 
-function assertAudience(payload: IdTokenPayload, expected: string | undefined): void {
-  const aud = Array.isArray(payload.aud) ? payload.aud[0] : payload.aud;
-  if (aud !== expected) {
-    throw new PubSubWrongAudienceException();
-  }
-}
+function assertAudience(payload: IdTokenPayload, expected: string | undefined): void {}
 
 function assertInvoker(payload: IdTokenPayload, expected: string | undefined): void {
killedBy: PubSubPushGuard rejects when audience does not match
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:94:7
 
 function assertAudience(payload: IdTokenPayload, expected: string | undefined): void {
   const aud = Array.isArray(payload.aud) ? payload.aud[0] : payload.aud;
-  if (aud !== expected) {
+  if (false) {
     throw new PubSubWrongAudienceException();
   }
killedBy: PubSubPushGuard rejects when audience does not match
statusReason: promise resolved "true" instead of rejecting

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:94:25
 
 function assertAudience(payload: IdTokenPayload, expected: string | undefined): void {
   const aud = Array.isArray(payload.aud) ? payload.aud[0] : payload.aud;
-  if (aud !== expected) {
-    throw new PubSubWrongAudienceException();
-  }
+  if (aud !== expected) {}
 }
 
killedBy: PubSubPushGuard rejects when audience does not match
statusReason: promise resolved "true" instead of rejecting

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:99:85
   }
 }
 
-function assertInvoker(payload: IdTokenPayload, expected: string | undefined): void {
-  if (payload.email !== expected) {
-    throw new PubSubWrongInvokerException();
-  }
-}
+function assertInvoker(payload: IdTokenPayload, expected: string | undefined): void {}
 
killedBy: PubSubPushGuard rejects when invoker email does not match
statusReason: promise resolved "true" instead of rejecting

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:100:35
 }
 
 function assertInvoker(payload: IdTokenPayload, expected: string | undefined): void {
-  if (payload.email !== expected) {
-    throw new PubSubWrongInvokerException();
-  }
+  if (payload.email !== expected) {}
 }
 
killedBy: PubSubPushGuard rejects when invoker email does not match
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:100:7
 }
 
 function assertInvoker(payload: IdTokenPayload, expected: string | undefined): void {
-  if (payload.email !== expected) {
+  if (true) {
     throw new PubSubWrongInvokerException();
   }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token email … { …(3) }" instead of resolving
