[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:40:72
     private readonly instructors: InstructorDirectory,
   ) {}
 
-  async listCatalogue(query: CatalogQuery): Promise<CourseCatalogPage> {
-    let courses = await this.repo.listPublished();
-    if (query.category) {
-      courses = courses.filter((c) => c.category === query.category);
-    }
-    if (query.difficulty) {
-      courses = courses.filter((c) => c.difficulty === query.difficulty);
-    }
-    courses = sortCourses(courses, query.sort ?? 'NEWEST');
-    return this.paginate(courses, query.page ?? 1);
-  }
+  async listCatalogue(query: CatalogQuery): Promise<CourseCatalogPage> {}
 
   async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:42:25
 
   async listCatalogue(query: CatalogQuery): Promise<CourseCatalogPage> {
     let courses = await this.repo.listPublished();
-    if (query.category) {
-      courses = courses.filter((c) => c.category === query.category);
-    }
+    if (query.category) {}
     if (query.difficulty) {
       courses = courses.filter((c) => c.difficulty === query.difficulty);
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [ 'c-design', 'c-prog-adv', …(1) ] to deeply equal [ 'c-prog-adv', 'c-prog-beg' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:42:9
 
   async listCatalogue(query: CatalogQuery): Promise<CourseCatalogPage> {
     let courses = await this.repo.listPublished();
-    if (query.category) {
+    if (false) {
       courses = courses.filter((c) => c.category === query.category);
     }
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [ 'c-design', 'c-prog-adv', …(1) ] to deeply equal [ 'c-prog-adv', 'c-prog-beg' ]

[Killed] EqualityOperator
src/lib/catalog/catalog.service.ts:43:39
   async listCatalogue(query: CatalogQuery): Promise<CourseCatalogPage> {
     let courses = await this.repo.listPublished();
     if (query.category) {
-      courses = courses.filter((c) => c.category === query.category);
+      courses = courses.filter((c) => c.category !== query.category);
     }
     if (query.difficulty) {
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [ 'c-design' ] to deeply equal [ 'c-prog-adv', 'c-prog-beg' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:43:32
   async listCatalogue(query: CatalogQuery): Promise<CourseCatalogPage> {
     let courses = await this.repo.listPublished();
     if (query.category) {
-      courses = courses.filter((c) => c.category === query.category);
+      courses = courses.filter(() => undefined);
     }
     if (query.difficulty) {
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [] to deeply equal [ 'c-prog-adv', 'c-prog-beg' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:45:9
     if (query.category) {
       courses = courses.filter((c) => c.category === query.category);
     }
-    if (query.difficulty) {
+    if (false) {
       courses = courses.filter((c) => c.difficulty === query.difficulty);
     }
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [ 'c-prog-beg', 'c-prog-adv' ] to deeply equal [ 'c-prog-beg' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:45:9
     if (query.category) {
       courses = courses.filter((c) => c.category === query.category);
     }
-    if (query.difficulty) {
+    if (true) {
       courses = courses.filter((c) => c.difficulty === query.difficulty);
     }
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [] to deeply equal [ 'c-prog-adv', 'c-prog-beg' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:46:32
       courses = courses.filter((c) => c.category === query.category);
     }
     if (query.difficulty) {
-      courses = courses.filter((c) => c.difficulty === query.difficulty);
+      courses = courses.filter(() => undefined);
     }
     courses = sortCourses(courses, query.sort ?? 'NEWEST');
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [] to deeply equal [ 'c-prog-beg' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:46:17
       courses = courses.filter((c) => c.category === query.category);
     }
     if (query.difficulty) {
-      courses = courses.filter((c) => c.difficulty === query.difficulty);
+      courses = courses;
     }
     courses = sortCourses(courses, query.sort ?? 'NEWEST');
killedBy: CatalogService.listCatalogue filters by category and difficulty
statusReason: expected [ 'c-prog-beg', 'c-prog-adv' ] to deeply equal [ 'c-prog-beg' ]

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:48:36
     if (query.difficulty) {
       courses = courses.filter((c) => c.difficulty === query.difficulty);
     }
-    courses = sortCourses(courses, query.sort ?? 'NEWEST');
+    courses = sortCourses(courses, query.sort && 'NEWEST');
     return this.paginate(courses, query.page ?? 1);
   }
killedBy: CatalogService.listCatalogue sorts ALPHABETICAL by title case-insensitively
statusReason: expected [ 'banana', 'Apple' ] to deeply equal [ 'Apple', 'banana' ]

[Survived] StringLiteral
src/lib/catalog/catalog.service.ts:48:50
     if (query.difficulty) {
       courses = courses.filter((c) => c.difficulty === query.difficulty);
     }
-    courses = sortCourses(courses, query.sort ?? 'NEWEST');
+    courses = sortCourses(courses, query.sort ?? "");
     return this.paginate(courses, query.page ?? 1);
   }

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:49:35
       courses = courses.filter((c) => c.difficulty === query.difficulty);
     }
     courses = sortCourses(courses, query.sort ?? 'NEWEST');
-    return this.paginate(courses, query.page ?? 1);
+    return this.paginate(courses, query.page && 1);
   }
 
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:52:71
     return this.paginate(courses, query.page ?? 1);
   }
 
-  async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {
-    const q = query.q.trim().toLowerCase();
-    const courses = await this.repo.listPublished();
-    const ranked = courses
-      .map((c) => ({ c, score: relevanceScore(c, q) }))
-      .filter((x) => x.score > 0)
-      .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
-      .map((x) => x.c);
-    return this.paginate(ranked, query.page ?? 1);
-  }
+  async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {}
 
   async getCourseDetail(cid: CourseId): Promise<CourseCatalogDetail> {
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: Cannot read properties of undefined (reading 'items')

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:53:15
   }
 
   async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {
-    const q = query.q.trim().toLowerCase();
+    const q = query.q.trim().toUpperCase();
     const courses = await this.repo.listPublished();
     const ranked = courses
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [] to deeply equal [ 'c-1', 'c-2' ]

[Survived] MethodExpression
src/lib/catalog/catalog.service.ts:53:15
   }
 
   async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {
-    const q = query.q.trim().toLowerCase();
+    const q = query.q.toLowerCase();
     const courses = await this.repo.listPublished();
     const ranked = courses

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:55:20
   async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {
     const q = query.q.trim().toLowerCase();
     const courses = await this.repo.listPublished();
-    const ranked = courses
-      .map((c) => ({ c, score: relevanceScore(c, q) }))
-      .filter((x) => x.score > 0)
-      .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
+    const ranked = courses.map(c => ({
+  c,
+  score: relevanceScore(c, q)
+})).filter(x => x.score > 0)
       .map((x) => x.c);
     return this.paginate(ranked, query.page ?? 1);
killedBy: CatalogService.search ranks a title match above a description-only match
statusReason: expected [ 'desc-only', 'title-hit' ] to deeply equal [ 'title-hit', 'desc-only' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:55:20
   async search(query: CatalogSearchQuery): Promise<CourseCatalogPage> {
     const q = query.q.trim().toLowerCase();
     const courses = await this.repo.listPublished();
-    const ranked = courses
-      .map((c) => ({ c, score: relevanceScore(c, q) }))
-      .filter((x) => x.score > 0)
+    const ranked = courses.map(c => ({
+  c,
+  score: relevanceScore(c, q)
+}))
       .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
       .map((x) => x.c);
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-1', 'c-2', 'c-3' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:56:12
     const q = query.q.trim().toLowerCase();
     const courses = await this.repo.listPublished();
     const ranked = courses
-      .map((c) => ({ c, score: relevanceScore(c, q) }))
+      .map(() => undefined)
       .filter((x) => x.score > 0)
       .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:57:22
     const courses = await this.repo.listPublished();
     const ranked = courses
       .map((c) => ({ c, score: relevanceScore(c, q) }))
-      .filter((x) => x.score > 0)
+      .filter((x) => true)
       .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
       .map((x) => x.c);
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-1', 'c-2', 'c-3' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] EqualityOperator
src/lib/catalog/catalog.service.ts:57:22
     const courses = await this.repo.listPublished();
     const ranked = courses
       .map((c) => ({ c, score: relevanceScore(c, q) }))
-      .filter((x) => x.score > 0)
+      .filter((x) => x.score >= 0)
       .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
       .map((x) => x.c);
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-1', 'c-2', 'c-3' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:58:23
     const ranked = courses
       .map((c) => ({ c, score: relevanceScore(c, q) }))
       .filter((x) => x.score > 0)
-      .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
+      .sort((a, b) => b.score - a.score && compareNewest(a.c, b.c))
       .map((x) => x.c);
     return this.paginate(ranked, query.page ?? 1);
killedBy: CatalogService.search ranks a title match above a description-only match
statusReason: expected [ 'desc-only', 'title-hit' ] to deeply equal [ 'title-hit', 'desc-only' ]

[Killed] ArithmeticOperator
src/lib/catalog/catalog.service.ts:58:23
     const ranked = courses
       .map((c) => ({ c, score: relevanceScore(c, q) }))
       .filter((x) => x.score > 0)
-      .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
+      .sort((a, b) => b.score + a.score || compareNewest(a.c, b.c))
       .map((x) => x.c);
     return this.paginate(ranked, query.page ?? 1);
killedBy: CatalogService.search ranks a title match above a description-only match
statusReason: expected [ 'desc-only', 'title-hit' ] to deeply equal [ 'title-hit', 'desc-only' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:59:12
       .map((c) => ({ c, score: relevanceScore(c, q) }))
       .filter((x) => x.score > 0)
       .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
-      .map((x) => x.c);
+      .map(() => undefined);
     return this.paginate(ranked, query.page ?? 1);
   }
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: Cannot read properties of undefined (reading 'instructorId')

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:60:34
       .filter((x) => x.score > 0)
       .sort((a, b) => b.score - a.score || compareNewest(a.c, b.c))
       .map((x) => x.c);
-    return this.paginate(ranked, query.page ?? 1);
+    return this.paginate(ranked, query.page && 1);
   }
 
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [] to deeply equal [ 'c-1', 'c-2' ]

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:65:9
 
   async getCourseDetail(cid: CourseId): Promise<CourseCatalogDetail> {
     const course = await this.repo.getCourse(cid);
-    if (!course || course.status !== 'PUBLISHED') {
+    if (!course && course.status !== 'PUBLISHED') {
       throw new CourseNotFoundException();
     }
killedBy: CatalogService.getCourseDetail throws COURSE_NOT_FOUND for a missing course
statusReason: expected TypeError: Cannot read properties of null… to match object { code: 'COURSE_NOT_FOUND', …(1) }

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:65:20
 
   async getCourseDetail(cid: CourseId): Promise<CourseCatalogDetail> {
     const course = await this.repo.getCourse(cid);
-    if (!course || course.status !== 'PUBLISHED') {
+    if (!course || false) {
       throw new CourseNotFoundException();
     }
killedBy: CatalogService.getCourseDetail throws COURSE_NOT_FOUND for a DRAFT course (no draft leak)
statusReason: promise resolved "{ id: 'c-draft', …(9) }" instead of rejecting

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:70:19
     }
     const modules = await this.repo.listModulesByCourse(cid);
     const outline = await Promise.all(
-      modules.map(async (m) => ({
-        title: m.title,
-        lessons: (await this.repo.listLessonsByModule(cid, m.id)).map((l) => ({
-          title: l.title,
-        })),
-      })),
+      modules.map(() => undefined),
     );
     const lessonCount = outline.reduce((n, m) => n + m.lessons.length, 0);
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: Cannot read properties of undefined (reading 'lessons')

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:72:71
     const outline = await Promise.all(
       modules.map(async (m) => ({
         title: m.title,
-        lessons: (await this.repo.listLessonsByModule(cid, m.id)).map((l) => ({
-          title: l.title,
-        })),
+        lessons: (await this.repo.listLessonsByModule(cid, m.id)).map(() => undefined),
       })),
     );
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: expected [ { title: 'Module 1', …(1) } ] to deeply equal [ { title: 'Module 1', …(1) } ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:77:40
         })),
       })),
     );
-    const lessonCount = outline.reduce((n, m) => n + m.lessons.length, 0);
+    const lessonCount = outline.reduce(() => undefined, 0);
     const names = await this.instructors.displayNamesFor([course.instructorId]);
     return {
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/lib/catalog/catalog.service.ts:77:50
         })),
       })),
     );
-    const lessonCount = outline.reduce((n, m) => n + m.lessons.length, 0);
+    const lessonCount = outline.reduce((n, m) => n - m.lessons.length, 0);
     const names = await this.instructors.displayNamesFor([course.instructorId]);
     return {
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: expected -2 to be 2 // Object.is equality

[Killed] ArrayDeclaration
src/lib/catalog/catalog.service.ts:78:58
       })),
     );
     const lessonCount = outline.reduce((n, m) => n + m.lessons.length, 0);
-    const names = await this.instructors.displayNamesFor([course.instructorId]);
+    const names = await this.instructors.displayNamesFor([]);
     return {
       id: course.id,
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: expected 'Instructor' to be 'Ada Lovelace' // Object.is equality

[Killed] ObjectLiteral
src/lib/catalog/catalog.service.ts:79:12
     );
     const lessonCount = outline.reduce((n, m) => n + m.lessons.length, 0);
     const names = await this.instructors.displayNamesFor([course.instructorId]);
-    return {
-      id: course.id,
-      title: course.title,
-      description: course.description,
-      longDescription: course.longDescription,
-      category: course.category,
-      difficulty: course.difficulty,
-      instructorDisplayName: names.get(course.instructorId) ?? 'Instructor',
-      lessonCount,
-      modules: outline,
-      publishedAt: publishedAt(course),
-    };
+    return {};
   }
 
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: expected undefined to be 'Course One' // Object.is equality

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:86:30
       longDescription: course.longDescription,
       category: course.category,
       difficulty: course.difficulty,
-      instructorDisplayName: names.get(course.instructorId) ?? 'Instructor',
+      instructorDisplayName: names.get(course.instructorId) && 'Instructor',
       lessonCount,
       modules: outline,
killedBy: CatalogService.getCourseDetail assembles the detail payload with the module outline and lesson count
statusReason: expected 'Instructor' to be 'Ada Lovelace' // Object.is equality

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:93:87
     };
   }
 
-  private async paginate(courses: Course[], page: number): Promise<CourseCatalogPage> {
-    const total = courses.length;
-    const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
-    const start = (page - 1) * CATALOG_PAGE_SIZE;
-    const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
-    const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
-    return {
-      items: slice.map((c) => toSummary(c, names)),
-      page,
-      pageSize: CATALOG_PAGE_SIZE,
-      total,
-      totalPages,
-    };
-  }
+  private async paginate(courses: Course[], page: number): Promise<CourseCatalogPage> {}
 }
 
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'total')

[Killed] ArithmeticOperator
src/lib/catalog/catalog.service.ts:95:34
 
   private async paginate(courses: Course[], page: number): Promise<CourseCatalogPage> {
     const total = courses.length;
-    const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
+    const totalPages = Math.ceil(total * CATALOG_PAGE_SIZE);
     const start = (page - 1) * CATALOG_PAGE_SIZE;
     const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: expected 40 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/lib/catalog/catalog.service.ts:96:19
   private async paginate(courses: Course[], page: number): Promise<CourseCatalogPage> {
     const total = courses.length;
     const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
-    const start = (page - 1) * CATALOG_PAGE_SIZE;
+    const start = (page - 1) / CATALOG_PAGE_SIZE;
     const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
     const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
killedBy: CatalogService.listCatalogue paginates with 20 items per page
statusReason: expected [ { id: 'c-00', …(6) }, …(19) ] to have a length of 5 but got 20

[Killed] ArithmeticOperator
src/lib/catalog/catalog.service.ts:96:20
   private async paginate(courses: Course[], page: number): Promise<CourseCatalogPage> {
     const total = courses.length;
     const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
-    const start = (page - 1) * CATALOG_PAGE_SIZE;
+    const start = (page + 1) * CATALOG_PAGE_SIZE;
     const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
     const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: expected [] to deeply equal [ 'c-1', 'c-2' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:97:19
     const total = courses.length;
     const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
     const start = (page - 1) * CATALOG_PAGE_SIZE;
-    const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
+    const slice = courses;
     const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
     return {
killedBy: CatalogService.listCatalogue paginates with 20 items per page
statusReason: expected [ { id: 'c-00', …(6) }, …(24) ] to have a length of 20 but got 25

[Killed] ArithmeticOperator
src/lib/catalog/catalog.service.ts:97:40
     const total = courses.length;
     const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
     const start = (page - 1) * CATALOG_PAGE_SIZE;
-    const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
+    const slice = courses.slice(start, start - CATALOG_PAGE_SIZE);
     const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
     return {
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: expected [] to deeply equal [ 'c-1', 'c-2' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:98:68
     const totalPages = Math.ceil(total / CATALOG_PAGE_SIZE);
     const start = (page - 1) * CATALOG_PAGE_SIZE;
     const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
-    const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
+    const names = await this.instructors.displayNamesFor(slice.map(() => undefined));
     return {
       items: slice.map((c) => toSummary(c, names)),
killedBy: CatalogService.listCatalogue resolves the instructor display name onto each summary
statusReason: expected 'Instructor' to be 'Ada Lovelace' // Object.is equality

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:100:24
     const slice = courses.slice(start, start + CATALOG_PAGE_SIZE);
     const names = await this.instructors.displayNamesFor(slice.map((c) => c.instructorId));
     return {
-      items: slice.map((c) => toSummary(c, names)),
+      items: slice.map(() => undefined),
       page,
       pageSize: CATALOG_PAGE_SIZE,
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:110:48
 }
 
 /** PUBLISHED courses always carry publishedAt; createdAt is a defensive fallback. */
-function publishedAt(c: Course): ISODateString {
-  return c.publishedAt ?? c.createdAt;
-}
+function publishedAt(c: Course): ISODateString {}
 
 function compareNewest(a: Course, b: Course): number {
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'localeCompare')

[Killed] LogicalOperator
src/lib/catalog/catalog.service.ts:111:10
 
 /** PUBLISHED courses always carry publishedAt; createdAt is a defensive fallback. */
 function publishedAt(c: Course): ISODateString {
-  return c.publishedAt ?? c.createdAt;
+  return c.publishedAt && c.createdAt;
 }
 
killedBy: CatalogService.listCatalogue sorts NEWEST by publishedAt descending
statusReason: expected [ 'old', 'new' ] to deeply equal [ 'new', 'old' ]

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:114:54
   return c.publishedAt ?? c.createdAt;
 }
 
-function compareNewest(a: Course, b: Course): number {
-  return (publishedAt(b) as string).localeCompare(publishedAt(a) as string);
-}
+function compareNewest(a: Course, b: Course): number {}
 
 function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
killedBy: CatalogService.listCatalogue sorts NEWEST by publishedAt descending
statusReason: expected [ 'old', 'new' ] to deeply equal [ 'new', 'old' ]

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:118:70
   return (publishedAt(b) as string).localeCompare(publishedAt(a) as string);
 }
 
-function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
-  const copy = [...courses];
-  if (sort === 'ALPHABETICAL') {
-    copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
-  } else if (sort === 'POPULAR') {
-    copy.sort(
-      (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
-    );
-  } else {
-    copy.sort(compareNewest);
-  }
-  return copy;
-}
+function sortCourses(courses: Course[], sort: CatalogSort): Course[] {}
 
 /** Title match outranks a description-only match. */
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/lib/catalog/catalog.service.ts:119:16
 }
 
 function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
-  const copy = [...courses];
+  const copy = [];
   if (sort === 'ALPHABETICAL') {
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/lib/catalog/catalog.service.ts:120:7
 
 function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
   const copy = [...courses];
-  if (sort === 'ALPHABETICAL') {
+  if (sort !== 'ALPHABETICAL') {
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
   } else if (sort === 'POPULAR') {
killedBy: CatalogService.listCatalogue sorts ALPHABETICAL by title case-insensitively
statusReason: expected [ 'banana', 'Apple' ] to deeply equal [ 'Apple', 'banana' ]

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:120:32
 
 function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
   const copy = [...courses];
-  if (sort === 'ALPHABETICAL') {
-    copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
-  } else if (sort === 'POPULAR') {
+  if (sort === 'ALPHABETICAL') {} else if (sort === 'POPULAR') {
     copy.sort(
       (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
killedBy: CatalogService.listCatalogue sorts ALPHABETICAL by title case-insensitively
statusReason: expected [ 'banana', 'Apple' ] to deeply equal [ 'Apple', 'banana' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:121:15
 function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
   const copy = [...courses];
   if (sort === 'ALPHABETICAL') {
-    copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
+    copy.sort(() => undefined);
   } else if (sort === 'POPULAR') {
     copy.sort(
killedBy: CatalogService.listCatalogue sorts ALPHABETICAL by title case-insensitively
statusReason: expected [ 'banana', 'Apple' ] to deeply equal [ 'Apple', 'banana' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:121:5
 function sortCourses(courses: Course[], sort: CatalogSort): Course[] {
   const copy = [...courses];
   if (sort === 'ALPHABETICAL') {
-    copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
+    copy;
   } else if (sort === 'POPULAR') {
     copy.sort(
killedBy: CatalogService.listCatalogue sorts ALPHABETICAL by title case-insensitively
statusReason: expected [ 'banana', 'Apple' ] to deeply equal [ 'Apple', 'banana' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:122:14
   const copy = [...courses];
   if (sort === 'ALPHABETICAL') {
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
-  } else if (sort === 'POPULAR') {
+  } else if (false) {
     copy.sort(
       (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
killedBy: CatalogService.listCatalogue — POPULAR sort orders by enrollmentCount descending, treating a missing count as 0
statusReason: expected [ 'c-low', 'c-high', 'c-none' ] to deeply equal [ 'c-high', 'c-low', 'c-none' ]
