[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:122:34
   const copy = [...courses];
   if (sort === 'ALPHABETICAL') {
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
-  } else if (sort === 'POPULAR') {
-    copy.sort(
-      (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
-    );
-  } else {
+  } else if (sort === 'POPULAR') {} else {
     copy.sort(compareNewest);
   }
killedBy: CatalogService.listCatalogue — POPULAR sort orders by enrollmentCount descending, treating a missing count as 0
statusReason: expected [ 'c-low', 'c-high', 'c-none' ] to deeply equal [ 'c-high', 'c-low', 'c-none' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:123:5
   if (sort === 'ALPHABETICAL') {
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
   } else if (sort === 'POPULAR') {
-    copy.sort(
-      (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
-    );
+    copy;
   } else {
     copy.sort(compareNewest);
killedBy: CatalogService.listCatalogue — POPULAR sort orders by enrollmentCount descending, treating a missing count as 0
statusReason: expected [ 'c-low', 'c-high', 'c-none' ] to deeply equal [ 'c-high', 'c-low', 'c-none' ]

[Killed] ArrowFunction
src/lib/catalog/catalog.service.ts:124:7
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
   } else if (sort === 'POPULAR') {
     copy.sort(
-      (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
+      () => undefined,
     );
   } else {
killedBy: CatalogService.listCatalogue — POPULAR sort orders by enrollmentCount descending, treating a missing count as 0
statusReason: expected [ 'c-low', 'c-high', 'c-none' ] to deeply equal [ 'c-high', 'c-low', 'c-none' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:124:17
     copy.sort((a, b) => a.title.localeCompare(b.title, undefined, { sensitivity: 'base' }));
   } else if (sort === 'POPULAR') {
     copy.sort(
-      (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
+      (a, b) => false,
     );
   } else {
killedBy: CatalogService.listCatalogue — POPULAR sort orders by enrollmentCount descending, treating a missing count as 0
statusReason: expected [ 'c-low', 'c-high', 'c-none' ] to deeply equal [ 'c-high', 'c-low', 'c-none' ]

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:126:10
     copy.sort(
       (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
     );
-  } else {
-    copy.sort(compareNewest);
-  }
+  } else {}
   return copy;
 }
killedBy: CatalogService.listCatalogue sorts NEWEST by publishedAt descending
statusReason: expected [ 'old', 'new' ] to deeply equal [ 'new', 'old' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:127:5
       (a, b) => (b.enrollmentCount ?? 0) - (a.enrollmentCount ?? 0) || compareNewest(a, b),
     );
   } else {
-    copy.sort(compareNewest);
+    copy;
   }
   return copy;
killedBy: CatalogService.listCatalogue sorts NEWEST by publishedAt descending
statusReason: expected [ 'old', 'new' ] to deeply equal [ 'new', 'old' ]

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:133:60
 }
 
 /** Title match outranks a description-only match. */
-function relevanceScore(course: Course, q: string): number {
-  if (course.title.toLowerCase().includes(q)) return 2;
-  if (course.description.toLowerCase().includes(q)) return 1;
-  return 0;
-}
+function relevanceScore(course: Course, q: string): number {}
 
 function toSummary(course: Course, names: Map<UserId, string>): CourseSummary {
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [] to deeply equal [ 'c-1', 'c-2' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:134:7
 
 /** Title match outranks a description-only match. */
 function relevanceScore(course: Course, q: string): number {
-  if (course.title.toLowerCase().includes(q)) return 2;
+  if (true) return 2;
   if (course.description.toLowerCase().includes(q)) return 1;
   return 0;
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-1', 'c-2', 'c-3' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] MethodExpression
src/lib/catalog/catalog.service.ts:134:7
 
 /** Title match outranks a description-only match. */
 function relevanceScore(course: Course, q: string): number {
-  if (course.title.toLowerCase().includes(q)) return 2;
+  if (course.title.toUpperCase().includes(q)) return 2;
   if (course.description.toLowerCase().includes(q)) return 1;
   return 0;
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-2' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:135:7
 /** Title match outranks a description-only match. */
 function relevanceScore(course: Course, q: string): number {
   if (course.title.toLowerCase().includes(q)) return 2;
-  if (course.description.toLowerCase().includes(q)) return 1;
+  if (true) return 1;
   return 0;
 }
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-1', 'c-2', 'c-3' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] ConditionalExpression
src/lib/catalog/catalog.service.ts:135:7
 /** Title match outranks a description-only match. */
 function relevanceScore(course: Course, q: string): number {
   if (course.title.toLowerCase().includes(q)) return 2;
-  if (course.description.toLowerCase().includes(q)) return 1;
+  if (false) return 1;
   return 0;
 }
killedBy: CatalogService.search matches title and description case-insensitively
statusReason: expected [ 'c-1' ] to deeply equal [ 'c-1', 'c-2' ]

[Killed] BlockStatement
src/lib/catalog/catalog.service.ts:139:79
   return 0;
 }
 
-function toSummary(course: Course, names: Map<UserId, string>): CourseSummary {
-  return {
-    id: course.id,
-    title: course.title,
-    description: course.description,
-    category: course.category,
-    difficulty: course.difficulty,
-    instructorDisplayName: names.get(course.instructorId) ?? 'Instructor',
-    publishedAt: publishedAt(course),
-  };
-}
+function toSummary(course: Course, names: Map<UserId, string>): CourseSummary {}
 
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'id')
