[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:35:9
       .switchToHttp()
       .getRequest<{ headers: Record<string, string | string[] | undefined> }>();
     const header = req.headers['authorization'];
-    if (!header || typeof header !== 'string' || !header.startsWith('Bearer ')) {
+    if (false) {
       throw new PubSubInvalidTokenException('missing or malformed Authorization header');
     }
killedBy: PubSubPushGuard rejects when Authorization header is missing
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of PubSubInvalidTokenException

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:35:9
       .switchToHttp()
       .getRequest<{ headers: Record<string, string | string[] | undefined> }>();
     const header = req.headers['authorization'];
-    if (!header || typeof header !== 'string' || !header.startsWith('Bearer ')) {
+    if (false || !header.startsWith('Bearer ')) {
       throw new PubSubInvalidTokenException('missing or malformed Authorization header');
     }
killedBy: PubSubPushGuard rejects when Authorization header is missing
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of PubSubInvalidTokenException

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:48:9
     } catch (err) {
       throw new PubSubInvalidTokenException((err as Error).message);
     }
-    if (!payload) throw new PubSubInvalidTokenException('empty payload');
+    if (false) throw new PubSubInvalidTokenException('empty payload');
 
     if (payload.iss !== GOOGLE_ISSUER) {
killedBy: PubSubPushGuard rejects when the verifier yields an empty payload
statusReason: expected TypeError: Cannot read properties of unde… to match object { code: 'PUBSUB_INVALID_TOKEN', …(1) }

[Killed] EqualityOperator
lib/video/webhook/pubsub-push.guard.ts:50:9
     }
     if (!payload) throw new PubSubInvalidTokenException('empty payload');
 
-    if (payload.iss !== GOOGLE_ISSUER) {
+    if (payload.iss === GOOGLE_ISSUER) {
       throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
     }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token invali… { …(3) }" instead of resolving

[Killed] BlockStatement
lib/video/webhook/pubsub-push.guard.ts:50:40
     }
     if (!payload) throw new PubSubInvalidTokenException('empty payload');
 
-    if (payload.iss !== GOOGLE_ISSUER) {
-      throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
-    }
+    if (payload.iss !== GOOGLE_ISSUER) {}
     if (typeof payload.exp !== 'number' || payload.exp * 1000 < Date.now()) {
       throw new PubSubInvalidTokenException('token expired');
killedBy: PubSubPushGuard rejects when issuer is wrong
statusReason: promise resolved "true" instead of rejecting

[Killed] LogicalOperator
lib/video/webhook/pubsub-push.guard.ts:53:9
     if (payload.iss !== GOOGLE_ISSUER) {
       throw new PubSubInvalidTokenException(`unexpected issuer ${payload.iss}`);
     }
-    if (typeof payload.exp !== 'number' || payload.exp * 1000 < Date.now()) {
+    if (typeof payload.exp !== 'number' && payload.exp * 1000 < Date.now()) {
       throw new PubSubInvalidTokenException('token expired');
     }
killedBy: PubSubPushGuard rejects when the token carries no numeric exp claim
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:57:9
       throw new PubSubInvalidTokenException('token expired');
     }
     const aud = Array.isArray(payload.aud) ? payload.aud[0] : payload.aud;
-    if (aud !== this.cfg.webhookAudience) {
+    if (false) {
       throw new PubSubWrongAudienceException();
     }
killedBy: PubSubPushGuard rejects when audience does not match
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
lib/video/webhook/pubsub-push.guard.ts:60:9
     if (aud !== this.cfg.webhookAudience) {
       throw new PubSubWrongAudienceException();
     }
-    if (payload.email !== this.cfg.invokerSaEmail) {
+    if (true) {
       throw new PubSubWrongInvokerException();
     }
killedBy: PubSubPushGuard passes when issuer + audience + email match and not expired
statusReason: promise rejected "VideoException: Pub/Sub OIDC token email … { …(3) }" instead of resolving
