[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:37:44
 export type FfprobeRunner = (binary: string, args: string[]) => Promise<{ stdout: string }>;
 
 /** GCS errors expose a numeric `code`; 404 is the canonical "object missing" signal. */
-function isNotFound(err: unknown): boolean {
-  return (err as { code?: number }).code === 404;
-}
+function isNotFound(err: unknown): boolean {}
 
 export interface VideoStoragePort {
killedBy: VideoStorageAdapter.headObject returns null on 404 ("not found") errors
statusReason: No such object

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:38:10
 
 /** GCS errors expose a numeric `code`; 404 is the canonical "object missing" signal. */
 function isNotFound(err: unknown): boolean {
-  return (err as { code?: number }).code === 404;
+  return false;
 }
 
killedBy: VideoStorageAdapter.headObject returns null on 404 ("not found") errors
statusReason: No such object

[Killed] EqualityOperator
src/lib/video/video-storage.adapter.ts:38:10
 
 /** GCS errors expose a numeric `code`; 404 is the canonical "object missing" signal. */
 function isNotFound(err: unknown): boolean {
-  return (err as { code?: number }).code === 404;
+  return (err as {
+  code?: number;
+}).code !== 404;
 }
 
killedBy: VideoStorageAdapter.headObject returns null on 404 ("not found") errors
statusReason: No such object

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:75:33
     path: string;
     contentType: string;
     videoId: string;
-  }): Promise<ResumableSession> {
-    // CORS origin on the GCS resumable upload session: scope to the
-    // application's own origin so a leaked upload URI cannot be exercised
-    // from a third-party domain via a browser. Falls back to the SPA's local
-    // dev URL when the env var is unset (dev-only configuration).
-    const origin = process.env['LEARNWREN_PUBLIC_URL'] ?? 'http://localhost:4200';
-    const [uri] = await this.fileRef(input).createResumableUpload({
-      metadata: {
-        contentType: input.contentType,
-        metadata: { videoId: input.videoId },
-      },
-      origin,
-    });
-    return {
-      uri,
-      expiresAt: new Date(Date.now() + 7 * 24 * 3600 * 1000).toISOString(),
-    };
-  }
+  }): Promise<ResumableSession> {}
 
   async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {

[NoCoverage] LogicalOperator
src/lib/video/video-storage.adapter.ts:80:20
     // application's own origin so a leaked upload URI cannot be exercised
     // from a third-party domain via a browser. Falls back to the SPA's local
     // dev URL when the env var is unset (dev-only configuration).
-    const origin = process.env['LEARNWREN_PUBLIC_URL'] ?? 'http://localhost:4200';
+    const origin = process.env['LEARNWREN_PUBLIC_URL'] && 'http://localhost:4200';
     const [uri] = await this.fileRef(input).createResumableUpload({
       metadata: {

[NoCoverage] ObjectLiteral
src/lib/video/video-storage.adapter.ts:81:67
     // from a third-party domain via a browser. Falls back to the SPA's local
     // dev URL when the env var is unset (dev-only configuration).
     const origin = process.env['LEARNWREN_PUBLIC_URL'] ?? 'http://localhost:4200';
-    const [uri] = await this.fileRef(input).createResumableUpload({
-      metadata: {
-        contentType: input.contentType,
-        metadata: { videoId: input.videoId },
-      },
-      origin,
-    });
+    const [uri] = await this.fileRef(input).createResumableUpload({});
     return {
       uri,

[NoCoverage] ArithmeticOperator
src/lib/video/video-storage.adapter.ts:90:40
     });
     return {
       uri,
-      expiresAt: new Date(Date.now() + 7 * 24 * 3600 * 1000).toISOString(),
+      expiresAt: new Date(Date.now() + 7 * 24 / 3600 * 1000).toISOString(),
     };
   }

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:94:93
     };
   }
 
-  async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {
-    try {
-      const [meta] = await this.fileRef(input).getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
-      if (isNotFound(err)) return null;
-      throw err;
-    }
-  }
+  async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {}
 
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {
killedBy: VideoStorageAdapter.headObject parses a string size into a number
statusReason: expected undefined to deeply equal { size: 12345 }

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:95:9
   }
 
   async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {
-    try {
-      const [meta] = await this.fileRef(input).getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
+    try {} catch (err) {
       if (isNotFound(err)) return null;
       throw err;
killedBy: VideoStorageAdapter.headObject parses a string size into a number
statusReason: expected undefined to deeply equal { size: 12345 }

[Killed] EqualityOperator
src/lib/video/video-storage.adapter.ts:97:20
   async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {
     try {
       const [meta] = await this.fileRef(input).getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
+      const size = typeof meta.size !== 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {
killedBy: VideoStorageAdapter.headObject parses a string size into a number
statusReason: expected { size: '12345' } to deeply equal { size: 12345 }

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:97:20
   async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {
     try {
       const [meta] = await this.fileRef(input).getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
+      const size = false ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {
killedBy: VideoStorageAdapter.headObject parses a string size into a number
statusReason: expected { size: '12345' } to deeply equal { size: 12345 }

[Killed] ObjectLiteral
src/lib/video/video-storage.adapter.ts:98:14
     try {
       const [meta] = await this.fileRef(input).getMetadata();
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
+      return {};
     } catch (err) {
       if (isNotFound(err)) return null;
killedBy: VideoStorageAdapter.headObject parses a string size into a number
statusReason: expected {} to deeply equal { size: 12345 }

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:99:19
       const [meta] = await this.fileRef(input).getMetadata();
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
-    } catch (err) {
-      if (isNotFound(err)) return null;
-      throw err;
-    }
+    } catch (err) {}
   }
 
killedBy: VideoStorageAdapter.headObject returns null on 404 ("not found") errors
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:100:11
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {
-      if (isNotFound(err)) return null;
+      if (true) return null;
       throw err;
     }
killedBy: VideoStorageAdapter.headObject rethrows non-404 storage errors
statusReason: promise resolved "null" instead of rejecting

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:100:11
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {
-      if (isNotFound(err)) return null;
+      if (false) return null;
       throw err;
     }
killedBy: VideoStorageAdapter.headObject returns null on 404 ("not found") errors
statusReason: No such object

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:105:78
     }
   }
 
-  async deleteObject(input: { bucket: string; path: string }): Promise<void> {
-    try {
-      await this.fileRef(input).delete();
-    } catch (err) {
-      if (isNotFound(err)) return;
-      throw err;
-    }
-  }
+  async deleteObject(input: { bucket: string; path: string }): Promise<void> {}
 
   async deletePrefix(input: { bucket: string; prefix: string }): Promise<void> {
killedBy: VideoStorageAdapter.deleteObject resolves on a successful delete
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:106:9
   }
 
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {
-    try {
-      await this.fileRef(input).delete();
-    } catch (err) {
+    try {} catch (err) {
       if (isNotFound(err)) return;
       throw err;
killedBy: VideoStorageAdapter.deleteObject resolves on a successful delete
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:108:19
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {
     try {
       await this.fileRef(input).delete();
-    } catch (err) {
-      if (isNotFound(err)) return;
-      throw err;
-    }
+    } catch (err) {}
   }
 
killedBy: VideoStorageAdapter.deleteObject rethrows non-404 delete errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:109:11
     try {
       await this.fileRef(input).delete();
     } catch (err) {
-      if (isNotFound(err)) return;
+      if (true) return;
       throw err;
     }
killedBy: VideoStorageAdapter.deleteObject rethrows non-404 delete errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:109:11
     try {
       await this.fileRef(input).delete();
     } catch (err) {
-      if (isNotFound(err)) return;
+      if (false) return;
       throw err;
     }
killedBy: VideoStorageAdapter.deleteObject returns silently when the object is already gone (404)
statusReason: promise rejected "Error: No such object { code: 404 }" instead of resolving

[Killed] ObjectLiteral
src/lib/video/video-storage.adapter.ts:116:59
 
   async deletePrefix(input: { bucket: string; prefix: string }): Promise<void> {
     try {
-      await this.storage.bucket(input.bucket).deleteFiles({ prefix: input.prefix });
+      await this.storage.bucket(input.bucket).deleteFiles({});
     } catch {
       // best-effort; caller logs
killedBy: VideoStorageAdapter.deletePrefix calls bucket.deleteFiles with the prefix
statusReason: expected "vi.fn()" to be called with arguments: [ { prefix: 'videos/v1/' } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:122:84
     }
   }
 
-  async probeSource(input: { bucket: string; path: string }): Promise<SourceProbe> {
-    // Credential-free seam: v4 signed URLs require Application Default
-    // Credentials, which don't exist in the emulator. Return a static probe
-    // (the fake transcoder also doesn't care about real dimensions). Match
-    // the playback-storage fake pattern in signObjectUrl / readManifestObject.
-    if (this.cfg.sourceProbeImpl === 'fake') {
-      return { height: 240, durationSec: 1 };
-    }
-    const [signedUrl] = await this.fileRef(input).getSignedUrl({
-      action: 'read',
-      expires: Date.now() + 60_000,
-      version: 'v4',
-    });
-    return this.runFfprobe(signedUrl);
-  }
+  async probeSource(input: { bucket: string; path: string }): Promise<SourceProbe> {}
 
   /** Run ffprobe against a signed URL and parse the height + duration. */
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: Cannot read properties of undefined (reading 'height')

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:127:9
     // Credentials, which don't exist in the emulator. Return a static probe
     // (the fake transcoder also doesn't care about real dimensions). Match
     // the playback-storage fake pattern in signObjectUrl / readManifestObject.
-    if (this.cfg.sourceProbeImpl === 'fake') {
+    if (true) {
       return { height: 240, durationSec: 1 };
     }
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: expected 240 to be 720 // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:127:9
     // Credentials, which don't exist in the emulator. Return a static probe
     // (the fake transcoder also doesn't care about real dimensions). Match
     // the playback-storage fake pattern in signObjectUrl / readManifestObject.
-    if (this.cfg.sourceProbeImpl === 'fake') {
+    if (false) {
       return { height: 240, durationSec: 1 };
     }
killedBy: VideoStorageAdapter.probeSource returns the static fake probe without signing or running ffprobe when sourceProbeImpl is "fake"
statusReason: (intermediate value) is not iterable

[Killed] ObjectLiteral
src/lib/video/video-storage.adapter.ts:128:14
     // (the fake transcoder also doesn't care about real dimensions). Match
     // the playback-storage fake pattern in signObjectUrl / readManifestObject.
     if (this.cfg.sourceProbeImpl === 'fake') {
-      return { height: 240, durationSec: 1 };
+      return {};
     }
     const [signedUrl] = await this.fileRef(input).getSignedUrl({
killedBy: VideoStorageAdapter.probeSource returns the static fake probe without signing or running ffprobe when sourceProbeImpl is "fake"
statusReason: expected {} to deeply equal { height: 240, durationSec: 1 }

[Killed] ObjectLiteral
src/lib/video/video-storage.adapter.ts:130:64
     if (this.cfg.sourceProbeImpl === 'fake') {
       return { height: 240, durationSec: 1 };
     }
-    const [signedUrl] = await this.fileRef(input).getSignedUrl({
-      action: 'read',
-      expires: Date.now() + 60_000,
-      version: 'v4',
-    });
+    const [signedUrl] = await this.fileRef(input).getSignedUrl({});
     return this.runFfprobe(signedUrl);
   }
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining {"action": "read"} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:139:69
   }
 
   /** Run ffprobe against a signed URL and parse the height + duration. */
-  private async runFfprobe(signedUrl: string): Promise<SourceProbe> {
-    const { stdout } = await this.runner(ffprobeBinaryPath, [
-      '-v', 'error',
-      '-print_format', 'json',
-      '-show_streams',
-      '-show_format',
-      signedUrl,
-    ]);
-    const parsed = JSON.parse(stdout) as {
-      streams?: { codec_type?: string; height?: number }[];
-      format?: { duration?: string };
-    };
-    const videoStream = parsed.streams?.find((s) => s.codec_type === 'video');
-    if (!videoStream || typeof videoStream.height !== 'number') {
-      throw new Error('ffprobe found no video stream in source.');
-    }
-    return {
-      height: videoStream.height,
-      durationSec: Number(parsed.format?.duration ?? '0'),
-    };
-  }
+  private async runFfprobe(signedUrl: string): Promise<SourceProbe> {}
 
   async readManifestObject(input: { bucket: string; path: string }): Promise<string> {
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: Cannot read properties of undefined (reading 'height')

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:152:65
       format?: { duration?: string };
     };
     const videoStream = parsed.streams?.find((s) => s.codec_type === 'video');
-    if (!videoStream || typeof videoStream.height !== 'number') {
-      throw new Error('ffprobe found no video stream in source.');
-    }
+    if (!videoStream || typeof videoStream.height !== 'number') {}
     return {
       height: videoStream.height,
killedBy: VideoStorageAdapter.probeSource throws when no video stream is present
statusReason: expected [Function] to throw error matching /no video stream/i but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:161:86
     };
   }
 
-  async readManifestObject(input: { bucket: string; path: string }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
-      return this.fakeReadManifest(input.path);
-    }
-    const [buf] = await this.fileRef(input).download();
-    return buf.toString('utf-8');
-  }
+  async readManifestObject(input: { bucket: string; path: string }): Promise<string> {}
 
   async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
killedBy: VideoStorageAdapter.readManifestObject downloads the object body as a UTF-8 string
statusReason: expected undefined to be '#EXTM3U\nbody\n' // Object.is equality

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:162:50
   }
 
   async readManifestObject(input: { bucket: string; path: string }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
-      return this.fakeReadManifest(input.path);
-    }
+    if (this.cfg.playbackStorageImpl === 'fake') {}
     const [buf] = await this.fileRef(input).download();
     return buf.toString('utf-8');
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: this.fileRef(...).download is not a function

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:169:97
     return buf.toString('utf-8');
   }
 
-  async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
-      return `gs-stub://${input.bucket}/${input.path}?ttl=${input.ttlSec}`;
-    }
-    const [url] = await this.fileRef(input).getSignedUrl({
-      version: 'v4',
-      action: 'read',
-      expires: Date.now() + input.ttlSec * 1000,
-    });
-    return url;
-  }
+  async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {}
 
   private fileRef(input: { bucket: string; path: string }) {
killedBy: VideoStorageAdapter.signObjectUrl mints a v4 read URL with the provided TTL
statusReason: expected undefined to be 'https://signed/url' // Object.is equality

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:174:16
       return `gs-stub://${input.bucket}/${input.path}?ttl=${input.ttlSec}`;
     }
     const [url] = await this.fileRef(input).getSignedUrl({
-      version: 'v4',
+      version: "",
       action: 'read',
       expires: Date.now() + input.ttlSec * 1000,
killedBy: VideoStorageAdapter.signObjectUrl mints a v4 read URL with the provided TTL
statusReason: expected '' to be 'v4' // Object.is equality

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:181:60
     return url;
   }
 
-  private fileRef(input: { bucket: string; path: string }) {
-    return this.storage.bucket(input.bucket).file(input.path);
-  }
+  private fileRef(input: { bucket: string; path: string }) {}
 
   private fakeReadManifest(p: string): string {
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: Cannot read properties of undefined (reading 'getSignedUrl')

[Killed] MethodExpression
src/lib/video/video-storage.adapter.ts:186:9
   }
 
   private fakeReadManifest(p: string): string {
-    if (p.endsWith('/manifest.m3u8')) {
+    if (p.startsWith('/manifest.m3u8')) {
       return [
         '#EXTM3U',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: fake storage: unknown manifest path videos/v1/hls/manifest.m3u8

[Killed] ArrayDeclaration
src/lib/video/video-storage.adapter.ts:187:14
 
   private fakeReadManifest(p: string): string {
     if (p.endsWith('/manifest.m3u8')) {
-      return [
-        '#EXTM3U',
-        '#EXT-X-VERSION:6',
-        '#EXT-X-STREAM-INF:BANDWIDTH=5000000,RESOLUTION=1920x1080',
-        '1080p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=3000000,RESOLUTION=1280x720',
-        '720p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=1500000,RESOLUTION=854x480',
-        '480p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=800000,RESOLUTION=640x360',
-        '360p/playlist.m3u8',
-        '',
-      ].join('\n');
+      return [].join('\n');
     }
     if (p.endsWith('/playlist.m3u8')) {
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: expected '' to match /^#EXTM3U/

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:188:9
   private fakeReadManifest(p: string): string {
     if (p.endsWith('/manifest.m3u8')) {
       return [
-        '#EXTM3U',
+        "",
         '#EXT-X-VERSION:6',
         '#EXT-X-STREAM-INF:BANDWIDTH=5000000,RESOLUTION=1920x1080',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: expected '\n#EXT-X-VERSION:6\n#EXT-X-STREAM-INF…' to match /^#EXTM3U/

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:193:9
         '#EXT-X-STREAM-INF:BANDWIDTH=5000000,RESOLUTION=1920x1080',
         '1080p/playlist.m3u8',
         '#EXT-X-STREAM-INF:BANDWIDTH=3000000,RESOLUTION=1280x720',
-        '720p/playlist.m3u8',
+        "",
         '#EXT-X-STREAM-INF:BANDWIDTH=1500000,RESOLUTION=854x480',
         '480p/playlist.m3u8',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-STR…' to contain '720p/playlist.m3u8'

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:195:9
         '#EXT-X-STREAM-INF:BANDWIDTH=3000000,RESOLUTION=1280x720',
         '720p/playlist.m3u8',
         '#EXT-X-STREAM-INF:BANDWIDTH=1500000,RESOLUTION=854x480',
-        '480p/playlist.m3u8',
+        "",
         '#EXT-X-STREAM-INF:BANDWIDTH=800000,RESOLUTION=640x360',
         '360p/playlist.m3u8',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-STR…' to contain '480p/playlist.m3u8'

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:196:9
         '720p/playlist.m3u8',
         '#EXT-X-STREAM-INF:BANDWIDTH=1500000,RESOLUTION=854x480',
         '480p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=800000,RESOLUTION=640x360',
+        "",
         '360p/playlist.m3u8',
         '',

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:201:9
         '',
       ].join('\n');
     }
-    if (p.endsWith('/playlist.m3u8')) {
+    if (true) {
       return [
         '#EXTM3U',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject throws when the path is unknown to the fake
statusReason: promise resolved "'#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…'" instead of rejecting

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:205:9
       return [
         '#EXTM3U',
         '#EXT-X-VERSION:6',
-        '#EXT-X-TARGETDURATION:6',
+        "",
         '#EXT-X-KEY:METHOD=AES-128,URI="https://example.invalid/k",IV=0xABCDEF0123456789ABCDEF0123456789',
         '#EXTINF:6.000,',

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:208:9
         '#EXT-X-TARGETDURATION:6',
         '#EXT-X-KEY:METHOD=AES-128,URI="https://example.invalid/k",IV=0xABCDEF0123456789ABCDEF0123456789',
         '#EXTINF:6.000,',
-        'segment_001.ts',
+        "",
         '#EXTINF:6.000,',
         'segment_002.ts',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic rendition m3u8 for /playlist.m3u8 paths
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain 'segment_001.ts'

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:209:9
         '#EXT-X-KEY:METHOD=AES-128,URI="https://example.invalid/k",IV=0xABCDEF0123456789ABCDEF0123456789',
         '#EXTINF:6.000,',
         'segment_001.ts',
-        '#EXTINF:6.000,',
+        "",
         'segment_002.ts',
         '#EXT-X-ENDLIST',

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:210:9
         '#EXTINF:6.000,',
         'segment_001.ts',
         '#EXTINF:6.000,',
-        'segment_002.ts',
+        "",
         '#EXT-X-ENDLIST',
         '',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic rendition m3u8 for /playlist.m3u8 paths
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain 'segment_002.ts'

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:212:9
         '#EXTINF:6.000,',
         'segment_002.ts',
         '#EXT-X-ENDLIST',
-        '',
+        "Stryker was here!",
       ].join('\n');
     }

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:213:14
         'segment_002.ts',
         '#EXT-X-ENDLIST',
         '',
-      ].join('\n');
+      ].join("");
     }
     throw new Error(`fake storage: unknown manifest path ${p}`);
