[Killed] ConditionalExpression
src/lib/video/video.config.ts:41:24
   // Outside production the video stack defaults to its credential-free fake
   // mode, so `nx serve` and the e2e suite boot with no GCP project, buckets,
   // or secrets. Production still requires real buckets and a real transcoder.
-  const isProduction = env['NODE_ENV'] === 'production';
+  const isProduction = false;
 
   const sourceBucket = isProduction
killedBy: readVideoConfigFromEnv throws when a bucket is missing in production
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/video/video.config.ts:52:5
   const stuckThresholdMinutes = readPositiveNumber(
     env,
     'LEARNWREN_VIDEO_STUCK_THRESHOLD_MINUTES',
-    '30',
+    "",
   );
   const pollIntervalMs = readPositiveNumber(
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_STUCK_THRESHOLD_MINUTES must be a positive number, got "".

[Killed] StringLiteral
src/lib/video/video.config.ts:65:31
     '14400',
   );
 
-  const playbackFakeRaw = env['LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE'];
+  const playbackFakeRaw = env[""];
   let playbackStorageImpl: 'real' | 'fake';
   if (playbackFakeRaw === 'true') {
killedBy: readVideoConfigFromEnv — playback storage flag treats any non-"true" value as "real"
statusReason: expected 'fake' to be 'real' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:70:51
   if (playbackFakeRaw === 'true') {
     playbackStorageImpl = 'fake';
   } else if (playbackFakeRaw === undefined) {
-    playbackStorageImpl = isProduction ? 'real' : 'fake';
+    playbackStorageImpl = isProduction ? 'real' : "";
   } else {
     playbackStorageImpl = 'real';
killedBy: readVideoConfigFromEnv defaults the video stack to fake mode outside production
statusReason: expected '' to be 'fake' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:72:27
   } else if (playbackFakeRaw === undefined) {
     playbackStorageImpl = isProduction ? 'real' : 'fake';
   } else {
-    playbackStorageImpl = 'real';
+    playbackStorageImpl = "";
   }
   if (playbackStorageImpl === 'fake' && isProduction) {
killedBy: readVideoConfigFromEnv — playback storage flag treats any non-"true" value as "real"
statusReason: expected '' to be 'real' // Object.is equality

[Killed] LogicalOperator
src/lib/video/video.config.ts:74:7
   } else {
     playbackStorageImpl = 'real';
   }
-  if (playbackStorageImpl === 'fake' && isProduction) {
+  if (playbackStorageImpl === 'fake' || isProduction) {
     throw new Error(
       'LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.

[Killed] StringLiteral
src/lib/video/video.config.ts:76:7
   }
   if (playbackStorageImpl === 'fake' && isProduction) {
     throw new Error(
-      'LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.',
+      "",
     );
   }
killedBy: readVideoConfigFromEnv — playback storage flag rejects fake playback storage in production
statusReason: expected [Function] to throw error matching /production/i but got ''

[Killed] BlockStatement
src/lib/video/video.config.ts:82:38
 
   const sourceProbeFakeRaw = env['LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE'];
   let sourceProbeImpl: 'real' | 'fake';
-  if (sourceProbeFakeRaw === 'true') {
-    sourceProbeImpl = 'fake';
-  } else if (sourceProbeFakeRaw === undefined) {
+  if (sourceProbeFakeRaw === 'true') {} else if (sourceProbeFakeRaw === undefined) {
     sourceProbeImpl = isProduction ? 'real' : 'fake';
   } else {
killedBy: readVideoConfigFromEnv — playback storage flag honors LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE=true
statusReason: expected undefined to be 'fake' // Object.is equality

[Killed] EqualityOperator
src/lib/video/video.config.ts:82:7
 
   const sourceProbeFakeRaw = env['LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE'];
   let sourceProbeImpl: 'real' | 'fake';
-  if (sourceProbeFakeRaw === 'true') {
+  if (sourceProbeFakeRaw !== 'true') {
     sourceProbeImpl = 'fake';
   } else if (sourceProbeFakeRaw === undefined) {
killedBy: readVideoConfigFromEnv — playback storage flag defaults playbackStorageImpl to "real" in production
statusReason: LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE=true is rejected when NODE_ENV=production.

[Killed] StringLiteral
src/lib/video/video.config.ts:83:23
   const sourceProbeFakeRaw = env['LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE'];
   let sourceProbeImpl: 'real' | 'fake';
   if (sourceProbeFakeRaw === 'true') {
-    sourceProbeImpl = 'fake';
+    sourceProbeImpl = "";
   } else if (sourceProbeFakeRaw === undefined) {
     sourceProbeImpl = isProduction ? 'real' : 'fake';
killedBy: readVideoConfigFromEnv — playback storage flag honors LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE=true
statusReason: expected '' to be 'fake' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.config.ts:84:14
   let sourceProbeImpl: 'real' | 'fake';
   if (sourceProbeFakeRaw === 'true') {
     sourceProbeImpl = 'fake';
-  } else if (sourceProbeFakeRaw === undefined) {
+  } else if (false) {
     sourceProbeImpl = isProduction ? 'real' : 'fake';
   } else {
killedBy: readVideoConfigFromEnv — playback storage flag defaults sourceProbeImpl to "fake" outside production
statusReason: expected 'real' to be 'fake' // Object.is equality

[Killed] EqualityOperator
src/lib/video/video.config.ts:84:14
   let sourceProbeImpl: 'real' | 'fake';
   if (sourceProbeFakeRaw === 'true') {
     sourceProbeImpl = 'fake';
-  } else if (sourceProbeFakeRaw === undefined) {
+  } else if (sourceProbeFakeRaw !== undefined) {
     sourceProbeImpl = isProduction ? 'real' : 'fake';
   } else {
killedBy: readVideoConfigFromEnv — playback storage flag defaults sourceProbeImpl to "fake" outside production
statusReason: expected 'real' to be 'fake' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:85:38
   if (sourceProbeFakeRaw === 'true') {
     sourceProbeImpl = 'fake';
   } else if (sourceProbeFakeRaw === undefined) {
-    sourceProbeImpl = isProduction ? 'real' : 'fake';
+    sourceProbeImpl = isProduction ? "" : 'fake';
   } else {
     sourceProbeImpl = 'real';
killedBy: readVideoConfigFromEnv — playback storage flag defaults sourceProbeImpl to "real" in production
statusReason: expected '' to be 'real' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.config.ts:86:10
     sourceProbeImpl = 'fake';
   } else if (sourceProbeFakeRaw === undefined) {
     sourceProbeImpl = isProduction ? 'real' : 'fake';
-  } else {
-    sourceProbeImpl = 'real';
-  }
+  } else {}
   if (sourceProbeImpl === 'fake' && isProduction) {
     throw new Error(
killedBy: readVideoConfigFromEnv — playback storage flag treats any non-"true" value as "real" for the source-probe flag
statusReason: expected undefined to be 'real' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.config.ts:89:7
   } else {
     sourceProbeImpl = 'real';
   }
-  if (sourceProbeImpl === 'fake' && isProduction) {
+  if (false) {
     throw new Error(
       'LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv — playback storage flag rejects fake source-probe in production
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/lib/video/video.config.ts:89:7
   } else {
     sourceProbeImpl = 'real';
   }
-  if (sourceProbeImpl === 'fake' && isProduction) {
+  if (sourceProbeImpl === 'fake' || isProduction) {
     throw new Error(
       'LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_STORAGE_SOURCE_PROBE_FAKE=true is rejected when NODE_ENV=production.

[Killed] EqualityOperator
src/lib/video/video.config.ts:96:7
   }
 
   const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
-  if (implRaw !== 'gcp' && implRaw !== 'fake') {
+  if (implRaw === 'gcp' && implRaw !== 'fake') {
     throw new Error(
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
killedBy: readVideoConfigFromEnv — slice B fields requires gcp-specific vars when transcoderImpl=gcp
statusReason: expected [Function] to throw error matching /LEARNWREN_GCP_PROJECT_ID/ but got 'LEARNWREN_VIDEO_TRANSCODER must be "g…'

[Killed] ConditionalExpression
src/lib/video/video.config.ts:96:7
   }
 
   const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
-  if (implRaw !== 'gcp' && implRaw !== 'fake') {
+  if (true) {
     throw new Error(
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "fake".

[Killed] StringLiteral
src/lib/video/video.config.ts:98:7
   const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
   if (implRaw !== 'gcp' && implRaw !== 'fake') {
     throw new Error(
-      `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
+      ``,
     );
   }
killedBy: readVideoConfigFromEnv — slice B fields rejects an unrecognised LEARNWREN_VIDEO_TRANSCODER value
statusReason: expected [Function] to throw error matching /LEARNWREN_VIDEO_TRANSCODER must be "g…/ but got ''

[Killed] BlockStatement
src/lib/video/video.config.ts:101:43
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
     );
   }
-  if (implRaw === 'fake' && isProduction) {
-    throw new Error(
-      'LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.',
-    );
-  }
+  if (implRaw === 'fake' && isProduction) {}
 
   const base: VideoConfig = {
killedBy: readVideoConfigFromEnv — slice B fields rejects transcoderImpl=fake when NODE_ENV=production
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/lib/video/video.config.ts:107:29
     );
   }
 
-  const base: VideoConfig = {
-    sourceBucket,
-    outputBucket,
-    stuckThresholdMinutes,
-    pollIntervalMs,
-    playbackSignedUrlTtlSec,
-    transcoderImpl: implRaw,
-    playbackStorageImpl,
-    sourceProbeImpl,
-  };
+  const base: VideoConfig = {};
 
   if (implRaw === 'fake') return base;
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: expected undefined to be 'b' // Object.is equality

[Killed] EqualityOperator
src/lib/video/video.config.ts:118:7
     sourceProbeImpl,
   };
 
-  if (implRaw === 'fake') return base;
+  if (implRaw !== 'fake') return base;
 
   return {
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_GCP_PROJECT_ID env var is required.

[Killed] StringLiteral
src/lib/video/video.config.ts:124:40
     ...base,
     gcpProjectId: readRequired(env, 'LEARNWREN_GCP_PROJECT_ID'),
     transcoderLocation: readRequired(env, 'LEARNWREN_TRANSCODER_LOCATION'),
-    transcoderTopic: readRequired(env, 'LEARNWREN_TRANSCODER_TOPIC'),
+    transcoderTopic: readRequired(env, ""),
     webhookAudience: readRequired(env, 'LEARNWREN_TRANSCODER_WEBHOOK_AUDIENCE'),
     invokerSaEmail: readRequired(env, 'LEARNWREN_TRANSCODER_INVOKER_SA_EMAIL'),
killedBy: readVideoConfigFromEnv — slice B fields accepts a complete gcp config
statusReason: env var is required.
