[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:30:56
 export class VideoExceptionFilter implements ExceptionFilter {
   private readonly logger = new Logger('VideoExceptionFilter');
 
-  catch(exception: unknown, host: ArgumentsHost): void {
-    const response = host.switchToHttp().getResponse<Response>();
-    if (isVideoShaped(exception)) {
-      respondShaped(response, exception);
-      return;
-    }
-    if (exception instanceof BadRequestException) {
-      respondValidation(response, exception);
-      return;
-    }
-    this.logger.error(formatLogLine(exception));
-    response.status(500).json({
-      error: { code: 'INTERNAL', message: 'An internal error occurred.' },
-    } satisfies VideoErrorBody);
-  }
+  catch(exception: unknown, host: ArgumentsHost): void {}
 }
 
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Number of calls: 0

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:32:35
 
   catch(exception: unknown, host: ArgumentsHost): void {
     const response = host.switchToHttp().getResponse<Response>();
-    if (isVideoShaped(exception)) {
-      respondShaped(response, exception);
-      return;
-    }
+    if (isVideoShaped(exception)) {}
     if (exception instanceof BadRequestException) {
       respondValidation(response, exception);
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Received:

  1st vi.fn() call:

  [
-   404,

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:32:9
 
   catch(exception: unknown, host: ArgumentsHost): void {
     const response = host.switchToHttp().getResponse<Response>();
-    if (isVideoShaped(exception)) {
+    if (true) {
       respondShaped(response, exception);
       return;
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:36:51
       respondShaped(response, exception);
       return;
     }
-    if (exception instanceof BadRequestException) {
-      respondValidation(response, exception);
-      return;
-    }
+    if (exception instanceof BadRequestException) {}
     this.logger.error(formatLogLine(exception));
     response.status(500).json({
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:36:9
       respondShaped(response, exception);
       return;
     }
-    if (exception instanceof BadRequestException) {
+    if (true) {
       respondValidation(response, exception);
       return;
killedBy: VideoExceptionFilter falls back to INTERNAL for unknown exceptions
statusReason: exception.getResponse is not a function

[Killed] ObjectLiteral
src/lib/video/video.exception-filter.ts:41:31
       return;
     }
     this.logger.error(formatLogLine(exception));
-    response.status(500).json({
-      error: { code: 'INTERNAL', message: 'An internal error occurred.' },
-    } satisfies VideoErrorBody);
+    response.status(500).json({} satisfies VideoErrorBody);
   }
 }
killedBy: VideoExceptionFilter falls back to INTERNAL for unknown exceptions
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:47:79
   }
 }
 
-function isVideoShaped(exception: unknown): exception is VideoShapedException {
-  if (exception instanceof VideoException) return true;
-  if (!(exception instanceof Error)) return false;
-  return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
-}
+function isVideoShaped(exception: unknown): exception is VideoShapedException {}
 
 function respondShaped(response: Response, err: VideoShapedException): void {
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Received:

  1st vi.fn() call:

  [
-   404,

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:48:7
 }
 
 function isVideoShaped(exception: unknown): exception is VideoShapedException {
-  if (exception instanceof VideoException) return true;
+  if (true) return true;
   if (!(exception instanceof Error)) return false;
   return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] BooleanLiteral
src/lib/video/video.exception-filter.ts:48:51
 }
 
 function isVideoShaped(exception: unknown): exception is VideoShapedException {
-  if (exception instanceof VideoException) return true;
+  if (exception instanceof VideoException) return false;
   if (!(exception instanceof Error)) return false;
   return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Received:

  1st vi.fn() call:

  [
-   404,

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:49:7
 
 function isVideoShaped(exception: unknown): exception is VideoShapedException {
   if (exception instanceof VideoException) return true;
-  if (!(exception instanceof Error)) return false;
+  if (true) return false;
   return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
 }
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Received:

  1st vi.fn() call:

  [
-   403,

[Killed] BooleanLiteral
src/lib/video/video.exception-filter.ts:49:7
 
 function isVideoShaped(exception: unknown): exception is VideoShapedException {
   if (exception instanceof VideoException) return true;
-  if (!(exception instanceof Error)) return false;
+  if (exception instanceof Error) return false;
   return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
 }
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Received:

  1st vi.fn() call:

  [
-   403,

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:50:10
 function isVideoShaped(exception: unknown): exception is VideoShapedException {
   if (exception instanceof VideoException) return true;
   if (!(exception instanceof Error)) return false;
-  return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
+  return true;
 }
 
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] LogicalOperator
src/lib/video/video.exception-filter.ts:50:10
 function isVideoShaped(exception: unknown): exception is VideoShapedException {
   if (exception instanceof VideoException) return true;
   if (!(exception instanceof Error)) return false;
-  return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
+  return exception.name === 'AuthException' && exception.constructor.name === 'AuthException';
 }
 
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Received:

  1st vi.fn() call:

  [
-   403,

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:53:77
   return exception.name === 'AuthException' || exception.constructor.name === 'AuthException';
 }
 
-function respondShaped(response: Response, err: VideoShapedException): void {
-  const body: VideoErrorBody = { error: { code: err.code, message: err.message } };
-  if (err.details) body.error.details = err.details;
-  response.status(err.status).json(body);
-}
+function respondShaped(response: Response, err: VideoShapedException): void {}
 
 function respondValidation(response: Response, exception: BadRequestException): void {
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/video/video.exception-filter.ts:54:41
 }
 
 function respondShaped(response: Response, err: VideoShapedException): void {
-  const body: VideoErrorBody = { error: { code: err.code, message: err.message } };
+  const body: VideoErrorBody = { error: {} };
   if (err.details) body.error.details = err.details;
   response.status(err.status).json(body);
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ObjectLiteral
src/lib/video/video.exception-filter.ts:54:32
 }
 
 function respondShaped(response: Response, err: VideoShapedException): void {
-  const body: VideoErrorBody = { error: { code: err.code, message: err.message } };
+  const body: VideoErrorBody = {};
   if (err.details) body.error.details = err.details;
   response.status(err.status).json(body);
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:55:7
 
 function respondShaped(response: Response, err: VideoShapedException): void {
   const body: VideoErrorBody = { error: { code: err.code, message: err.message } };
-  if (err.details) body.error.details = err.details;
+  if (false) body.error.details = err.details;
   response.status(err.status).json(body);
 }
killedBy: VideoExceptionFilter preserves details when present
statusReason: expected undefined to be 'TRANSCODING' // Object.is equality

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:55:7
 
 function respondShaped(response: Response, err: VideoShapedException): void {
   const body: VideoErrorBody = { error: { code: err.code, message: err.message } };
-  if (err.details) body.error.details = err.details;
+  if (true) body.error.details = err.details;
   response.status(err.status).json(body);
 }

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:59:86
   response.status(err.status).json(body);
 }
 
-function respondValidation(response: Response, exception: BadRequestException): void {
-  const payload = exception.getResponse() as { message?: string[] | string };
-  const messages = normalizeMessages(payload.message);
-  response.status(400).json({
-    error: {
-      code: 'VALIDATION_FAILED',
-      message: 'Request body failed validation.',
-      details: { fieldErrors: parseFieldErrors(messages) },
-    },
-  } satisfies VideoErrorBody);
-}
+function respondValidation(response: Response, exception: BadRequestException): void {}
 
 function normalizeMessages(message: string[] | string | undefined): string[] {
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Number of calls: 0

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:71:78
   } satisfies VideoErrorBody);
 }
 
-function normalizeMessages(message: string[] | string | undefined): string[] {
-  if (Array.isArray(message)) return message;
-  return message ? [message] : [];
-}
+function normalizeMessages(message: string[] | string | undefined): string[] {}
 
 function formatLogLine(exception: unknown): string {
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: messages is not iterable

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:72:7
 }
 
 function normalizeMessages(message: string[] | string | undefined): string[] {
-  if (Array.isArray(message)) return message;
+  if (false) return message;
   return message ? [message] : [];
 }
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: msg.split is not a function

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:72:7
 }
 
 function normalizeMessages(message: string[] | string | undefined): string[] {
-  if (Array.isArray(message)) return message;
+  if (true) return message;
   return message ? [message] : [];
 }

[Survived] BlockStatement
src/lib/video/video.exception-filter.ts:76:52
   return message ? [message] : [];
 }
 
-function formatLogLine(exception: unknown): string {
-  if (exception instanceof Error) return exception.stack ?? exception.message;
-  return String(exception);
-}
+function formatLogLine(exception: unknown): string {}
 
 /**

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:77:7
 }
 
 function formatLogLine(exception: unknown): string {
-  if (exception instanceof Error) return exception.stack ?? exception.message;
+  if (true) return exception.stack ?? exception.message;
   return String(exception);
 }

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:77:7
 }
 
 function formatLogLine(exception: unknown): string {
-  if (exception instanceof Error) return exception.stack ?? exception.message;
+  if (false) return exception.stack ?? exception.message;
   return String(exception);
 }
