[Killed] BlockStatement
src/lib/video/video.service.ts:131:54
     return { ...v, state: 'FAILED', failureReason: reason, updatedAt };
   }
 
-  async completeUpload(vid: VideoId): Promise<Video> {
-    const v = await this.getPendingUploadOrThrow(vid);
-    const actualSize = await this.verifyUploadObjectOrThrow(v);
-
-    const probe = await this.tryProbeSource(v);
-    if (!probe.ok) {
-      return this.recordPipelineFailure(vid, 'SOURCE_PROBE_FAILED', probe.error, actualSize);
-    }
-
-    const key = this.generateContentKey();
-    const submit = await this.submitWithRetry(this.buildTranscoderInput(v, probe.value.height, key));
-    if (!submit.ok) {
-      return this.recordPipelineFailure(vid, 'TRANSCODER_SUBMIT_FAILED', submit.lastError, actualSize);
-    }
-
-    return this.repo.finalizeUploadWithJob({
-      vid,
-      lid: v.lessonId,
-      actualSizeBytes: actualSize,
-      key,
-      transcoderJobName: submit.jobName,
-      nowIso: nowIso(),
-    });
-  }
+  async completeUpload(vid: VideoId): Promise<Video> {}
 
   /** Load the video and ensure it is still in PENDING_UPLOAD; throws otherwise. */
killedBy: VideoService.completeUpload — slice A (guard tests) throws VIDEO_NOT_FOUND when the video is missing
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/video/video.service.ts:136:20
     const actualSize = await this.verifyUploadObjectOrThrow(v);
 
     const probe = await this.tryProbeSource(v);
-    if (!probe.ok) {
-      return this.recordPipelineFailure(vid, 'SOURCE_PROBE_FAILED', probe.error, actualSize);
-    }
+    if (!probe.ok) {}
 
     const key = this.generateContentKey();
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: Cannot read properties of undefined (reading 'height')

[Killed] ConditionalExpression
src/lib/video/video.service.ts:136:9
     const actualSize = await this.verifyUploadObjectOrThrow(v);
 
     const probe = await this.tryProbeSource(v);
-    if (!probe.ok) {
+    if (false) {
       return this.recordPipelineFailure(vid, 'SOURCE_PROBE_FAILED', probe.error, actualSize);
     }
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: Cannot read properties of undefined (reading 'height')

[Killed] BlockStatement
src/lib/video/video.service.ts:142:21
 
     const key = this.generateContentKey();
     const submit = await this.submitWithRetry(this.buildTranscoderInput(v, probe.value.height, key));
-    if (!submit.ok) {
-      return this.recordPipelineFailure(vid, 'TRANSCODER_SUBMIT_FAILED', submit.lastError, actualSize);
-    }
+    if (!submit.ok) {}
 
     return this.repo.finalizeUploadWithJob({
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected 'TRANSCODING' to be 'FAILED' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.service.ts:142:9
 
     const key = this.generateContentKey();
     const submit = await this.submitWithRetry(this.buildTranscoderInput(v, probe.value.height, key));
-    if (!submit.ok) {
+    if (false) {
       return this.recordPipelineFailure(vid, 'TRANSCODER_SUBMIT_FAILED', submit.lastError, actualSize);
     }
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected 'TRANSCODING' to be 'FAILED' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.service.ts:143:46
     const key = this.generateContentKey();
     const submit = await this.submitWithRetry(this.buildTranscoderInput(v, probe.value.height, key));
     if (!submit.ok) {
-      return this.recordPipelineFailure(vid, 'TRANSCODER_SUBMIT_FAILED', submit.lastError, actualSize);
+      return this.recordPipelineFailure(vid, "", submit.lastError, actualSize);
     }
 
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/video/video.service.ts:157:71
   }
 
   /** Load the video and ensure it is still in PENDING_UPLOAD; throws otherwise. */
-  private async getPendingUploadOrThrow(vid: VideoId): Promise<Video> {
-    const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
-    if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
-    return v;
-  }
+  private async getPendingUploadOrThrow(vid: VideoId): Promise<Video> {}
 
   /**
killedBy: VideoService.completeUpload — slice A (guard tests) throws VIDEO_NOT_FOUND when the video is missing
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of VideoNotFoundException

[Killed] BlockStatement
src/lib/video/video.service.ts:170:70
    * before throwing — otherwise an attacker could pin a giant blob in storage
    * by skipping completeUpload entirely.
    */
-  private async verifyUploadObjectOrThrow(v: Video): Promise<number> {
-    const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
-    if (!head) throw new UploadObjectMissingException();
-    const declared = v.source.sizeBytes ?? 0;
-    if (head.size > declared * SIZE_TOLERANCE) {
-      await this.storage
-        .deleteObject({ bucket: v.source.bucket, path: v.source.path })
-        .catch(() => undefined);
-      throw new UploadObjectSizeMismatchException();
-    }
-    return head.size;
-  }
+  private async verifyUploadObjectOrThrow(v: Video): Promise<number> {}
 
   private async tryProbeSource(
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_MISSING when HEAD returns null
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/video/video.service.ts:174:48
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
     if (!head) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
-    if (head.size > declared * SIZE_TOLERANCE) {
-      await this.storage
-        .deleteObject({ bucket: v.source.bucket, path: v.source.path })
-        .catch(() => undefined);
-      throw new UploadObjectSizeMismatchException();
-    }
+    if (head.size > declared * SIZE_TOLERANCE) {}
     return head.size;
   }
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes object when over tolerance
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/video/video.service.ts:185:86
 
   private async tryProbeSource(
     v: Video,
-  ): Promise<{ ok: true; value: { height: number } } | { ok: false; error: string }> {
-    try {
-      const probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
-      return { ok: true, value: probe };
-    } catch (err) {
-      const message = (err as Error).message;
-      this.logger.warn(`ffprobe failed for ${v.id}: ${message}`);
-      return { ok: false, error: message };
-    }
-  }
+  ): Promise<{ ok: true; value: { height: number } } | { ok: false; error: string }> {}
 
   private generateContentKey(): { id: VideoKeyId; bytes: Uint8Array } {
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BlockStatement
src/lib/video/video.service.ts:186:9
   private async tryProbeSource(
     v: Video,
   ): Promise<{ ok: true; value: { height: number } } | { ok: false; error: string }> {
-    try {
-      const probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
-      return { ok: true, value: probe };
-    } catch (err) {
+    try {} catch (err) {
       const message = (err as Error).message;
       this.logger.warn(`ffprobe failed for ${v.id}: ${message}`);
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BooleanLiteral
src/lib/video/video.service.ts:188:20
   ): Promise<{ ok: true; value: { height: number } } | { ok: false; error: string }> {
     try {
       const probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
-      return { ok: true, value: probe };
+      return { ok: false, value: probe };
     } catch (err) {
       const message = (err as Error).message;
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/lib/video/video.service.ts:188:14
   ): Promise<{ ok: true; value: { height: number } } | { ok: false; error: string }> {
     try {
       const probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
-      return { ok: true, value: probe };
+      return {};
     } catch (err) {
       const message = (err as Error).message;
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/video/video.service.ts:189:19
     try {
       const probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
       return { ok: true, value: probe };
-    } catch (err) {
-      const message = (err as Error).message;
-      this.logger.warn(`ffprobe failed for ${v.id}: ${message}`);
-      return { ok: false, error: message };
-    }
+    } catch (err) {}
   }
 
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: Cannot read properties of undefined (reading 'ok')

[Killed] BooleanLiteral
src/lib/video/video.service.ts:192:20
     } catch (err) {
       const message = (err as Error).message;
       this.logger.warn(`ffprobe failed for ${v.id}: ${message}`);
-      return { ok: false, error: message };
+      return { ok: true, error: message };
     }
   }
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: Cannot read properties of undefined (reading 'height')

[Killed] BlockStatement
src/lib/video/video.service.ts:196:71
     }
   }
 
-  private generateContentKey(): { id: VideoKeyId; bytes: Uint8Array } {
-    return {
-      id: this.repo.newId<VideoKeyId>(),
-      bytes: new Uint8Array(randomBytes(16)),
-    };
-  }
+  private generateContentKey(): { id: VideoKeyId; bytes: Uint8Array } {}
 
   private buildTranscoderInput(
killedBy: VideoService.completeUpload — slice B happy path: probes, generates key, submits, finalizes to TRANSCODING
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/video/video.service.ts:197:12
   }
 
   private generateContentKey(): { id: VideoKeyId; bytes: Uint8Array } {
-    return {
-      id: this.repo.newId<VideoKeyId>(),
-      bytes: new Uint8Array(randomBytes(16)),
-    };
+    return {};
   }
 
killedBy: VideoService.completeUpload — slice B happy path: probes, generates key, submits, finalizes to TRANSCODING
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/video/video.service.ts:207:50
     v: Video,
     sourceHeight: number,
     key: { id: VideoKeyId; bytes: Uint8Array },
-  ): Parameters<VideoTranscoder['submitJob']>[0] {
-    return {
-      videoId: v.id,
-      sourceUri: `gs://${v.source.bucket}/${v.source.path}`,
-      outputUriPrefix: `gs://${this.cfg.outputBucket}/videos/${v.id}/hls/`,
-      encryptionKey: key,
-      sourceHeight,
-      topic: this.cfg.transcoderTopic ?? '',
-    };
-  }
+  ): Parameters<VideoTranscoder['submitJob']>[0] {}
 
   /**
killedBy: VideoService.completeUpload — slice B passes sourceHeight from the probe to submitJob
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/video/video.service.ts:208:12
     sourceHeight: number,
     key: { id: VideoKeyId; bytes: Uint8Array },
   ): Parameters<VideoTranscoder['submitJob']>[0] {
-    return {
-      videoId: v.id,
-      sourceUri: `gs://${v.source.bucket}/${v.source.path}`,
-      outputUriPrefix: `gs://${this.cfg.outputBucket}/videos/${v.id}/hls/`,
-      encryptionKey: key,
-      sourceHeight,
-      topic: this.cfg.transcoderTopic ?? '',
-    };
+    return {};
   }
 
killedBy: VideoService.completeUpload — slice B passes sourceHeight from the probe to submitJob
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
src/lib/video/video.service.ts:211:24
     return {
       videoId: v.id,
       sourceUri: `gs://${v.source.bucket}/${v.source.path}`,
-      outputUriPrefix: `gs://${this.cfg.outputBucket}/videos/${v.id}/hls/`,
+      outputUriPrefix: ``,
       encryptionKey: key,
       sourceHeight,
killedBy: VideoService.completeUpload — slice B builds the transcoder job input with source/output URIs, key, height and videoId
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Survived] LogicalOperator
src/lib/video/video.service.ts:214:14
       outputUriPrefix: `gs://${this.cfg.outputBucket}/videos/${v.id}/hls/`,
       encryptionKey: key,
       sourceHeight,
-      topic: this.cfg.transcoderTopic ?? '',
+      topic: this.cfg.transcoderTopic && '',
     };
   }

[Killed] BlockStatement
src/lib/video/video.service.ts:228:21
     code: 'SOURCE_PROBE_FAILED' | 'TRANSCODER_SUBMIT_FAILED',
     detail: string,
     actualSizeBytes: number,
-  ): Promise<Video> {
-    return this.repo.markFailedFromSubmission({
-      vid,
-      failureReason: `${code}: ${detail}`.slice(0, 500),
-      actualSizeBytes,
-      nowIso: nowIso(),
-    });
-  }
+  ): Promise<Video> {}
 
   private async submitWithRetry(
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: Cannot read properties of undefined (reading 'state')

[Survived] MethodExpression
src/lib/video/video.service.ts:231:22
   ): Promise<Video> {
     return this.repo.markFailedFromSubmission({
       vid,
-      failureReason: `${code}: ${detail}`.slice(0, 500),
+      failureReason: `${code}: ${detail}`,
       actualSizeBytes,
       nowIso: nowIso(),

[Killed] StringLiteral
src/lib/video/video.service.ts:231:22
   ): Promise<Video> {
     return this.repo.markFailedFromSubmission({
       vid,
-      failureReason: `${code}: ${detail}`.slice(0, 500),
+      failureReason: ``.slice(0, 500),
       actualSizeBytes,
       nowIso: nowIso(),
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/video/video.service.ts:241:27
     input: Parameters<VideoTranscoder['submitJob']>[0],
   ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
     let lastError = 'unknown';
-    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
+    for (let attempt = 0; false; attempt++) {
       try {
         const handle = await this.transcoder.submitJob(input);
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/video/video.service.ts:248:13
       } catch (err) {
         lastError = (err as Error).message;
         this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
+        if (false) {
           await this.sleep(BACKOFF_MS[attempt]!);
         }
killedBy: VideoService.completeUpload — slice B sleeps with exponential backoff between retries but not after the final attempt
statusReason: expected [] to deeply equal [ [ 1000 ], [ 2000 ] ]

[Killed] EqualityOperator
src/lib/video/video.service.ts:260:9
     event: TranscoderEvent,
   ): Promise<{ acted: boolean; reason?: string }> {
     const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
-    if (event.type === 'JOB_SUCCEEDED') {
+    if (event.type !== 'JOB_SUCCEEDED') {
       return this.repo.applyTranscoderResult({
         ...common,
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/video/video.service.ts:261:46
   ): Promise<{ acted: boolean; reason?: string }> {
     const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
     if (event.type === 'JOB_SUCCEEDED') {
-      return this.repo.applyTranscoderResult({
-        ...common,
-        outcome: {
-          kind: 'READY',
-          manifestPath: event.manifestPath,
-          durationSec: event.durationSec,
-          outputBucket: this.cfg.outputBucket,
-        },
-      });
+      return this.repo.applyTranscoderResult({});
     }
     return this.repo.applyTranscoderResult({
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/video/video.service.ts:271:44
         },
       });
     }
-    return this.repo.applyTranscoderResult({
-      ...common,
-      outcome: { kind: 'FAILED', reason: event.reason },
-    });
+    return this.repo.applyTranscoderResult({});
   }
 
killedBy: VideoService.handleTranscoderEvent forwards JOB_FAILED with FAILED outcome carrying reason
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/lib/video/video.service.ts:277:45
     });
   }
 
-  async delete(vid: VideoId): Promise<void> {
-    const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
-    if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
-    await this.tearDownVideoSideEffects(v, { logCancelFailures: true });
-    await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
-  }
+  async delete(vid: VideoId): Promise<void> {}
 
   async deleteForLesson(lid: LessonId): Promise<void> {
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'src-bucket', …(1) } ]

Number of calls: 0

[Survived] BooleanLiteral
src/lib/video/video.service.ts:281:65
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
     if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
-    await this.tearDownVideoSideEffects(v, { logCancelFailures: true });
+    await this.tearDownVideoSideEffects(v, { logCancelFailures: false });
     await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
   }

[Killed] BlockStatement
src/lib/video/video.service.ts:285:55
     await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
   }
 
-  async deleteForLesson(lid: LessonId): Promise<void> {
-    const v = await this.repo.getVideoByLesson(lid);
-    if (!v) return;
-    await this.tearDownVideoSideEffects(v, { logCancelFailures: false });
-    await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
-  }
+  async deleteForLesson(lid: LessonId): Promise<void> {}
 
   /**
killedBy: VideoService.deleteForLesson (cascade) cascades regardless of video state
statusReason: expected "vi.fn()" to be called at least once

[Survived] BooleanLiteral
src/lib/video/video.service.ts:288:65
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
     if (!v) return;
-    await this.tearDownVideoSideEffects(v, { logCancelFailures: false });
+    await this.tearDownVideoSideEffects(v, { logCancelFailures: true });
     await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
   }

[Killed] BlockStatement
src/lib/video/video.service.ts:305:20
   private async tearDownVideoSideEffects(
     v: Video,
     opts: { logCancelFailures: boolean },
-  ): Promise<void> {
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
-      const jobName = v.transcoderJobName;
-      await this.transcoder.cancelJob(jobName).catch((err) => {
-        if (opts.logCancelFailures) {
-          this.logger.warn(`cancelJob failed for ${jobName}: ${(err as Error).message}`);
-        }
-      });
-    }
-    if (v.state === 'READY' && v.output?.bucket) {
-      await this.storage.deletePrefix({
-        bucket: v.output.bucket,
-        prefix: `videos/${v.id}/`,
-      });
-    }
-    await this.storage
-      .deleteObject({ bucket: v.source.bucket, path: v.source.path })
-      .catch(() => undefined);
-  }
+  ): Promise<void> {}
 }
 
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'src-bucket', …(1) } ]

Number of calls: 0

[Killed] BlockStatement
src/lib/video/video.service.ts:306:59
     v: Video,
     opts: { logCancelFailures: boolean },
   ): Promise<void> {
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
-      const jobName = v.transcoderJobName;
-      await this.transcoder.cancelJob(jobName).catch((err) => {
-        if (opts.logCancelFailures) {
-          this.logger.warn(`cancelJob failed for ${jobName}: ${(err as Error).message}`);
-        }
-      });
-    }
+    if (v.state === 'TRANSCODING' && v.transcoderJobName) {}
     if (v.state === 'READY' && v.output?.bucket) {
       await this.storage.deletePrefix({
killedBy: VideoService.delete cancels transcoder job and deletes when state is TRANSCODING
statusReason: expected "vi.fn()" to be called with arguments: [ 'jobs/abc' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/video/video.service.ts:306:9
     v: Video,
     opts: { logCancelFailures: boolean },
   ): Promise<void> {
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
+    if (true) {
       const jobName = v.transcoderJobName;
       await this.transcoder.cancelJob(jobName).catch((err) => {
killedBy: VideoService.delete — slice B state widening TRANSCODING with no transcoderJobName: skips cancelJob
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Survived] BlockStatement
src/lib/video/video.service.ts:308:63
   ): Promise<void> {
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       const jobName = v.transcoderJobName;
-      await this.transcoder.cancelJob(jobName).catch((err) => {
-        if (opts.logCancelFailures) {
-          this.logger.warn(`cancelJob failed for ${jobName}: ${(err as Error).message}`);
-        }
-      });
+      await this.transcoder.cancelJob(jobName).catch((err) => {});
     }
     if (v.state === 'READY' && v.output?.bucket) {

[Survived] BlockStatement
src/lib/video/video.service.ts:309:37
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       const jobName = v.transcoderJobName;
       await this.transcoder.cancelJob(jobName).catch((err) => {
-        if (opts.logCancelFailures) {
-          this.logger.warn(`cancelJob failed for ${jobName}: ${(err as Error).message}`);
-        }
+        if (opts.logCancelFailures) {}
       });
     }

[Survived] ConditionalExpression
src/lib/video/video.service.ts:309:13
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       const jobName = v.transcoderJobName;
       await this.transcoder.cancelJob(jobName).catch((err) => {
-        if (opts.logCancelFailures) {
+        if (false) {
           this.logger.warn(`cancelJob failed for ${jobName}: ${(err as Error).message}`);
         }
