[Killed] BlockStatement
src/lib/catalog/catalog.controller.ts:26:69
   constructor(private readonly svc: CatalogService) {}
 
   @Get()
-  list(@Query() query: CatalogQueryDto): Promise<CourseCatalogPage> {
-    return this.svc.listCatalogue(query);
-  }
+  list(@Query() query: CatalogQueryDto): Promise<CourseCatalogPage> {}
 
   @Get('search')
killedBy: CatalogController delegates GET /catalog to listCatalogue
statusReason: expected "vi.fn()" to be called with arguments: [ { page: 2, sort: 'NEWEST' } ]

Number of calls: 0

[Killed] BlockStatement
src/lib/catalog/catalog.controller.ts:31:72
   }
 
   @Get('search')
-  search(@Query() query: CatalogSearchDto): Promise<CourseCatalogPage> {
-    return this.svc.search(query);
-  }
+  search(@Query() query: CatalogSearchDto): Promise<CourseCatalogPage> {}
 
   @Get(':cid')
killedBy: CatalogController delegates GET /catalog/search to search
statusReason: expected "vi.fn()" to be called with arguments: [ { q: 'rust', page: 1 } ]

Number of calls: 0

[Killed] BlockStatement
src/lib/catalog/catalog.controller.ts:36:88
   }
 
   @Get(':cid')
-  detail(@Param('cid', ParseCourseIdPipe) cid: CourseId): Promise<CourseCatalogDetail> {
-    return this.svc.getCourseDetail(cid);
-  }
+  detail(@Param('cid', ParseCourseIdPipe) cid: CourseId): Promise<CourseCatalogDetail> {}
 }
 
killedBy: CatalogController delegates GET /catalog/:cid to getCourseDetail
statusReason: expected "vi.fn()" to be called with arguments: [ 'c-1' ]

Number of calls: 0
