[Killed] StringLiteral
src/lib/catalog/instructor-directory.ts:6:15
 import { FIRESTORE, type FirestoreHandle } from '@learnwren/api-firebase';
 import type { User, UserId } from '@learnwren/shared-data-models';
 
-const USERS = 'users';
+const USERS = "";
 const FALLBACK_NAME = 'Instructor';
 
killedBy: CatalogService.listCatalogue resolves the instructor display name onto each summary
statusReason: expected 'Instructor' to be 'Ada Lovelace' // Object.is equality

[Killed] BlockStatement
src/lib/catalog/instructor-directory.ts:22:71
    * `users/{uid}` documents in parallel, and falls back to "Instructor" for
    * any id with no user document.
    */
-  async displayNamesFor(uids: UserId[]): Promise<Map<UserId, string>> {
-    const unique = [...new Set(uids)];
-    const entries = await Promise.all(
-      unique.map(async (uid): Promise<[UserId, string]> => {
-        const snap = await this.firestore.collection(USERS).doc(uid).get();
-        const data = snap.exists ? (snap.data() as User) : undefined;
-        return [uid, data?.displayName ?? FALLBACK_NAME];
-      }),
-    );
-    return new Map(entries);
-  }
+  async displayNamesFor(uids: UserId[]): Promise<Map<UserId, string>> {}
 }
 
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/lib/catalog/instructor-directory.ts:25:60
   async displayNamesFor(uids: UserId[]): Promise<Map<UserId, string>> {
     const unique = [...new Set(uids)];
     const entries = await Promise.all(
-      unique.map(async (uid): Promise<[UserId, string]> => {
-        const snap = await this.firestore.collection(USERS).doc(uid).get();
-        const data = snap.exists ? (snap.data() as User) : undefined;
-        return [uid, data?.displayName ?? FALLBACK_NAME];
-      }),
+      unique.map(async (uid): Promise<[UserId, string]> => {}),
     );
     return new Map(entries);
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Iterator value undefined is not an entry object

[Killed] LogicalOperator
src/lib/catalog/instructor-directory.ts:28:22
       unique.map(async (uid): Promise<[UserId, string]> => {
         const snap = await this.firestore.collection(USERS).doc(uid).get();
         const data = snap.exists ? (snap.data() as User) : undefined;
-        return [uid, data?.displayName ?? FALLBACK_NAME];
+        return [uid, data?.displayName && FALLBACK_NAME];
       }),
     );
killedBy: CatalogService.listCatalogue resolves the instructor display name onto each summary
statusReason: expected 'Instructor' to be 'Ada Lovelace' // Object.is equality

[Killed] OptionalChaining
src/lib/catalog/instructor-directory.ts:28:22
       unique.map(async (uid): Promise<[UserId, string]> => {
         const snap = await this.firestore.collection(USERS).doc(uid).get();
         const data = snap.exists ? (snap.data() as User) : undefined;
-        return [uid, data?.displayName ?? FALLBACK_NAME];
+        return [uid, data.displayName ?? FALLBACK_NAME];
       }),
     );
killedBy: CatalogService.listCatalogue returns only published courses with pagination metadata
statusReason: Cannot read properties of undefined (reading 'displayName')
