[Killed] Regex
src/lib/catalog/parse-course-id.pipe.ts:21:37
  */
 @Injectable()
 export class ParseCourseIdPipe implements PipeTransform<string, CourseId> {
-  private static readonly PATTERN = /^[A-Za-z0-9_-]{1,64}$/;
+  private static readonly PATTERN = /^[A-Za-z0-9_-]{1,64}/;
 
   transform(value: string, _metadata: ArgumentMetadata): CourseId {
killedBy: ParseCourseIdPipe rejects strings exceeding the 64-char cap
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/lib/catalog/parse-course-id.pipe.ts:23:67
 export class ParseCourseIdPipe implements PipeTransform<string, CourseId> {
   private static readonly PATTERN = /^[A-Za-z0-9_-]{1,64}$/;
 
-  transform(value: string, _metadata: ArgumentMetadata): CourseId {
-    if (typeof value !== 'string' || !ParseCourseIdPipe.PATTERN.test(value)) {
-      throw new CourseNotFoundException();
-    }
-    return value as CourseId;
-  }
+  transform(value: string, _metadata: ArgumentMetadata): CourseId {}
 }
 
killedBy: ParseCourseIdPipe accepts a Firestore auto-id-shaped string
statusReason: expected undefined to be 'aBcDeFgHiJ0123456789' // Object.is equality

[Killed] ConditionalExpression
src/lib/catalog/parse-course-id.pipe.ts:24:9
   private static readonly PATTERN = /^[A-Za-z0-9_-]{1,64}$/;
 
   transform(value: string, _metadata: ArgumentMetadata): CourseId {
-    if (typeof value !== 'string' || !ParseCourseIdPipe.PATTERN.test(value)) {
+    if (true) {
       throw new CourseNotFoundException();
     }
killedBy: ParseCourseIdPipe accepts a Firestore auto-id-shaped string
statusReason: Course not found.

[Killed] ConditionalExpression
src/lib/catalog/parse-course-id.pipe.ts:24:9
   private static readonly PATTERN = /^[A-Za-z0-9_-]{1,64}$/;
 
   transform(value: string, _metadata: ArgumentMetadata): CourseId {
-    if (typeof value !== 'string' || !ParseCourseIdPipe.PATTERN.test(value)) {
+    if (false) {
       throw new CourseNotFoundException();
     }
killedBy: ParseCourseIdPipe rejects empty strings
statusReason: expected function to throw an error, but it didn't
