[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:59:78
     private readonly materialsSvc: MaterialsService,
   ) {}
 
-  async createCourse(uid: UserId, input: CreateCourseInput): Promise<Course> {
-    const now = nowIso();
-    const course: Course = {
-      id: this.repo.newId<CourseId>(),
-      title: input.title,
-      description: input.description,
-      longDescription: input.longDescription,
-      category: input.category,
-      difficulty: input.difficulty,
-      instructorId: uid,
-      status: 'DRAFT',
-      enrollmentCount: 0,
-      createdAt: now,
-      updatedAt: now,
-    };
-    await this.repo.createCourse(course);
-    return course;
-  }
+  async createCourse(uid: UserId, input: CreateCourseInput): Promise<Course> {}
 
   async listCoursesForInstructor(uid: UserId): Promise<Course[]> {
killedBy: CoursesService — course operations createCourse writes a new DRAFT course with generated id and instructor ownership
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
api-courses/src/lib/courses.service.ts:61:28
 
   async createCourse(uid: UserId, input: CreateCourseInput): Promise<Course> {
     const now = nowIso();
-    const course: Course = {
-      id: this.repo.newId<CourseId>(),
-      title: input.title,
-      description: input.description,
-      longDescription: input.longDescription,
-      category: input.category,
-      difficulty: input.difficulty,
-      instructorId: uid,
-      status: 'DRAFT',
-      enrollmentCount: 0,
-      createdAt: now,
-      updatedAt: now,
-    };
+    const course: Course = {};
     await this.repo.createCourse(course);
     return course;
killedBy: CoursesService — course operations createCourse writes a new DRAFT course with generated id and instructor ownership
statusReason: expected undefined to be 'id-1' // Object.is equality

[Killed] ObjectLiteral
api-courses/src/lib/courses.service.ts:93:12
         lessons: await this.repo.listLessonsByModule(cid, m.id),
       })),
     );
-    return { course, modules: childModules };
+    return {};
   }
 
killedBy: CoursesService — course operations getCourseTree returns hydrated course + modules + lessons
statusReason: expected undefined to deeply equal { id: 'cid-1', title: 'T', …(5) }

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:96:78
     return { course, modules: childModules };
   }
 
-  async updateCourse(cid: CourseId, patch: UpdateCourseInput): Promise<void> {
-    // Match the updateModule/updateLesson pattern: pre-check existence so a
-    // PATCH to a since-deleted course (the race between CourseOwnerGuard's
-    // read and this write) surfaces a structured 404 instead of a raw
-    // Firestore NOT_FOUND that the exception filter falls through as 500.
-    const existing = await this.repo.getCourse(cid);
-    if (!existing) throw new CourseNotFoundException();
-    await this.repo.updateCourse(cid, patch);
-  }
+  async updateCourse(cid: CourseId, patch: UpdateCourseInput): Promise<void> {}
 
   async deleteCourse(cid: CourseId): Promise<void> {
killedBy: CoursesService — course operations updateCourse forwards the patch to the repository unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', { title: 'New' } ]

Number of calls: 0

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:102:9
     // read and this write) surfaces a structured 404 instead of a raw
     // Firestore NOT_FOUND that the exception filter falls through as 500.
     const existing = await this.repo.getCourse(cid);
-    if (!existing) throw new CourseNotFoundException();
+    if (false) throw new CourseNotFoundException();
     await this.repo.updateCourse(cid, patch);
   }
killedBy: CoursesService — course operations updateCourse throws CourseNotFoundException when the course is gone
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
api-courses/src/lib/courses.service.ts:102:9
     // read and this write) surfaces a structured 404 instead of a raw
     // Firestore NOT_FOUND that the exception filter falls through as 500.
     const existing = await this.repo.getCourse(cid);
-    if (!existing) throw new CourseNotFoundException();
+    if (existing) throw new CourseNotFoundException();
     await this.repo.updateCourse(cid, patch);
   }
killedBy: CoursesService — course operations updateCourse forwards the patch to the repository unchanged
statusReason: Course not found.

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:133:9
 
   async deleteModule(cid: CourseId, mid: ModuleId): Promise<void> {
     const existing = await this.repo.getModule(cid, mid);
-    if (!existing) throw new ModuleNotFoundException();
+    if (true) throw new ModuleNotFoundException();
     await this.repo.deleteModuleRecursive(cid, mid);
   }
killedBy: CoursesService — module operations deleteModule checks existence then recursive-deletes
statusReason: Module not found.

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:145:30
     );
     await this.repo.writeModuleOrder(cid, ids);
     return ids.map((id, index) => ({
-      ...current.find((m) => m.id === id)!,
+      ...current.find((m) => false)!,
       order: index,
     }));
killedBy: CoursesService — module operations reorderModules places modules in the requested order by id, preserving each doc's other fields
statusReason: expected undefined to be 'mid-3' // Object.is equality

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:145:23
     );
     await this.repo.writeModuleOrder(cid, ids);
     return ids.map((id, index) => ({
-      ...current.find((m) => m.id === id)!,
+      ...current.find(() => undefined)!,
       order: index,
     }));
killedBy: CoursesService — module operations reorderModules places modules in the requested order by id, preserving each doc's other fields
statusReason: expected undefined to be 'mid-3' // Object.is equality

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:164:11
       id,
       moduleId: mid,
       title: input.title,
-      ...(input.description !== undefined ? { description: input.description } : {}),
+      ...(false ? { description: input.description } : {}),
     });
   }
killedBy: CoursesService — lesson operations createLesson appends a new lesson with a generated id
statusReason: expected undefined to be 'first' // Object.is equality

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:175:9
     patch: { title?: string; description?: string },
   ): Promise<void> {
     const existing = await this.repo.getLesson(cid, mid, lid);
-    if (!existing) throw new LessonNotFoundException();
+    if (false) throw new LessonNotFoundException();
     await this.repo.updateLesson(cid, mid, lid, patch);
   }
killedBy: CoursesService — lesson operations updateLesson throws LessonNotFoundException when the lesson is missing
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
api-courses/src/lib/courses.service.ts:201:30
     );
     await this.repo.writeLessonOrder(cid, mid, ids);
     return ids.map((id, index) => ({
-      ...current.find((l) => l.id === id)!,
+      ...current.find((l) => l.id !== id)!,
       order: index,
     }));
killedBy: CoursesService — lesson operations reorderLessons places lessons in the requested order by id, preserving each doc's other fields
statusReason: expected 'lid-1' to be 'lid-3' // Object.is equality

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:201:23
     );
     await this.repo.writeLessonOrder(cid, mid, ids);
     return ids.map((id, index) => ({
-      ...current.find((l) => l.id === id)!,
+      ...current.find(() => undefined)!,
       order: index,
     }));
killedBy: CoursesService — lesson operations reorderLessons places lessons in the requested order by id, preserving each doc's other fields
statusReason: expected undefined to be 'lid-3' // Object.is equality
