[Killed] BlockStatement
src/lib/enrollment/enrollment.controller.ts:41:26
   enroll(
     @Body() body: EnrollCourseDto,
     @Req() req: AuthenticatedRequest,
-  ): Promise<Enrollment> {
-    return this.svc.enroll(req.user!.uid, body.courseId);
-  }
+  ): Promise<Enrollment> {}
 
   @Delete(':courseId')
killedBy: EnrollmentController POST /enrollments enrolls the caller in the body-supplied course
statusReason: expected "vi.fn()" to be called with arguments: [ 'student-1', 'course-1' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/enrollment/enrollment.controller.ts:50:20
   async unenroll(
     @Param('courseId') courseId: CourseId,
     @Req() req: AuthenticatedRequest,
-  ): Promise<void> {
-    await this.svc.unenroll(req.user!.uid, courseId);
-  }
+  ): Promise<void> {}
 
   @Get(':courseId')
killedBy: EnrollmentController DELETE /enrollments/:courseId unenrolls the caller from the path course
statusReason: expected "vi.fn()" to be called with arguments: [ 'student-1', 'course-1' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/enrollment/enrollment.controller.ts:58:36
   getStatus(
     @Param('courseId') courseId: CourseId,
     @Req() req: AuthenticatedRequest,
-  ): Promise<EnrollmentStatusView> {
-    return this.svc.getEnrollmentStatus(req.user!.uid, courseId);
-  }
+  ): Promise<EnrollmentStatusView> {}
 }
 
killedBy: EnrollmentController GET /enrollments/:courseId reports the caller status for that course
statusReason: expected "vi.fn()" to be called with arguments: [ 'student-1', 'course-1' ]

Number of calls: 0
