[Killed] BlockStatement
src/lib/enrollment/enrollment.service.ts:21:73
     private readonly courses: CoursesRepository,
   ) {}
 
-  async enroll(userId: UserId, courseId: CourseId): Promise<Enrollment> {
-    // Advisory owner check. The repository's transactional PUBLISHED check
-    // remains the authority on availability.
-    const course = await this.courses.getCourse(courseId);
-    if (course && course.instructorId === userId) {
-      throw new CannotEnrollOwnCourseException();
-    }
-    return this.enrollments.enroll(userId, courseId);
-  }
+  async enroll(userId: UserId, courseId: CourseId): Promise<Enrollment> {}
 
   async unenroll(userId: UserId, courseId: CourseId): Promise<void> {
killedBy: EnrollmentService.enroll throws CannotEnrollOwnCourseException when the caller owns the course
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/lib/enrollment/enrollment.service.ts:25:19
     // Advisory owner check. The repository's transactional PUBLISHED check
     // remains the authority on availability.
     const course = await this.courses.getCourse(courseId);
-    if (course && course.instructorId === userId) {
+    if (course && course.instructorId !== userId) {
       throw new CannotEnrollOwnCourseException();
     }
killedBy: EnrollmentService.enroll throws CannotEnrollOwnCourseException when the caller owns the course
statusReason: promise resolved "{ id: 'e1' }" instead of rejecting

[Killed] ConditionalExpression
src/lib/enrollment/enrollment.service.ts:25:9
     // Advisory owner check. The repository's transactional PUBLISHED check
     // remains the authority on availability.
     const course = await this.courses.getCourse(courseId);
-    if (course && course.instructorId === userId) {
+    if (false) {
       throw new CannotEnrollOwnCourseException();
     }
killedBy: EnrollmentService.enroll throws CannotEnrollOwnCourseException when the caller owns the course
statusReason: promise resolved "{ id: 'e1' }" instead of rejecting

[Killed] BlockStatement
src/lib/enrollment/enrollment.service.ts:31:69
     return this.enrollments.enroll(userId, courseId);
   }
 
-  async unenroll(userId: UserId, courseId: CourseId): Promise<void> {
-    await this.enrollments.withdraw(userId, courseId);
-  }
+  async unenroll(userId: UserId, courseId: CourseId): Promise<void> {}
 
   async getEnrollmentStatus(
killedBy: EnrollmentService.unenroll delegates to the repository
statusReason: expected "vi.fn()" to be called with arguments: [ 'student-1', 'course-1' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/enrollment/enrollment.service.ts:38:36
   async getEnrollmentStatus(
     userId: UserId,
     courseId: CourseId,
-  ): Promise<EnrollmentStatusView> {
-    const [course, enrollment] = await Promise.all([
-      this.courses.getCourse(courseId),
-      this.enrollments.getEnrollment(userId, courseId),
-    ]);
-    return { enrollment, isOwner: course?.instructorId === userId };
-  }
+  ): Promise<EnrollmentStatusView> {}
 }
 
killedBy: EnrollmentService.getEnrollmentStatus reports isOwner true and the enrollment for the course owner
statusReason: expected undefined to deeply equal { Object (enrollment, isOwner) }

[Killed] ConditionalExpression
src/lib/enrollment/enrollment.service.ts:43:35
       this.courses.getCourse(courseId),
       this.enrollments.getEnrollment(userId, courseId),
     ]);
-    return { enrollment, isOwner: course?.instructorId === userId };
+    return { enrollment, isOwner: false };
   }
 }
killedBy: EnrollmentService.getEnrollmentStatus reports isOwner true and the enrollment for the course owner
statusReason: expected { Object (enrollment, isOwner) } to deeply equal { Object (enrollment, isOwner) }

[Killed] EqualityOperator
src/lib/enrollment/enrollment.service.ts:43:35
       this.courses.getCourse(courseId),
       this.enrollments.getEnrollment(userId, courseId),
     ]);
-    return { enrollment, isOwner: course?.instructorId === userId };
+    return { enrollment, isOwner: course?.instructorId !== userId };
   }
 }
killedBy: EnrollmentService.getEnrollmentStatus reports isOwner true and the enrollment for the course owner
statusReason: expected { Object (enrollment, isOwner) } to deeply equal { Object (enrollment, isOwner) }
