[Killed] BlockStatement
src/lib/errors/courses.exception.ts:79:17
 }
 
 export class CourseNotAvailableException extends CoursesException {
-  constructor() {
-    super('COURSE_NOT_AVAILABLE', 'This course is no longer available.', 409);
-  }
+  constructor() {}
 }
 
killedBy: EnrollmentRepository.enroll throws CourseNotAvailableException when the course is missing
statusReason: expected ReferenceError: Must call super construct… to be an instance of CourseNotAvailableException

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:80:35
 
 export class CourseNotAvailableException extends CoursesException {
   constructor() {
-    super('COURSE_NOT_AVAILABLE', 'This course is no longer available.', 409);
+    super('COURSE_NOT_AVAILABLE', "", 409);
   }
 }
killedBy: slice B enrollment exceptions CourseNotAvailableException is 409 with code COURSE_NOT_AVAILABLE
statusReason: expected '' to be 'This course is no longer available.' // Object.is equality

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:85:17
 }
 
 export class CannotEnrollOwnCourseException extends CoursesException {
-  constructor() {
-    super('CANNOT_ENROLL_OWN_COURSE', 'You cannot enroll in a course you own.', 409);
-  }
+  constructor() {}
 }
 
killedBy: EnrollmentService.enroll throws CannotEnrollOwnCourseException when the caller owns the course
statusReason: expected ReferenceError: Must call super construct… to be an instance of CannotEnrollOwnCourseException

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:91:17
 }
 
 export class NotEnrolledException extends CoursesException {
-  constructor() {
-    super('NOT_ENROLLED', 'You are not enrolled in this course.', 404);
-  }
+  constructor() {}
 }
 
killedBy: slice B enrollment exceptions NotEnrolledException is 404 with code NOT_ENROLLED
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
