[Killed] BlockStatement
src/lib/materials/material-access.guard.ts:21:62
     private readonly enrollment: EnrollmentRepository,
   ) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<MaterialScopedRequest>();
-    const matId = req.params?.['matId'] as MaterialId | undefined;
-    if (!matId) throw new MaterialNotFoundException();
-
-    const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
-
-    if (material.ownerInstructorId === req.user?.uid) {
-      req.material = material;
-      return true;
-    }
-
-    if (req.user && (await this.enrollment.isEnrolled(req.user.uid, material.courseId))) {
-      req.material = material;
-      return true;
-    }
-
-    throw new NotMaterialOwnerException();
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: MaterialAccessGuard passes for the course owner
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/material-access.guard.ts:29:9
     const material = await this.repo.get(matId);
     if (!material) throw new MaterialNotFoundException();
 
-    if (material.ownerInstructorId === req.user?.uid) {
+    if (true) {
       req.material = material;
       return true;
killedBy: MaterialAccessGuard passes for an ACTIVE-enrolled non-owner
statusReason: expected "vi.fn()" to be called with arguments: [ 'student-uid', 'c1' ]

Number of calls: 0

[Killed] LogicalOperator
src/lib/materials/material-access.guard.ts:34:9
       return true;
     }
 
-    if (req.user && (await this.enrollment.isEnrolled(req.user.uid, material.courseId))) {
+    if (req.user || (await this.enrollment.isEnrolled(req.user.uid, material.courseId))) {
       req.material = material;
       return true;
killedBy: MaterialAccessGuard passes for an ACTIVE-enrolled non-owner
statusReason: expected "vi.fn()" to be called with arguments: [ 'student-uid', 'c1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/materials/material-access.guard.ts:34:9
       return true;
     }
 
-    if (req.user && (await this.enrollment.isEnrolled(req.user.uid, material.courseId))) {
+    if (false) {
       req.material = material;
       return true;
killedBy: MaterialAccessGuard passes for an ACTIVE-enrolled non-owner
statusReason: You do not have access to this material.
