[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:48:10
 
 /** GCS errors expose a numeric `code`; 404 is the canonical "object missing" signal. */
 function isNotFound(err: unknown): boolean {
-  return (err as { code?: number }).code === 404;
+  return true;
 }
 
killedBy: MaterialsStorageAdapter — real mode headObject rethrows non-404 errors
statusReason: promise resolved "null" instead of rejecting

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:63:32
     path: string;
     contentType: string;
     materialId: string;
-  }): Promise<SignedUploadUrl> {
-    const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
-      return this.fakeSigned('uploadUrl', input.materialId, expiresMs);
-    }
-    const [url] = await this.fileRef(input).getSignedUrl({
-      version: 'v4',
-      action: 'write',
-      contentType: input.contentType,
-      expires: expiresMs,
-    });
-    return { uploadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
-  }
+  }): Promise<SignedUploadUrl> {}
 
   async headObject(input: {
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: Cannot read properties of undefined (reading 'uploadUrl')

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:65:9
     materialId: string;
   }): Promise<SignedUploadUrl> {
     const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
+    if (false) {
       return this.fakeSigned('uploadUrl', input.materialId, expiresMs);
     }
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: this.fileRef(...).getSignedUrl is not a function

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:65:9
     materialId: string;
   }): Promise<SignedUploadUrl> {
     const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
+    if (true) {
       return this.fakeSigned('uploadUrl', input.materialId, expiresMs);
     }
killedBy: MaterialsStorageAdapter — real mode signUploadUrl asks Cloud Storage for a v4 write URL bound to the content-type
statusReason: expected '/api/internal/fake-materials/m1' to be 'https://signed.example/upload' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials-storage.adapter.ts:66:30
   }): Promise<SignedUploadUrl> {
     const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
     if (this.cfg.storageImpl === 'fake') {
-      return this.fakeSigned('uploadUrl', input.materialId, expiresMs);
+      return this.fakeSigned("", input.materialId, expiresMs);
     }
     const [url] = await this.fileRef(input).getSignedUrl({
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: expected undefined to be '/api/internal/fake-materials/m1' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:80:46
   async headObject(input: {
     bucket: string;
     path: string;
-  }): Promise<MaterialObjectMetadata | null> {
-    try {
-      const [meta] = await this.fileRef(input).getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
-      if (isNotFound(err)) return null;
-      throw err;
-    }
-  }
+  }): Promise<MaterialObjectMetadata | null> {}
 
   async signDownloadUrl(input: {
killedBy: MaterialsStorageAdapter — real mode headObject returns the numeric size when metadata size is a string
statusReason: expected undefined to deeply equal { size: 4096 }

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:81:9
     bucket: string;
     path: string;
   }): Promise<MaterialObjectMetadata | null> {
-    try {
-      const [meta] = await this.fileRef(input).getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
+    try {} catch (err) {
       if (isNotFound(err)) return null;
       throw err;
killedBy: MaterialsStorageAdapter — real mode headObject returns the numeric size when metadata size is a string
statusReason: expected undefined to deeply equal { size: 4096 }

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:98:34
     contentType: string;
     materialId: string;
     ttlSec: number;
-  }): Promise<SignedDownloadUrl> {
-    const expiresMs = Date.now() + input.ttlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
-      return this.fakeSigned('downloadUrl', input.materialId, expiresMs);
-    }
-    const [url] = await this.fileRef(input).getSignedUrl({
-      version: 'v4',
-      action: 'read',
-      expires: expiresMs,
-      responseDisposition: `attachment; filename="${sanitizeFilename(input.filename)}"`,
-      responseType: input.contentType,
-    });
-    return { downloadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
-  }
+  }): Promise<SignedDownloadUrl> {}
 
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {
killedBy: MaterialsStorageAdapter — fake mode signDownloadUrl returns an internal passthrough URL with a future expiresAt
statusReason: Cannot read properties of undefined (reading 'downloadUrl')

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:135:51
     key: K,
     materialId: string,
     expiresMs: number,
-  ): { [P in K]: string } & { expiresAt: string } {
-    return {
-      [key]: `/api/internal/fake-materials/${materialId}`,
-      expiresAt: new Date(expiresMs).toISOString(),
-    } as { [P in K]: string } & { expiresAt: string };
-  }
+  ): { [P in K]: string } & { expiresAt: string } {}
 }
 
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: Cannot read properties of undefined (reading 'uploadUrl')
