[Killed] BlockStatement
src/lib/materials/materials.service.ts:108:56
     return { materialId, uploadUrl: signed.uploadUrl, expiresAt: signed.expiresAt };
   }
 
-  async complete(matId: MaterialId): Promise<Material> {
-    const m = await this.loadMaterialOrThrow(matId);
-    if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
-
-    const actualSize = await this.verifyUploadedObject(m);
-
-    const updatedAt = nowIso();
-    await this.repo.update(matId, { state: 'READY', sizeBytes: actualSize, updatedAt });
-    return { ...m, state: 'READY', sizeBytes: actualSize, updatedAt };
-  }
+  async complete(matId: MaterialId): Promise<Material> {}
 
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:110:9
 
   async complete(matId: MaterialId): Promise<Material> {
     const m = await this.loadMaterialOrThrow(matId);
-    if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
+    if (false) throw new InvalidMaterialStateException(m.state);
 
     const actualSize = await this.verifyUploadedObject(m);
killedBy: MaterialsService.complete throws INVALID_MATERIAL_STATE when not PENDING_UPLOAD
statusReason: promise resolved "{ id: 'm1', …(12) }" instead of rejecting

[Killed] EqualityOperator
src/lib/materials/materials.service.ts:110:9
 
   async complete(matId: MaterialId): Promise<Material> {
     const m = await this.loadMaterialOrThrow(matId);
-    if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
+    if (m.state === 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
 
     const actualSize = await this.verifyUploadedObject(m);
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Operation is not valid in state PENDING_UPLOAD.

[Killed] StringLiteral
src/lib/materials/materials.service.ts:116:27
 
     const updatedAt = nowIso();
     await this.repo.update(matId, { state: 'READY', sizeBytes: actualSize, updatedAt });
-    return { ...m, state: 'READY', sizeBytes: actualSize, updatedAt };
+    return { ...m, state: "", sizeBytes: actualSize, updatedAt };
   }
 
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: expected '' to be 'READY' // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:122:22
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
     const all = await this.repo.listByLesson(lessonId);
     return all
-      .filter((m) => m.state === 'READY')
+      .filter((m) => false)
       .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
   }
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: expected [] to deeply equal [ 'm1', 'm2' ]

[Killed] BlockStatement
src/lib/materials/materials.service.ts:126:75
       .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
   }
 
-  async rename(matId: MaterialId, displayName: string): Promise<Material> {
-    const m = await this.loadMaterialOrThrow(matId);
-    const updatedAt = nowIso();
-    await this.repo.update(matId, { displayName, updatedAt });
-    return { ...m, displayName, updatedAt };
-  }
+  async rename(matId: MaterialId, displayName: string): Promise<Material> {}
 
   async remove(matId: MaterialId): Promise<void> {
killedBy: MaterialsService.rename updates displayName and returns the material
statusReason: Cannot read properties of undefined (reading 'displayName')

[Killed] BlockStatement
src/lib/materials/materials.service.ts:133:50
     return { ...m, displayName, updatedAt };
   }
 
-  async remove(matId: MaterialId): Promise<void> {
-    const m = await this.loadMaterialOrThrow(matId);
-    await this.purgeStoredMaterial(m);
-  }
+  async remove(matId: MaterialId): Promise<void> {}
 
   async buildDownloadUrl(matId: MaterialId): Promise<DownloadUrlResult> {
killedBy: MaterialsService.remove deletes the storage object and the doc
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:138:73
     await this.purgeStoredMaterial(m);
   }
 
-  async buildDownloadUrl(matId: MaterialId): Promise<DownloadUrlResult> {
-    const m = await this.loadMaterialOrThrow(matId);
-    // PENDING_UPLOAD materials have no object behind the storage path (or only
-    // a partial one). Issuing a signed URL for that state lets a caller
-    // exfiltrate a capability against an incomplete object — an enrolled
-    // student who happens to know a not-yet-uploaded matId would get a working
-    // signature for an empty path. Block the URL until the object has been
-    // HEAD-verified by `complete`.
-    if (m.state !== 'READY') throw new InvalidMaterialStateException(m.state);
-    return this.storage.signDownloadUrl({
-      bucket: m.storage.bucket,
-      path: m.storage.path,
-      filename: m.originalFilename,
-      contentType: m.contentType,
-      materialId: m.id,
-      ttlSec: this.cfg.downloadUrlTtlSec,
-    });
-  }
+  async buildDownloadUrl(matId: MaterialId): Promise<DownloadUrlResult> {}
 
   /** Cascade entry point — called by CoursesService.deleteLesson before the
killedBy: MaterialsService.buildDownloadUrl returns a signed download URL for an existing material
statusReason: Cannot read properties of undefined (reading 'downloadUrl')

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:146:9
     // student who happens to know a not-yet-uploaded matId would get a working
     // signature for an empty path. Block the URL until the object has been
     // HEAD-verified by `complete`.
-    if (m.state !== 'READY') throw new InvalidMaterialStateException(m.state);
+    if (true) throw new InvalidMaterialStateException(m.state);
     return this.storage.signDownloadUrl({
       bucket: m.storage.bucket,
killedBy: MaterialsService.buildDownloadUrl returns a signed download URL for an existing material
statusReason: Operation is not valid in state READY.

[Killed] EqualityOperator
src/lib/materials/materials.service.ts:146:9
     // student who happens to know a not-yet-uploaded matId would get a working
     // signature for an empty path. Block the URL until the object has been
     // HEAD-verified by `complete`.
-    if (m.state !== 'READY') throw new InvalidMaterialStateException(m.state);
+    if (m.state === 'READY') throw new InvalidMaterialStateException(m.state);
     return this.storage.signDownloadUrl({
       bucket: m.storage.bucket,
killedBy: MaterialsService.buildDownloadUrl returns a signed download URL for an existing material
statusReason: Operation is not valid in state READY.

[Killed] ObjectLiteral
src/lib/materials/materials.service.ts:147:41
     // signature for an empty path. Block the URL until the object has been
     // HEAD-verified by `complete`.
     if (m.state !== 'READY') throw new InvalidMaterialStateException(m.state);
-    return this.storage.signDownloadUrl({
-      bucket: m.storage.bucket,
-      path: m.storage.path,
-      filename: m.originalFilename,
-      contentType: m.contentType,
-      materialId: m.id,
-      ttlSec: this.cfg.downloadUrlTtlSec,
-    });
+    return this.storage.signDownloadUrl({});
   }
 
killedBy: MaterialsService.buildDownloadUrl returns a signed download URL for an existing material
statusReason: expected 'down://undefined' to be 'down://m1' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:159:60
 
   /** Cascade entry point — called by CoursesService.deleteLesson before the
    *  lesson doc is removed. Best-effort object delete, then doc delete. */
-  async deleteForLesson(lessonId: LessonId): Promise<void> {
-    const materials = await this.repo.listByLesson(lessonId);
-    for (const m of materials) {
-      await this.purgeStoredMaterial(m);
-    }
-  }
+  async deleteForLesson(lessonId: LessonId): Promise<void> {}
 
   private async loadMaterialOrThrow(matId: MaterialId): Promise<Material> {
killedBy: MaterialsService.deleteForLesson removes every material attached to the lesson
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:161:32
    *  lesson doc is removed. Best-effort object delete, then doc delete. */
   async deleteForLesson(lessonId: LessonId): Promise<void> {
     const materials = await this.repo.listByLesson(lessonId);
-    for (const m of materials) {
-      await this.purgeStoredMaterial(m);
-    }
+    for (const m of materials) {}
   }
 
killedBy: MaterialsService.deleteForLesson removes every material attached to the lesson
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:166:75
     }
   }
 
-  private async loadMaterialOrThrow(matId: MaterialId): Promise<Material> {
-    const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
-    return m;
-  }
+  private async loadMaterialOrThrow(matId: MaterialId): Promise<Material> {}
 
   /**
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] BlockStatement
src/lib/materials/materials.service.ts:179:68
    * by uploading then skipping `complete`. Returns the actual size for the
    * caller to record on the Material doc.
    */
-  private async verifyUploadedObject(m: Material): Promise<number> {
-    const head = await this.storage.headObject({
-      bucket: m.storage.bucket,
-      path: m.storage.path,
-    });
-    if (!head) throw new UploadObjectMissingException();
-    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
-      await this.bestEffortDeleteStoredObject(m);
-      throw new UploadObjectSizeMismatchException();
-    }
-    return head.size;
-  }
+  private async verifyUploadedObject(m: Material): Promise<number> {}
 
   /** Delete the storage object, swallowing any error. Used both during upload
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: expected undefined to be 4096 // Object.is equality

[Survived] ObjectLiteral
src/lib/materials/materials.service.ts:180:48
    * caller to record on the Material doc.
    */
   private async verifyUploadedObject(m: Material): Promise<number> {
-    const head = await this.storage.headObject({
-      bucket: m.storage.bucket,
-      path: m.storage.path,
-    });
+    const head = await this.storage.headObject({});
     if (!head) throw new UploadObjectMissingException();
     if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {

[Killed] BooleanLiteral
src/lib/materials/materials.service.ts:184:9
       bucket: m.storage.bucket,
       path: m.storage.path,
     });
-    if (!head) throw new UploadObjectMissingException();
+    if (head) throw new UploadObjectMissingException();
     if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
       await this.bestEffortDeleteStoredObject(m);
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: No uploaded object exists at the upload destination.

[Killed] EqualityOperator
src/lib/materials/materials.service.ts:185:9
       path: m.storage.path,
     });
     if (!head) throw new UploadObjectMissingException();
-    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
+    if (head.size <= MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
       await this.bestEffortDeleteStoredObject(m);
       throw new UploadObjectSizeMismatchException();
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Uploaded object size exceeds the allowed limit.

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:185:9
       path: m.storage.path,
     });
     if (!head) throw new UploadObjectMissingException();
-    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
+    if (false) {
       await this.bestEffortDeleteStoredObject(m);
       throw new UploadObjectSizeMismatchException();
killedBy: MaterialsService.complete throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes the object when oversized
statusReason: promise resolved "{ id: 'm1', …(12) }" instead of rejecting

[Killed] BlockStatement
src/lib/materials/materials.service.ts:194:74
 
   /** Delete the storage object, swallowing any error. Used both during upload
    *  validation (oversize cleanup) and as the storage half of full purge. */
-  private async bestEffortDeleteStoredObject(m: Material): Promise<void> {
-    await this.storage
-      .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
-      .catch(() => undefined);
-  }
+  private async bestEffortDeleteStoredObject(m: Material): Promise<void> {}
 
   /** Remove a material end-to-end: storage object (best-effort), then Firestore doc. */
killedBy: MaterialsService.complete throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes the object when oversized
statusReason: expected [] to include 'materials/m1/source.pdf'

[Killed] BlockStatement
src/lib/materials/materials.service.ts:201:65
   }
 
   /** Remove a material end-to-end: storage object (best-effort), then Firestore doc. */
-  private async purgeStoredMaterial(m: Material): Promise<void> {
-    await this.bestEffortDeleteStoredObject(m);
-    await this.repo.delete(m.id);
-  }
+  private async purgeStoredMaterial(m: Material): Promise<void> {}
 }
 
killedBy: MaterialsService.remove deletes the storage object and the doc
statusReason: expected true to be false // Object.is equality
