[Killed] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:17:12
 function collectStream(req: Request): Promise<Buffer> {
   return new Promise((resolve, reject) => {
     const chunks: Buffer[] = [];
-    req.on('data', (c: Buffer) => chunks.push(c));
+    req.on("", (c: Buffer) => chunks.push(c));
     req.on('end', () => resolve(Buffer.concat(chunks)));
     req.on('error', reject);
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
lib/materials/webhook/fake-materials.controller.ts:58:18
     await this.storage
       .bucket(material.storage.bucket)
       .file(material.storage.path)
-      .save(buf, { contentType: material.contentType, resumable: false });
+      .save(buf, {});
     return { ok: true };
   }
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Buffer>, { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   Any<Buffer>,

[Killed] ObjectLiteral
lib/materials/webhook/fake-materials.controller.ts:59:12
       .bucket(material.storage.bucket)
       .file(material.storage.path)
       .save(buf, { contentType: material.contentType, resumable: false });
-    return { ok: true };
+    return {};
   }
 
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: expected {} to deeply equal { ok: true }

[Killed] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:75:7
       .download();
     res.set('Content-Type', material.contentType);
     res.set(
-      'Content-Disposition',
+      "",
       `attachment; filename="${sanitizeFilename(material.originalFilename)}"`,
     );
killedBy: FakeMaterialsController download streams the object back with attachment headers
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string
