[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:36:33
   // Detects a "video not found" error structurally (by name/message) so an
   // orphan lesson.videoId — one pointing at a deleted Video — folds into a
   // LESSON_HAS_NO_VIDEO reason instead of aborting eligibility computation.
-  return e instanceof Error && (e.name === 'VideoNotFoundException' || /not found/i.test(e.message));
+  return e instanceof Error && (false || /not found/i.test(e.message));
 }
 
killedBy: PublishService.computeEligibility folds an error by name even when its message has no "not found" text
statusReason: the requested resource is gone

[Killed] BlockStatement
src/lib/publish/publish.service.ts:58:72
     @Inject(FIRESTORE) private readonly firestore: FirestoreHandle,
   ) {}
 
-  async computeEligibility(cid: CourseId): Promise<PublishEligibility> {
-    const course = await this.repo.getCourse(cid);
-    if (!course) throw new CourseNotFoundException();
-    if (course.status === 'ARCHIVED') throw new CourseArchivedException();
-
-    return this.computeEligibilityFor(cid, {
-      listModules: (c) => this.repo.listModulesByCourse(c),
-      listLessons: (c, m) => this.repo.listLessonsByModule(c, m),
-    });
-  }
+  async computeEligibility(cid: CourseId): Promise<PublishEligibility> {}
 
   async publish(cid: CourseId): Promise<Course> {
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: expected undefined to deeply equal { eligible: false, …(1) }

[Killed] EqualityOperator
src/lib/publish/publish.service.ts:61:9
   async computeEligibility(cid: CourseId): Promise<PublishEligibility> {
     const course = await this.repo.getCourse(cid);
     if (!course) throw new CourseNotFoundException();
-    if (course.status === 'ARCHIVED') throw new CourseArchivedException();
+    if (course.status !== 'ARCHIVED') throw new CourseArchivedException();
 
     return this.computeEligibilityFor(cid, {
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: Cannot check publish eligibility on an archived course.

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:64:20
     if (course.status === 'ARCHIVED') throw new CourseArchivedException();
 
     return this.computeEligibilityFor(cid, {
-      listModules: (c) => this.repo.listModulesByCourse(c),
+      listModules: () => undefined,
       listLessons: (c, m) => this.repo.listLessonsByModule(c, m),
     });
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:65:20
 
     return this.computeEligibilityFor(cid, {
       listModules: (c) => this.repo.listModulesByCourse(c),
-      listLessons: (c, m) => this.repo.listLessonsByModule(c, m),
+      listLessons: () => undefined,
     });
   }
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: Cannot read properties of undefined (reading 'videoId')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:69:49
     });
   }
 
-  async publish(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['DRAFT'], 'PUBLISHED', async (t) => {
-      const eligibility = await this.computeEligibilityFor(cid, {
-        listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
-        listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
-      });
-      if (!eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
-      return { publishedAt: nowIso() };
-    });
-  }
+  async publish(cid: CourseId): Promise<Course> {}
 
   async unpublish(cid: CourseId): Promise<Course> {
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:70:79
   }
 
   async publish(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['DRAFT'], 'PUBLISHED', async (t) => {
-      const eligibility = await this.computeEligibilityFor(cid, {
-        listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
-        listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
-      });
-      if (!eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
-      return { publishedAt: nowIso() };
-    });
+    return this.runStatusTransition(cid, ['DRAFT'], 'PUBLISHED', async (t) => {});
   }
 
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/lib/publish/publish.service.ts:71:65
 
   async publish(cid: CourseId): Promise<Course> {
     return this.runStatusTransition(cid, ['DRAFT'], 'PUBLISHED', async (t) => {
-      const eligibility = await this.computeEligibilityFor(cid, {
-        listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
-        listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
-      });
+      const eligibility = await this.computeEligibilityFor(cid, {});
       if (!eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
       return { publishedAt: nowIso() };
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: reader.listModules is not a function

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:72:22
   async publish(cid: CourseId): Promise<Course> {
     return this.runStatusTransition(cid, ['DRAFT'], 'PUBLISHED', async (t) => {
       const eligibility = await this.computeEligibilityFor(cid, {
-        listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
+        listModules: () => undefined,
         listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
       });
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:73:22
     return this.runStatusTransition(cid, ['DRAFT'], 'PUBLISHED', async (t) => {
       const eligibility = await this.computeEligibilityFor(cid, {
         listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
-        listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
+        listLessons: () => undefined,
       });
       if (!eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'videoId')

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:75:11
         listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
         listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
       });
-      if (!eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
+      if (true) throw new PublishNotEligibleException(eligibility.reasons);
       return { publishedAt: nowIso() };
     });
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Course does not meet publish requirements.

[Killed] BooleanLiteral
src/lib/publish/publish.service.ts:75:11
         listModules: (c) => this.repo.listModulesByCourseInTxn(t, c),
         listLessons: (c, m) => this.repo.listLessonsByModuleInTxn(t, c, m),
       });
-      if (!eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
+      if (eligibility.eligible) throw new PublishNotEligibleException(eligibility.reasons);
       return { publishedAt: nowIso() };
     });
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Course does not meet publish requirements.

[Killed] BlockStatement
src/lib/publish/publish.service.ts:80:51
     });
   }
 
-  async unpublish(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['PUBLISHED'], 'DRAFT', async () => ({}));
-  }
+  async unpublish(cid: CourseId): Promise<Course> {}
 
   async archive(cid: CourseId): Promise<Course> {
killedBy: PublishService.unpublish transitions PUBLISHED → DRAFT, preserves publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:81:66
   }
 
   async unpublish(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['PUBLISHED'], 'DRAFT', async () => ({}));
+    return this.runStatusTransition(cid, ['PUBLISHED'], 'DRAFT', () => undefined);
   }
 
killedBy: PublishService.unpublish transitions PUBLISHED → DRAFT, preserves publishedAt
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'c1', 'DRAFT', {} ]

Received:

  1st vi.fn() call:

  [
-   Anything,

[Killed] BlockStatement
src/lib/publish/publish.service.ts:84:49
     return this.runStatusTransition(cid, ['PUBLISHED'], 'DRAFT', async () => ({}));
   }
 
-  async archive(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['DRAFT', 'PUBLISHED'], 'ARCHIVED', async () => ({
-      archivedAt: nowIso(),
-    }));
-  }
+  async archive(cid: CourseId): Promise<Course> {}
 
   async restore(cid: CourseId): Promise<Course> {
killedBy: PublishService.archive archives a DRAFT course, sets archivedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:85:78
   }
 
   async archive(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['DRAFT', 'PUBLISHED'], 'ARCHIVED', async () => ({
-      archivedAt: nowIso(),
-    }));
+    return this.runStatusTransition(cid, ['DRAFT', 'PUBLISHED'], 'ARCHIVED', () => undefined);
   }
 
killedBy: PublishService.archive archives a DRAFT course, sets archivedAt
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/publish/publish.service.ts:90:49
     }));
   }
 
-  async restore(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['ARCHIVED'], 'DRAFT', async () => ({ archivedAt: null }));
-  }
+  async restore(cid: CourseId): Promise<Course> {}
 
   /**
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:91:65
   }
 
   async restore(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['ARCHIVED'], 'DRAFT', async () => ({ archivedAt: null }));
+    return this.runStatusTransition(cid, ['ARCHIVED'], 'DRAFT', () => undefined);
   }
 
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, 'c1', 'DRAFT', { …(1) } ]

Received:

  1st vi.fn() call:

  [
-   Anything,

[Killed] StringLiteral
src/lib/publish/publish.service.ts:91:56
   }
 
   async restore(cid: CourseId): Promise<Course> {
-    return this.runStatusTransition(cid, ['ARCHIVED'], 'DRAFT', async () => ({ archivedAt: null }));
+    return this.runStatusTransition(cid, ['ARCHIVED'], "", async () => ({ archivedAt: null }));
   }
 
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: expected '' to be 'DRAFT' // Object.is equality

[Killed] BlockStatement
src/lib/publish/publish.service.ts:113:22
     derivePatch: (
       t: adminFirestore.Transaction,
     ) => Promise<{ publishedAt?: ISODateString; archivedAt?: ISODateString | null }>,
-  ): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (!from.includes(course.status)) {
-        throw new InvalidTransitionException(course.status, to);
-      }
-      const patch = await derivePatch(t);
-      return this.repo.updateStatusInTxn(t, cid, to, patch);
-    });
-  }
+  ): Promise<Course> {}
 
   /**
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:114:55
       t: adminFirestore.Transaction,
     ) => Promise<{ publishedAt?: ISODateString; archivedAt?: ISODateString | null }>,
   ): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (!from.includes(course.status)) {
-        throw new InvalidTransitionException(course.status, to);
-      }
-      const patch = await derivePatch(t);
-      return this.repo.updateStatusInTxn(t, cid, to, patch);
-    });
+    return this.firestore.runTransaction(async (t) => {});
   }
 
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:116:11
   ): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (!from.includes(course.status)) {
+      if (true) {
         throw new InvalidTransitionException(course.status, to);
       }
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot transition from DRAFT to PUBLISHED.

[Killed] BlockStatement
src/lib/publish/publish.service.ts:116:42
   ): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (!from.includes(course.status)) {
-        throw new InvalidTransitionException(course.status, to);
-      }
+      if (!from.includes(course.status)) {}
       const patch = await derivePatch(t);
       return this.repo.updateStatusInTxn(t, cid, to, patch);
killedBy: PublishService.publish throws InvalidTransitionException when source state is not DRAFT
statusReason: expected TypeError: this.repo.listModulesByCourseI… to match object { code: 'INVALID_TRANSITION', …(1) }

[Killed] BlockStatement
src/lib/publish/publish.service.ts:133:34
   private async computeEligibilityFor(
     cid: CourseId,
     reader: CourseShapeReader,
-  ): Promise<PublishEligibility> {
-    const modules = await reader.listModules(cid);
-    const lessonsByModule = await Promise.all(modules.map((m) => reader.listLessons(cid, m.id)));
-    const videoStateById = await this.loadVideoStateMap(lessonsByModule.flat());
-    return composeReasons(modules, lessonsByModule, videoStateById);
-  }
+  ): Promise<PublishEligibility> {}
 
   /**
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: expected undefined to deeply equal { eligible: false, …(1) }

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:135:59
     reader: CourseShapeReader,
   ): Promise<PublishEligibility> {
     const modules = await reader.listModules(cid);
-    const lessonsByModule = await Promise.all(modules.map((m) => reader.listLessons(cid, m.id)));
+    const lessonsByModule = await Promise.all(modules.map(() => undefined));
     const videoStateById = await this.loadVideoStateMap(lessonsByModule.flat());
     return composeReasons(modules, lessonsByModule, videoStateById);
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: Cannot read properties of undefined (reading 'videoId')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:145:89
    * (so an orphan lesson surfaces as LESSON_HAS_NO_VIDEO in composeReasons
    * rather than aborting eligibility), and return state-by-id.
    */
-  private async loadVideoStateMap(lessons: Lesson[]): Promise<Map<VideoId, VideoState>> {
-    const uniqueVideoIds = [
-      ...new Set(lessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
-    ];
-    const videos = await Promise.all(
-      uniqueVideoIds.map((vid) =>
-        this.videoSvc.getVideo(vid).catch((e) => {
-          if (isVideoNotFound(e)) return null;
-          throw e;
-        }),
-      ),
-    );
-    return new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
-    );
-  }
+  private async loadVideoStateMap(lessons: Lesson[]): Promise<Map<VideoId, VideoState>> {}
 }
 
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:147:55
    */
   private async loadVideoStateMap(lessons: Lesson[]): Promise<Map<VideoId, VideoState>> {
     const uniqueVideoIds = [
-      ...new Set(lessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
+      ...new Set(lessons.map((l) => l.videoId).filter(() => undefined)),
     ];
     const videos = await Promise.all(
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: true, reasons: [] }

[Killed] MethodExpression
src/lib/publish/publish.service.ts:147:18
    */
   private async loadVideoStateMap(lessons: Lesson[]): Promise<Map<VideoId, VideoState>> {
     const uniqueVideoIds = [
-      ...new Set(lessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
+      ...new Set(lessons.map(l => l.videoId)),
     ];
     const videos = await Promise.all(
killedBy: PublishService.computeEligibility does not read a video for a lesson with no videoId
statusReason: expected "vi.fn()" to not be called with arguments: [ undefined ]

Received:

  1st vi.fn() call:

  [
-   undefined,

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:158:40
       ),
     );
     return new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
+      videos.filter((v): v is Video => false).map((v) => [v.id, v.state]),
     );
   }
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: true, reasons: [] }

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:158:56
       ),
     );
     return new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
+      videos.filter((v): v is Video => v !== null).map(() => undefined),
     );
   }
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: Iterator value undefined is not an entry object
