[Killed] BlockStatement
api-courses/src/lib/reorder.util.ts:20:9
 export function assertReorderSetMatches(
   currentIds: string[],
   proposedIds: string[],
-): void {
-  if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
-  const proposed = new Set(proposedIds);
-  if (proposed.size !== proposedIds.length) throw new StaleReorderException();
-  const current = new Set(currentIds);
-  for (const id of proposed) {
-    if (!current.has(id)) throw new StaleReorderException();
-  }
-}
+): void {}
 
killedBy: CoursesRepository — Module writeModuleOrder rejects payloads containing duplicate IDs
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/reorder.util.ts:21:7
   currentIds: string[],
   proposedIds: string[],
 ): void {
-  if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
+  if (true) throw new StaleReorderException();
   const proposed = new Set(proposedIds);
   if (proposed.size !== proposedIds.length) throw new StaleReorderException();
killedBy: CoursesRepository — Module writeModuleOrder rewrites each module order to its array index
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] ConditionalExpression
api-courses/src/lib/reorder.util.ts:21:7
   currentIds: string[],
   proposedIds: string[],
 ): void {
-  if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
+  if (false) throw new StaleReorderException();
   const proposed = new Set(proposedIds);
   if (proposed.size !== proposedIds.length) throw new StaleReorderException();
killedBy: CoursesService — module operations reorderModules throws StaleReorderException when proposed list is shorter than current
statusReason: promise resolved "[ { id: 'a', …(5) }, { id: 'b', …(5) } ]" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/reorder.util.ts:23:7
 ): void {
   if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
   const proposed = new Set(proposedIds);
-  if (proposed.size !== proposedIds.length) throw new StaleReorderException();
+  if (false) throw new StaleReorderException();
   const current = new Set(currentIds);
   for (const id of proposed) {
killedBy: CoursesRepository — Module writeModuleOrder rejects payloads containing duplicate IDs
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/reorder.util.ts:23:7
 ): void {
   if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
   const proposed = new Set(proposedIds);
-  if (proposed.size !== proposedIds.length) throw new StaleReorderException();
+  if (true) throw new StaleReorderException();
   const current = new Set(currentIds);
   for (const id of proposed) {
killedBy: CoursesRepository — Module writeModuleOrder rewrites each module order to its array index
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] BlockStatement
api-courses/src/lib/reorder.util.ts:25:30
   const proposed = new Set(proposedIds);
   if (proposed.size !== proposedIds.length) throw new StaleReorderException();
   const current = new Set(currentIds);
-  for (const id of proposed) {
-    if (!current.has(id)) throw new StaleReorderException();
-  }
+  for (const id of proposed) {}
 }
 
killedBy: CoursesService — module operations reorderModules throws StaleReorderException when proposed list contains an id not in current (same length)
statusReason: promise resolved "[ { id: 'a', …(5) }, …(2) ]" instead of rejecting
