[Killed] BlockStatement
lib/video/playback/enrollment-or-owner.guard.ts:21:62
     private readonly enrollment: EnrollmentRepository,
   ) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-    const vid = req.params?.['vid'] as VideoId | undefined;
-    if (!vid) throw new VideoNotFoundException();
-
-    const video = await this.repo.getVideo(vid);
-    if (!video) throw new VideoNotFoundException();
-    if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
-
-    if (video.ownerInstructorId === req.user?.uid) {
-      req.video = video;
-      return true;
-    }
-
-    if (req.user && (await this.enrollment.isEnrolled(req.user.uid, video.courseId))) {
-      req.video = video;
-      return true;
-    }
-
-    throw new NotVideoOwnerException();
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: EnrollmentOrOwnerGuard throws VIDEO_NOT_FOUND when :vid is missing from params
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
lib/video/playback/enrollment-or-owner.guard.ts:30:52
     if (!video) throw new VideoNotFoundException();
     if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
 
-    if (video.ownerInstructorId === req.user?.uid) {
-      req.video = video;
-      return true;
-    }
+    if (video.ownerInstructorId === req.user?.uid) {}
 
     if (req.user && (await this.enrollment.isEnrolled(req.user.uid, video.courseId))) {
killedBy: EnrollmentOrOwnerGuard attaches video and returns true when the requester is the owner
statusReason: promise rejected "VideoException: You do not own this video. { …(3) }" instead of resolving

[Killed] LogicalOperator
lib/video/playback/enrollment-or-owner.guard.ts:35:9
       return true;
     }
 
-    if (req.user && (await this.enrollment.isEnrolled(req.user.uid, video.courseId))) {
+    if (req.user || (await this.enrollment.isEnrolled(req.user.uid, video.courseId))) {
       req.video = video;
       return true;
killedBy: EnrollmentOrOwnerGuard attaches video and returns true for an ACTIVE-enrolled non-owner
statusReason: expected "vi.fn()" to be called with arguments: [ 'u2', 'c1' ]

Number of calls: 0

[Killed] ConditionalExpression
lib/video/playback/enrollment-or-owner.guard.ts:35:9
       return true;
     }
 
-    if (req.user && (await this.enrollment.isEnrolled(req.user.uid, video.courseId))) {
+    if (false) {
       req.video = video;
       return true;
killedBy: EnrollmentOrOwnerGuard attaches video and returns true for an ACTIVE-enrolled non-owner
statusReason: promise rejected "VideoException: You do not own this video. { …(3) }" instead of resolving
