[Killed] BlockStatement
src/lib/video/video.repository.ts:21:34
 
   // ────────────────────────── Ref helpers ──────────────────────────
 
-  private videoRef(vid: VideoId) {
-    return this.db.collection('videos').doc(vid);
-  }
+  private videoRef(vid: VideoId) {}
 
   private videoKeyRef(kid: VideoKeyId) {
killedBy: VideoRepository — simple reads and writes getVideo returns the stored video, or null when absent
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/lib/video/video.repository.ts:25:40
     return this.db.collection('videos').doc(vid);
   }
 
-  private videoKeyRef(kid: VideoKeyId) {
-    return this.db.collection('videoKeys').doc(kid);
-  }
+  private videoKeyRef(kid: VideoKeyId) {}
 
   /**
killedBy: VideoRepository — simple reads and writes getVideoKey returns the stored key, or null when absent
statusReason: Cannot read properties of undefined (reading 'get')

[Killed] BlockStatement
src/lib/video/video.repository.ts:35:42
    * creation time in CoursesRepository.appendLesson. This collectionGroup query
    * therefore always resolves to exactly one document when the lesson exists.
    */
-  private lessonByIdQuery(lid: LessonId) {
-    return this.db.collectionGroup('lessons').where('id', '==', lid).limit(1);
-  }
+  private lessonByIdQuery(lid: LessonId) {}
 
   newId<T extends string>(): T {
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: Cannot read properties of undefined (reading 'get')

[Survived] StringLiteral
src/lib/video/video.repository.ts:36:59
    * therefore always resolves to exactly one document when the lesson exists.
    */
   private lessonByIdQuery(lid: LessonId) {
-    return this.db.collectionGroup('lessons').where('id', '==', lid).limit(1);
+    return this.db.collectionGroup('lessons').where('id', "", lid).limit(1);
   }
 

[Killed] BlockStatement
src/lib/video/video.repository.ts:43:55
     return this.db.collection('_ids').doc().id as T;
   }
 
-  async getVideo(vid: VideoId): Promise<Video | null> {
-    const snap = await this.videoRef(vid).get();
-    return snap.exists ? (snap.data() as Video) : null;
-  }
+  async getVideo(vid: VideoId): Promise<Video | null> {}
 
   async getVideoByLesson(lid: LessonId): Promise<Video | null> {
killedBy: VideoRepository — simple reads and writes getVideo returns the stored video, or null when absent
statusReason: expected undefined to deeply equal { id: 'v1', …(7) }

[Killed] BlockStatement
src/lib/video/video.repository.ts:57:64
     return q.empty ? null : (q.docs[0]!.data() as Video);
   }
 
-  async getVideoKey(kid: VideoKeyId): Promise<VideoKey | null> {
-    const snap = await this.videoKeyRef(kid).get();
-    return snap.exists ? (snap.data() as VideoKey) : null;
-  }
+  async getVideoKey(kid: VideoKeyId): Promise<VideoKey | null> {}
 
   async createVideo(video: Video): Promise<void> {
killedBy: VideoRepository — simple reads and writes getVideoKey returns the stored key, or null when absent
statusReason: expected undefined to deeply equal { id: 'k1', videoId: 'v1', …(2) }

[Killed] BlockStatement
src/lib/video/video.repository.ts:62:50
     return snap.exists ? (snap.data() as VideoKey) : null;
   }
 
-  async createVideo(video: Video): Promise<void> {
-    await this.videoRef(video.id).set(video);
-  }
+  async createVideo(video: Video): Promise<void> {}
 
   async updateVideo(vid: VideoId, patch: Partial<Video>): Promise<void> {
killedBy: VideoRepository — simple reads and writes createVideo writes the video at videos/{id}
statusReason: expected undefined to deeply equal { id: 'v1', …(7) }

[Killed] BlockStatement
src/lib/video/video.repository.ts:66:73
     await this.videoRef(video.id).set(video);
   }
 
-  async updateVideo(vid: VideoId, patch: Partial<Video>): Promise<void> {
-    await this.videoRef(vid).update(patch);
-  }
+  async updateVideo(vid: VideoId, patch: Partial<Video>): Promise<void> {}
 
   async finalizeUploadWithJob(args: {
killedBy: VideoRepository — simple reads and writes updateVideo merges the patch into the existing document
statusReason: expected 'PENDING_UPLOAD' to be 'UPLOADED' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:88:30
       if (lessonSnap.empty) throw new Error('Lesson disappeared in transaction.');
       const lessonDocRef = lessonSnap.docs[0]!.ref;
 
-      const updated: Video = {
-        ...current,
-        state: 'TRANSCODING',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
-        keyId: args.key.id,
-        transcoderJobName: args.transcoderJobName,
-        updatedAt: args.nowIso as Video['updatedAt'],
-      };
+      const updated: Video = {};
       const keyDoc: VideoKey = {
         id: args.key.id,
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: expected undefined to be 'TRANSCODING' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:105:31
 
       tx.set(videoRef, updated);
       tx.set(keyRef, keyDoc);
-      tx.update(lessonDocRef, { videoId: args.vid, updatedAt: args.nowIso });
+      tx.update(lessonDocRef, {});
       return updated;
     });
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: expected undefined to be 'v1' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.repository.ts:115:22
     failureReason: string;
     actualSizeBytes: number;
     nowIso: string;
-  }): Promise<Video> {
-    const videoRef = this.videoRef(args.vid);
-    return this.db.runTransaction(async (tx) => {
-      const current = await this.requireVideoInTxn(tx, videoRef);
-      const updated: Video = {
-        ...current,
-        state: 'FAILED',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
-        failureReason: args.failureReason,
-        updatedAt: args.nowIso as Video['updatedAt'],
-      };
-      tx.set(videoRef, updated);
-      return updated;
-    });
-  }
+  }): Promise<Video> {}
 
   async applyTranscoderResult(args: {
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] BlockStatement
src/lib/video/video.repository.ts:117:49
     nowIso: string;
   }): Promise<Video> {
     const videoRef = this.videoRef(args.vid);
-    return this.db.runTransaction(async (tx) => {
-      const current = await this.requireVideoInTxn(tx, videoRef);
-      const updated: Video = {
-        ...current,
-        state: 'FAILED',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
-        failureReason: args.failureReason,
-        updatedAt: args.nowIso as Video['updatedAt'],
-      };
-      tx.set(videoRef, updated);
-      return updated;
-    });
+    return this.db.runTransaction(async (tx) => {});
   }
 
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:119:30
     const videoRef = this.videoRef(args.vid);
     return this.db.runTransaction(async (tx) => {
       const current = await this.requireVideoInTxn(tx, videoRef);
-      const updated: Video = {
-        ...current,
-        state: 'FAILED',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
-        failureReason: args.failureReason,
-        updatedAt: args.nowIso as Video['updatedAt'],
-      };
+      const updated: Video = {};
       tx.set(videoRef, updated);
       return updated;
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: expected undefined to be 'FAILED' // Object.is equality

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:142:11
     const videoRef = this.videoRef(args.videoId);
     return this.db.runTransaction(async (tx) => {
       const snap = await tx.get(videoRef);
-      if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
+      if (snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
       if (current.transcoderJobName !== args.jobName) {
killedBy: VideoRepository.applyTranscoderResult reports VIDEO_NOT_FOUND when the video is absent
statusReason: Cannot read properties of undefined (reading 'transcoderJobName')

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:144:11
       const snap = await tx.get(videoRef);
       if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
-      if (current.transcoderJobName !== args.jobName) {
+      if (true) {
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected { acted: false, …(1) } to deeply equal { acted: false, …(1) }

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:149:16
       }
       const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
       if (current.state === targetState) {
-        return { acted: false, reason: 'ALREADY_APPLIED' as const };
+        return {};
       }
       if (current.state !== 'TRANSCODING') {
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected {} to deeply equal { acted: false, …(1) }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:151:11
       if (current.state === targetState) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
-      if (current.state !== 'TRANSCODING') {
+      if (true) {
         return { acted: false, reason: 'WRONG_STATE' as const };
       }
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected { acted: false, reason: 'WRONG_STATE' } to deeply equal { acted: true }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:156:9
       }
 
       const updated: Video =
-        args.outcome.kind === 'READY'
+        true
           ? {
               ...current,
killedBy: VideoRepository.applyTranscoderResult applies a FAILED outcome: state FAILED with a prefixed failure reason
statusReason: expected 'READY' to be 'FAILED' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:157:13
 
       const updated: Video =
         args.outcome.kind === 'READY'
-          ? {
-              ...current,
-              state: 'READY',
-              output: {
-                bucket: args.outcome.outputBucket,
-                manifestPath: args.outcome.manifestPath,
-                durationSec: args.outcome.durationSec,
-              },
-              updatedAt: args.nowIso as Video['updatedAt'],
-            }
+          ? {}
           : {
               ...current,
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected undefined to be 'READY' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:167:13
               },
               updatedAt: args.nowIso as Video['updatedAt'],
             }
-          : {
-              ...current,
-              state: 'FAILED',
-              failureReason: `TRANSCODE_FAILED: ${args.outcome.reason}`,
-              updatedAt: args.nowIso as Video['updatedAt'],
-            };
+          : {};
       tx.set(videoRef, updated);
       return { acted: true };
killedBy: VideoRepository.applyTranscoderResult applies a FAILED outcome: state FAILED with a prefixed failure reason
statusReason: expected undefined to be 'FAILED' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:174:14
               updatedAt: args.nowIso as Video['updatedAt'],
             };
       tx.set(videoRef, updated);
-      return { acted: true };
+      return {};
     });
   }
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected {} to deeply equal { acted: true }

[Killed] BlockStatement
src/lib/video/video.repository.ts:183:90
    * and null out Lesson.videoId if it currently points at vid.
    * Uses a transaction so the lesson ownership check and the update are atomic.
    */
-  async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {
-    const videoRef = this.videoRef(vid);
-    const keyQ = this.db.collection('videoKeys').where('videoId', '==', vid).limit(1);
-    const lessonQ = this.lessonByIdQuery(lid);
-
-    await this.db.runTransaction(async (tx) => {
-      const lessonSnap = await tx.get(lessonQ);
-      const keySnap = await tx.get(keyQ);
-
-      tx.delete(videoRef);
-      if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
-      if (!lessonSnap.empty) {
-        const lesson = lessonSnap.docs[0]!;
-        const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
-          // Use FieldValue.delete() to remove the optional field rather than writing null,
-          // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
-          tx.update(lesson.ref, { videoId: FieldValue.delete(), updatedAt: nowIso });
-        }
-      }
-    });
-  }
+  async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {}
 
   /**
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/lib/video/video.repository.ts:185:37
    */
   async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {
     const videoRef = this.videoRef(vid);
-    const keyQ = this.db.collection('videoKeys').where('videoId', '==', vid).limit(1);
+    const keyQ = this.db.collection("").where('videoId', '==', vid).limit(1);
     const lessonQ = this.lessonByIdQuery(lid);
 
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/lib/video/video.repository.ts:185:67
    */
   async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {
     const videoRef = this.videoRef(vid);
-    const keyQ = this.db.collection('videoKeys').where('videoId', '==', vid).limit(1);
+    const keyQ = this.db.collection('videoKeys').where('videoId', "", vid).limit(1);
     const lessonQ = this.lessonByIdQuery(lid);
 

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:194:11
 
       tx.delete(videoRef);
       if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
-      if (!lessonSnap.empty) {
+      if (true) {
         const lesson = lessonSnap.docs[0]!;
         const currentVid = (lesson.data() as { videoId?: string }).videoId;
killedBy: VideoRepository.deleteVideoAndDetach succeeds when no key and no lesson exist
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] BlockStatement
src/lib/video/video.repository.ts:197:33
       if (!lessonSnap.empty) {
         const lesson = lessonSnap.docs[0]!;
         const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
-          // Use FieldValue.delete() to remove the optional field rather than writing null,
-          // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
-          tx.update(lesson.ref, { videoId: FieldValue.delete(), updatedAt: nowIso });
-        }
+        if (currentVid === vid) {}
       }
     });
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/video/video.repository.ts:214:21
   private async requireVideoInTxn(
     tx: adminFirestore.Transaction,
     ref: adminFirestore.DocumentReference,
-  ): Promise<Video> {
-    const snap = await tx.get(ref);
-    if (!snap.exists) throw new Error('Video disappeared in transaction.');
-    return snap.data() as Video;
-  }
+  ): Promise<Video> {}
 }
 
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: Cannot read properties of undefined (reading 'source')

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:216:9
     ref: adminFirestore.DocumentReference,
   ): Promise<Video> {
     const snap = await tx.get(ref);
-    if (!snap.exists) throw new Error('Video disappeared in transaction.');
+    if (snap.exists) throw new Error('Video disappeared in transaction.');
     return snap.data() as Video;
   }
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: Video disappeared in transaction.

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:216:9
     ref: adminFirestore.DocumentReference,
   ): Promise<Video> {
     const snap = await tx.get(ref);
-    if (!snap.exists) throw new Error('Video disappeared in transaction.');
+    if (false) throw new Error('Video disappeared in transaction.');
     return snap.data() as Video;
   }
killedBy: VideoRepository.finalizeUploadWithJob throws when the video disappeared before the transaction ran
statusReason: expected [Function] to throw error including 'Video disappeared in transaction.' but got 'Cannot read properties of undefined (…'
