[Killed] ObjectLiteral
lib/video/transcoder/fake-transcoder.adapter.ts:53:14
     const jobName = job.name ?? '';
 
     if (job.state === 'SUCCEEDED') {
-      return {
-        type: 'JOB_SUCCEEDED',
-        jobName,
-        videoId: videoId as VideoId,
-        manifestPath: `videos/${videoId}/hls/manifest.m3u8`,
-        durationSec: 60, // synthetic; tests assert > 0
-      };
+      return {};
     }
     if (job.state === 'FAILED') {
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: expected SUCCEEDED

[Killed] BlockStatement
lib/video/transcoder/fake-transcoder.adapter.ts:61:33
         durationSec: 60, // synthetic; tests assert > 0
       };
     }
-    if (job.state === 'FAILED') {
-      const raw = job.error?.message ?? 'unknown';
-      return {
-        type: 'JOB_FAILED',
-        jobName,
-        videoId: videoId as VideoId,
-        reason: raw.slice(0, 500),
-      };
-    }
+    if (job.state === 'FAILED') {}
     throw new Error(`Unexpected job.state: ${String(job.state)}`);
   }
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_FAILED payload
statusReason: Unexpected job.state: FAILED

[Killed] ObjectLiteral
lib/video/transcoder/fake-transcoder.adapter.ts:63:14
     }
     if (job.state === 'FAILED') {
       const raw = job.error?.message ?? 'unknown';
-      return {
-        type: 'JOB_FAILED',
-        jobName,
-        videoId: videoId as VideoId,
-        reason: raw.slice(0, 500),
-      };
+      return {};
     }
     throw new Error(`Unexpected job.state: ${String(job.state)}`);
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_FAILED payload
statusReason: expected FAILED

[Killed] BooleanLiteral
lib/video/transcoder/fake-transcoder.adapter.ts:75:30
 
   async cancelJob(jobName: string): Promise<void> {
     const rec = this.jobs.get(jobName);
-    if (rec) rec.cancelled = true;
+    if (rec) rec.cancelled = false;
   }
 
killedBy: FakeTranscoderAdapter.cancelJob marks known jobs cancelled
statusReason: expected false to be true // Object.is equality
