[Killed] ObjectLiteral
lib/video/transcoder/gcp-transcoder.adapter.ts:54:67
       })),
     };
     const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
-    const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
+    const [job] = await this.opts.client.createJob({ parent, job: {} });
     return { jobName: job.name ?? '' };
   }
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: Cannot read properties of undefined (reading 'elementaryStreams')

[Survived] ObjectLiteral
lib/video/transcoder/gcp-transcoder.adapter.ts:70:52
     const jobName = job.name ?? '';
 
     if (job.state === 'SUCCEEDED') {
-      const [full] = await this.opts.client.getJob({ name: jobName });
+      const [full] = await this.opts.client.getJob({});
       const durationSec = Number(full.outputDurationSec ?? 0);
       return {

[Killed] ObjectLiteral
lib/video/transcoder/gcp-transcoder.adapter.ts:72:14
     if (job.state === 'SUCCEEDED') {
       const [full] = await this.opts.client.getJob({ name: jobName });
       const durationSec = Number(full.outputDurationSec ?? 0);
-      return {
-        type: 'JOB_SUCCEEDED',
-        jobName,
-        videoId: videoId as VideoId,
-        manifestPath: `videos/${videoId}/hls/manifest.m3u8`,
-        durationSec,
-      };
+      return {};
     }
     if (job.state === 'FAILED') {
killedBy: GcpTranscoderAdapter.parseEvent — JOB_SUCCEEDED calls getJob to obtain output duration and returns a JOB_SUCCEEDED event
statusReason: expected SUCCEEDED

[Killed] StringLiteral
lib/video/transcoder/gcp-transcoder.adapter.ts:76:23
         type: 'JOB_SUCCEEDED',
         jobName,
         videoId: videoId as VideoId,
-        manifestPath: `videos/${videoId}/hls/manifest.m3u8`,
+        manifestPath: ``,
         durationSec,
       };
killedBy: GcpTranscoderAdapter.parseEvent — JOB_SUCCEEDED calls getJob to obtain output duration and returns a JOB_SUCCEEDED event
statusReason: expected '' to be 'videos/v1/hls/manifest.m3u8' // Object.is equality

[Survived] OptionalChaining
lib/video/transcoder/gcp-transcoder.adapter.ts:85:18
         type: 'JOB_FAILED',
         jobName,
         videoId: videoId as VideoId,
-        reason: (job.error?.message ?? 'unknown').slice(0, 500),
+        reason: (job.error.message ?? 'unknown').slice(0, 500),
       };
     }
