[Survived] BlockStatement
src/lib/video/video-storage.adapter.ts:13:5
 const promisifiedExecFile = promisify(nodeExecFile);
 
 let ffprobeBinaryPath: string;
-try {
-  // eslint-disable-next-line @typescript-eslint/no-require-imports
-  ffprobeBinaryPath = require('@ffprobe-installer/ffprobe').path;
-} catch {
+try {} catch {
   ffprobeBinaryPath = 'ffprobe';
 }

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:16:9
 try {
   // eslint-disable-next-line @typescript-eslint/no-require-imports
   ffprobeBinaryPath = require('@ffprobe-installer/ffprobe').path;
-} catch {
-  ffprobeBinaryPath = 'ffprobe';
-}
+} catch {}
 
 export interface ResumableSession {

[Survived] ArrowFunction
src/lib/video/video-storage.adapter.ts:53:35
 
 @Injectable()
 export class VideoStorageAdapter implements VideoStoragePort {
-  private runner: FfprobeRunner = (binary, args) => promisifiedExecFile(binary, args);
+  private runner: FfprobeRunner = () => undefined;
 
   constructor(

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:61:44
   ) {}
 
   /** Test hook — never called in production code paths. */
-  __setRunner(runner: FfprobeRunner): void {
-    this.runner = runner;
-  }
+  __setRunner(runner: FfprobeRunner): void {}
 
   async createResumableSession(input: {
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: spawn /Volumes/Artie-Storage/github-repos/learnwren/.claude/worktrees/ep-04-lesson-materials/node_modules/@ffprobe-installer/darwin-arm64/ffprobe EACCES

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:70:33
     path: string;
     contentType: string;
     videoId: string;
-  }): Promise<ResumableSession> {
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    const [uri] = await file.createResumableUpload({
-      metadata: {
-        contentType: input.contentType,
-        metadata: { videoId: input.videoId },
-      },
-      origin: '*',
-    });
-    return {
-      uri,
-      expiresAt: new Date(Date.now() + 7 * 24 * 3600 * 1000).toISOString(),
-    };
-  }
+  }): Promise<ResumableSession> {}
 
   async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {

[NoCoverage] ObjectLiteral
src/lib/video/video-storage.adapter.ts:79:12
       },
       origin: '*',
     });
-    return {
-      uri,
-      expiresAt: new Date(Date.now() + 7 * 24 * 3600 * 1000).toISOString(),
-    };
+    return {};
   }
 

[NoCoverage] ArithmeticOperator
src/lib/video/video-storage.adapter.ts:81:27
     });
     return {
       uri,
-      expiresAt: new Date(Date.now() + 7 * 24 * 3600 * 1000).toISOString(),
+      expiresAt: new Date(Date.now() - 7 * 24 * 3600 * 1000).toISOString(),
     };
   }

[NoCoverage] ArithmeticOperator
src/lib/video/video-storage.adapter.ts:81:40
     });
     return {
       uri,
-      expiresAt: new Date(Date.now() + 7 * 24 * 3600 * 1000).toISOString(),
+      expiresAt: new Date(Date.now() + 7 / 24 * 3600 * 1000).toISOString(),
     };
   }

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:85:93
     };
   }
 
-  async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    try {
-      const [meta] = await file.getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
-      const code = (err as { code?: number }).code;
-      if (code === 404) return null;
-      throw err;
-    }
-  }
+  async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {}
 
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:87:9
 
   async headObject(input: { bucket: string; path: string }): Promise<ObjectMetadata | null> {
     const file = this.storage.bucket(input.bucket).file(input.path);
-    try {
-      const [meta] = await file.getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
+    try {} catch (err) {
       const code = (err as { code?: number }).code;
       if (code === 404) return null;

[NoCoverage] ConditionalExpression
src/lib/video/video-storage.adapter.ts:89:20
     const file = this.storage.bucket(input.bucket).file(input.path);
     try {
       const [meta] = await file.getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
+      const size = false ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {

[NoCoverage] EqualityOperator
src/lib/video/video-storage.adapter.ts:89:20
     const file = this.storage.bucket(input.bucket).file(input.path);
     try {
       const [meta] = await file.getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
+      const size = typeof meta.size !== 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:91:19
       const [meta] = await file.getMetadata();
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
-    } catch (err) {
-      const code = (err as { code?: number }).code;
-      if (code === 404) return null;
-      throw err;
-    }
+    } catch (err) {}
   }
 

[NoCoverage] EqualityOperator
src/lib/video/video-storage.adapter.ts:93:11
       return { size };
     } catch (err) {
       const code = (err as { code?: number }).code;
-      if (code === 404) return null;
+      if (code !== 404) return null;
       throw err;
     }

[NoCoverage] ConditionalExpression
src/lib/video/video-storage.adapter.ts:93:11
       return { size };
     } catch (err) {
       const code = (err as { code?: number }).code;
-      if (code === 404) return null;
+      if (true) return null;
       throw err;
     }

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:98:78
     }
   }
 
-  async deleteObject(input: { bucket: string; path: string }): Promise<void> {
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    try {
-      await file.delete();
-    } catch (err) {
-      const code = (err as { code?: number }).code;
-      if (code === 404) return;
-      throw err;
-    }
-  }
+  async deleteObject(input: { bucket: string; path: string }): Promise<void> {}
 
   async deletePrefix(input: { bucket: string; prefix: string }): Promise<void> {

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:100:9
 
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {
     const file = this.storage.bucket(input.bucket).file(input.path);
-    try {
-      await file.delete();
-    } catch (err) {
+    try {} catch (err) {
       const code = (err as { code?: number }).code;
       if (code === 404) return;

[NoCoverage] BlockStatement
src/lib/video/video-storage.adapter.ts:102:19
     const file = this.storage.bucket(input.bucket).file(input.path);
     try {
       await file.delete();
-    } catch (err) {
-      const code = (err as { code?: number }).code;
-      if (code === 404) return;
-      throw err;
-    }
+    } catch (err) {}
   }
 

[NoCoverage] EqualityOperator
src/lib/video/video-storage.adapter.ts:104:11
       await file.delete();
     } catch (err) {
       const code = (err as { code?: number }).code;
-      if (code === 404) return;
+      if (code !== 404) return;
       throw err;
     }

[NoCoverage] ConditionalExpression
src/lib/video/video-storage.adapter.ts:104:11
       await file.delete();
     } catch (err) {
       const code = (err as { code?: number }).code;
-      if (code === 404) return;
+      if (true) return;
       throw err;
     }

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:109:80
     }
   }
 
-  async deletePrefix(input: { bucket: string; prefix: string }): Promise<void> {
-    try {
-      await this.storage.bucket(input.bucket).deleteFiles({ prefix: input.prefix });
-    } catch {
-      // best-effort; caller logs
-    }
-  }
+  async deletePrefix(input: { bucket: string; prefix: string }): Promise<void> {}
 
   async probeSource(input: { bucket: string; path: string }): Promise<SourceProbe> {
killedBy: VideoStorageAdapter.deletePrefix calls bucket.deleteFiles with the prefix
statusReason: expected "vi.fn()" to be called with arguments: [ { prefix: 'videos/v1/' } ]

Number of calls: 0

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:110:9
   }
 
   async deletePrefix(input: { bucket: string; prefix: string }): Promise<void> {
-    try {
-      await this.storage.bucket(input.bucket).deleteFiles({ prefix: input.prefix });
-    } catch {
+    try {} catch {
       // best-effort; caller logs
     }
killedBy: VideoStorageAdapter.deletePrefix calls bucket.deleteFiles with the prefix
statusReason: expected "vi.fn()" to be called with arguments: [ { prefix: 'videos/v1/' } ]

Number of calls: 0

[Survived] ArithmeticOperator
src/lib/video/video-storage.adapter.ts:121:16
     const file = this.storage.bucket(input.bucket).file(input.path);
     const [signedUrl] = await file.getSignedUrl({
       action: 'read',
-      expires: Date.now() + 60_000,
+      expires: Date.now() - 60_000,
       version: 'v4',
     });

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:125:13
       version: 'v4',
     });
     const { stdout } = await this.runner(ffprobeBinaryPath, [
-      '-v', 'error',
+      '-v', "",
       '-print_format', 'json',
       '-show_streams',

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:126:7
     });
     const { stdout } = await this.runner(ffprobeBinaryPath, [
       '-v', 'error',
-      '-print_format', 'json',
+      "", 'json',
       '-show_streams',
       '-show_format',

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:128:7
       '-v', 'error',
       '-print_format', 'json',
       '-show_streams',
-      '-show_format',
+      "",
       signedUrl,
     ]);

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:135:53
       streams?: { codec_type?: string; height?: number }[];
       format?: { duration?: string };
     };
-    const videoStream = parsed.streams?.find((s) => s.codec_type === 'video');
+    const videoStream = parsed.streams?.find((s) => false);
     if (!videoStream || typeof videoStream.height !== 'number') {
       throw new Error('ffprobe found no video stream in source.');
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: ffprobe found no video stream in source.

[Killed] ArrowFunction
src/lib/video/video-storage.adapter.ts:135:46
       streams?: { codec_type?: string; height?: number }[];
       format?: { duration?: string };
     };
-    const videoStream = parsed.streams?.find((s) => s.codec_type === 'video');
+    const videoStream = parsed.streams?.find(() => undefined);
     if (!videoStream || typeof videoStream.height !== 'number') {
       throw new Error('ffprobe found no video stream in source.');
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: ffprobe found no video stream in source.

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:136:9
       format?: { duration?: string };
     };
     const videoStream = parsed.streams?.find((s) => s.codec_type === 'video');
-    if (!videoStream || typeof videoStream.height !== 'number') {
+    if (false) {
       throw new Error('ffprobe found no video stream in source.');
     }
killedBy: VideoStorageAdapter.probeSource throws when no video stream is present
statusReason: expected [Function] to throw error matching /no video stream/i but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/lib/video/video-storage.adapter.ts:136:25
       format?: { duration?: string };
     };
     const videoStream = parsed.streams?.find((s) => s.codec_type === 'video');
-    if (!videoStream || typeof videoStream.height !== 'number') {
+    if (!videoStream || typeof videoStream.height === 'number') {
       throw new Error('ffprobe found no video stream in source.');
     }
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: ffprobe found no video stream in source.

[Killed] ObjectLiteral
src/lib/video/video-storage.adapter.ts:139:12
     if (!videoStream || typeof videoStream.height !== 'number') {
       throw new Error('ffprobe found no video stream in source.');
     }
-    return {
-      height: videoStream.height,
-      durationSec: Number(parsed.format?.duration ?? '0'),
-    };
+    return {};
   }
 
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: expected undefined to be 720 // Object.is equality

[Killed] LogicalOperator
src/lib/video/video-storage.adapter.ts:141:27
     }
     return {
       height: videoStream.height,
-      durationSec: Number(parsed.format?.duration ?? '0'),
+      durationSec: Number(parsed.format?.duration && '0'),
     };
   }
killedBy: VideoStorageAdapter.probeSource returns height and durationSec parsed from ffprobe output
statusReason: expected +0 to be 42.5 // Object.is equality

[Survived] OptionalChaining
src/lib/video/video-storage.adapter.ts:141:27
     }
     return {
       height: videoStream.height,
-      durationSec: Number(parsed.format?.duration ?? '0'),
+      durationSec: Number(parsed.format.duration ?? '0'),
     };
   }

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:145:86
     };
   }
 
-  async readManifestObject(input: { bucket: string; path: string }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
-      return this.fakeReadManifest(input.path);
-    }
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    const [buf] = await file.download();
-    return buf.toString('utf-8');
-  }
+  async readManifestObject(input: { bucket: string; path: string }): Promise<string> {}
 
   async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
killedBy: VideoStorageAdapter.readManifestObject downloads the object body as a UTF-8 string
statusReason: expected undefined to be '#EXTM3U\nbody\n' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:146:9
   }
 
   async readManifestObject(input: { bucket: string; path: string }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
+    if (true) {
       return this.fakeReadManifest(input.path);
     }
killedBy: VideoStorageAdapter.readManifestObject downloads the object body as a UTF-8 string
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-STR…' to be '#EXTM3U\nbody\n' // Object.is equality

[Killed] EqualityOperator
src/lib/video/video-storage.adapter.ts:146:9
   }
 
   async readManifestObject(input: { bucket: string; path: string }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
+    if (this.cfg.playbackStorageImpl !== 'fake') {
       return this.fakeReadManifest(input.path);
     }
killedBy: VideoStorageAdapter.readManifestObject downloads the object body as a UTF-8 string
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-STR…' to be '#EXTM3U\nbody\n' // Object.is equality

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:154:97
     return buf.toString('utf-8');
   }
 
-  async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
-      return `gs-stub://${input.bucket}/${input.path}?ttl=${input.ttlSec}`;
-    }
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    const [url] = await file.getSignedUrl({
-      version: 'v4',
-      action: 'read',
-      expires: Date.now() + input.ttlSec * 1000,
-    });
-    return url;
-  }
+  async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {}
 
   private fakeReadManifest(p: string): string {
killedBy: VideoStorageAdapter.signObjectUrl mints a v4 read URL with the provided TTL
statusReason: expected undefined to be 'https://signed/url' // Object.is equality

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:155:50
   }
 
   async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
-      return `gs-stub://${input.bucket}/${input.path}?ttl=${input.ttlSec}`;
-    }
+    if (this.cfg.playbackStorageImpl === 'fake') {}
     const file = this.storage.bucket(input.bucket).file(input.path);
     const [url] = await file.getSignedUrl({
killedBy: VideoStorageAdapter — playback storage fake mode signObjectUrl returns a gs-stub:// URL with bucket, path, and ttl
statusReason: file.getSignedUrl is not a function

[Killed] EqualityOperator
src/lib/video/video-storage.adapter.ts:155:9
   }
 
   async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
-    if (this.cfg.playbackStorageImpl === 'fake') {
+    if (this.cfg.playbackStorageImpl !== 'fake') {
       return `gs-stub://${input.bucket}/${input.path}?ttl=${input.ttlSec}`;
     }
killedBy: VideoStorageAdapter.signObjectUrl mints a v4 read URL with the provided TTL
statusReason: expected 'gs-stub://b/videos/v1/hls/1080p/seg.t…' to be 'https://signed/url' // Object.is equality

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:156:14
 
   async signObjectUrl(input: { bucket: string; path: string; ttlSec: number }): Promise<string> {
     if (this.cfg.playbackStorageImpl === 'fake') {
-      return `gs-stub://${input.bucket}/${input.path}?ttl=${input.ttlSec}`;
+      return ``;
     }
     const file = this.storage.bucket(input.bucket).file(input.path);
killedBy: VideoStorageAdapter — playback storage fake mode signObjectUrl returns a gs-stub:// URL with bucket, path, and ttl
statusReason: expected '' to be 'gs-stub://b/videos/v1/hls/720p/segmen…' // Object.is equality

[Killed] ArithmeticOperator
src/lib/video/video-storage.adapter.ts:162:16
     const [url] = await file.getSignedUrl({
       version: 'v4',
       action: 'read',
-      expires: Date.now() + input.ttlSec * 1000,
+      expires: Date.now() - input.ttlSec * 1000,
     });
     return url;
killedBy: VideoStorageAdapter.signObjectUrl mints a v4 read URL with the provided TTL
statusReason: expected 1779404843545 to be greater than or equal to 1779433643545

[Killed] ArithmeticOperator
src/lib/video/video-storage.adapter.ts:162:29
     const [url] = await file.getSignedUrl({
       version: 'v4',
       action: 'read',
-      expires: Date.now() + input.ttlSec * 1000,
+      expires: Date.now() + input.ttlSec / 1000,
     });
     return url;
killedBy: VideoStorageAdapter.signObjectUrl mints a v4 read URL with the provided TTL
statusReason: expected 1779419243580.4 to be greater than or equal to 1779433643566

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:168:9
   }
 
   private fakeReadManifest(p: string): string {
-    if (p.endsWith('/manifest.m3u8')) {
+    if (true) {
       return [
         '#EXTM3U',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic rendition m3u8 for /playlist.m3u8 paths
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-STR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="https:…'

[Killed] BlockStatement
src/lib/video/video-storage.adapter.ts:168:39
   }
 
   private fakeReadManifest(p: string): string {
-    if (p.endsWith('/manifest.m3u8')) {
-      return [
-        '#EXTM3U',
-        '#EXT-X-VERSION:6',
-        '#EXT-X-STREAM-INF:BANDWIDTH=5000000,RESOLUTION=1920x1080',
-        '1080p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=3000000,RESOLUTION=1280x720',
-        '720p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=1500000,RESOLUTION=854x480',
-        '480p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=800000,RESOLUTION=640x360',
-        '360p/playlist.m3u8',
-        '',
-      ].join('\n');
-    }
+    if (p.endsWith('/manifest.m3u8')) {}
     if (p.endsWith('/playlist.m3u8')) {
       return [
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic master m3u8 when cfg.playbackStorageImpl=fake
statusReason: fake storage: unknown manifest path videos/v1/hls/manifest.m3u8

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:171:9
     if (p.endsWith('/manifest.m3u8')) {
       return [
         '#EXTM3U',
-        '#EXT-X-VERSION:6',
+        "",
         '#EXT-X-STREAM-INF:BANDWIDTH=5000000,RESOLUTION=1920x1080',
         '1080p/playlist.m3u8',

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:174:9
         '#EXT-X-VERSION:6',
         '#EXT-X-STREAM-INF:BANDWIDTH=5000000,RESOLUTION=1920x1080',
         '1080p/playlist.m3u8',
-        '#EXT-X-STREAM-INF:BANDWIDTH=3000000,RESOLUTION=1280x720',
+        "",
         '720p/playlist.m3u8',
         '#EXT-X-STREAM-INF:BANDWIDTH=1500000,RESOLUTION=854x480',

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:180:9
         '480p/playlist.m3u8',
         '#EXT-X-STREAM-INF:BANDWIDTH=800000,RESOLUTION=640x360',
         '360p/playlist.m3u8',
-        '',
+        "Stryker was here!",
       ].join('\n');
     }

[Killed] MethodExpression
src/lib/video/video-storage.adapter.ts:183:9
         '',
       ].join('\n');
     }
-    if (p.endsWith('/playlist.m3u8')) {
+    if (p.startsWith('/playlist.m3u8')) {
       return [
         '#EXTM3U',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic rendition m3u8 for /playlist.m3u8 paths
statusReason: fake storage: unknown manifest path videos/v1/hls/720p/playlist.m3u8

[Killed] ConditionalExpression
src/lib/video/video-storage.adapter.ts:183:9
         '',
       ].join('\n');
     }
-    if (p.endsWith('/playlist.m3u8')) {
+    if (false) {
       return [
         '#EXTM3U',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic rendition m3u8 for /playlist.m3u8 paths
statusReason: fake storage: unknown manifest path videos/v1/hls/720p/playlist.m3u8

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:188:9
         '#EXTM3U',
         '#EXT-X-VERSION:6',
         '#EXT-X-TARGETDURATION:6',
-        '#EXT-X-KEY:METHOD=AES-128,URI="https://example.invalid/k",IV=0xABCDEF0123456789ABCDEF0123456789',
+        "",
         '#EXTINF:6.000,',
         'segment_001.ts',
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject returns a deterministic rendition m3u8 for /playlist.m3u8 paths
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="https:…'

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:189:9
         '#EXT-X-VERSION:6',
         '#EXT-X-TARGETDURATION:6',
         '#EXT-X-KEY:METHOD=AES-128,URI="https://example.invalid/k",IV=0xABCDEF0123456789ABCDEF0123456789',
-        '#EXTINF:6.000,',
+        "",
         'segment_001.ts',
         '#EXTINF:6.000,',

[Survived] StringLiteral
src/lib/video/video-storage.adapter.ts:193:9
         'segment_001.ts',
         '#EXTINF:6.000,',
         'segment_002.ts',
-        '#EXT-X-ENDLIST',
+        "",
         '',
       ].join('\n');

[Killed] StringLiteral
src/lib/video/video-storage.adapter.ts:197:21
         '',
       ].join('\n');
     }
-    throw new Error(`fake storage: unknown manifest path ${p}`);
+    throw new Error(``);
   }
 }
killedBy: VideoStorageAdapter — playback storage fake mode readManifestObject throws when the path is unknown to the fake
statusReason: expected [Function] to throw error matching /unknown manifest path/ but got ''
