[Survived] StringLiteral
src/lib/video/video.config.ts:1:40
-export const VIDEO_CONFIG = Symbol.for('learnwren.api-video.config');
+export const VIDEO_CONFIG = Symbol.for("");
 
 export type TranscoderImpl = 'gcp' | 'fake';

[Killed] BlockStatement
src/lib/video/video.config.ts:21:69
   invokerSaEmail?: string;
 }
 
-function readRequired(env: NodeJS.ProcessEnv, name: string): string {
-  const v = env[name];
-  if (!v) throw new Error(`${name} env var is required.`);
-  return v;
-}
+function readRequired(env: NodeJS.ProcessEnv, name: string): string {}
 
 function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {
killedBy: readVideoConfigFromEnv throws when a bucket is missing in production
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/video/video.config.ts:23:7
 
 function readRequired(env: NodeJS.ProcessEnv, name: string): string {
   const v = env[name];
-  if (!v) throw new Error(`${name} env var is required.`);
+  if (false) throw new Error(`${name} env var is required.`);
   return v;
 }
killedBy: readVideoConfigFromEnv throws when a bucket is missing in production
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/lib/video/video.config.ts:23:7
 
 function readRequired(env: NodeJS.ProcessEnv, name: string): string {
   const v = env[name];
-  if (!v) throw new Error(`${name} env var is required.`);
+  if (v) throw new Error(`${name} env var is required.`);
   return v;
 }
killedBy: readVideoConfigFromEnv throws when a bucket is missing in production
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/video/video.config.ts:27:89
   return v;
 }
 
-function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {
-  const raw = env[name] ?? dflt;
-  const n = Number(raw);
-  if (!Number.isFinite(n) || n <= 0) {
-    throw new Error(`${name} must be a positive number, got "${raw}".`);
-  }
-  return n;
-}
+function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {}
 
 export function readVideoConfigFromEnv(env: NodeJS.ProcessEnv): VideoConfig {
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: expected undefined to be 30 // Object.is equality

[Killed] LogicalOperator
src/lib/video/video.config.ts:28:15
 }
 
 function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {
-  const raw = env[name] ?? dflt;
+  const raw = env[name] && dflt;
   const n = Number(raw);
   if (!Number.isFinite(n) || n <= 0) {
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_STUCK_THRESHOLD_MINUTES must be a positive number, got "undefined".

[Killed] ConditionalExpression
src/lib/video/video.config.ts:30:7
 function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {
   const raw = env[name] ?? dflt;
   const n = Number(raw);
-  if (!Number.isFinite(n) || n <= 0) {
+  if (true) {
     throw new Error(`${name} must be a positive number, got "${raw}".`);
   }
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_STUCK_THRESHOLD_MINUTES must be a positive number, got "30".

[Killed] ConditionalExpression
src/lib/video/video.config.ts:40:24
   // Outside production the video stack defaults to its credential-free fake
   // mode, so `nx serve` and the e2e suite boot with no GCP project, buckets,
   // or secrets. Production still requires real buckets and a real transcoder.
-  const isProduction = env['NODE_ENV'] === 'production';
+  const isProduction = true;
 
   const sourceBucket = isProduction
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.

[Killed] EqualityOperator
src/lib/video/video.config.ts:40:24
   // Outside production the video stack defaults to its credential-free fake
   // mode, so `nx serve` and the e2e suite boot with no GCP project, buckets,
   // or secrets. Production still requires real buckets and a real transcoder.
-  const isProduction = env['NODE_ENV'] === 'production';
+  const isProduction = env['NODE_ENV'] !== 'production';
 
   const sourceBucket = isProduction
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.

[Killed] StringLiteral
src/lib/video/video.config.ts:43:25
   const isProduction = env['NODE_ENV'] === 'production';
 
   const sourceBucket = isProduction
-    ? readRequired(env, 'LEARNWREN_VIDEO_SOURCE_BUCKET')
+    ? readRequired(env, "")
     : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? 'learnwren-dev-source');
   const outputBucket = isProduction
killedBy: readVideoConfigFromEnv throws when a bucket is missing in production
statusReason: expected [Function] to throw error matching /LEARNWREN_VIDEO_SOURCE_BUCKET/ but got ' env var is required.'

[Killed] LogicalOperator
src/lib/video/video.config.ts:44:8
 
   const sourceBucket = isProduction
     ? readRequired(env, 'LEARNWREN_VIDEO_SOURCE_BUCKET')
-    : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? 'learnwren-dev-source');
+    : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] && 'learnwren-dev-source');
   const outputBucket = isProduction
     ? readRequired(env, 'LEARNWREN_VIDEO_OUTPUT_BUCKET')
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: expected 'learnwren-dev-source' to be 'b' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:44:48
 
   const sourceBucket = isProduction
     ? readRequired(env, 'LEARNWREN_VIDEO_SOURCE_BUCKET')
-    : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? 'learnwren-dev-source');
+    : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? "");
   const outputBucket = isProduction
     ? readRequired(env, 'LEARNWREN_VIDEO_OUTPUT_BUCKET')
killedBy: readVideoConfigFromEnv defaults the video stack to fake mode outside production
statusReason: expected '' to be truthy

[Killed] StringLiteral
src/lib/video/video.config.ts:46:25
     ? readRequired(env, 'LEARNWREN_VIDEO_SOURCE_BUCKET')
     : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? 'learnwren-dev-source');
   const outputBucket = isProduction
-    ? readRequired(env, 'LEARNWREN_VIDEO_OUTPUT_BUCKET')
+    ? readRequired(env, "")
     : (env['LEARNWREN_VIDEO_OUTPUT_BUCKET'] ?? 'learnwren-dev-output');
   const stuckThresholdMinutes = readPositiveNumber(
killedBy: readVideoConfigFromEnv — slice B fields requires LEARNWREN_VIDEO_OUTPUT_BUCKET in production
statusReason: expected [Function] to throw error matching /OUTPUT_BUCKET/ but got ' env var is required.'

[Killed] LogicalOperator
src/lib/video/video.config.ts:47:8
     : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? 'learnwren-dev-source');
   const outputBucket = isProduction
     ? readRequired(env, 'LEARNWREN_VIDEO_OUTPUT_BUCKET')
-    : (env['LEARNWREN_VIDEO_OUTPUT_BUCKET'] ?? 'learnwren-dev-output');
+    : (env['LEARNWREN_VIDEO_OUTPUT_BUCKET'] && 'learnwren-dev-output');
   const stuckThresholdMinutes = readPositiveNumber(
     env,
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: expected 'learnwren-dev-output' to be 'out' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:47:12
     : (env['LEARNWREN_VIDEO_SOURCE_BUCKET'] ?? 'learnwren-dev-source');
   const outputBucket = isProduction
     ? readRequired(env, 'LEARNWREN_VIDEO_OUTPUT_BUCKET')
-    : (env['LEARNWREN_VIDEO_OUTPUT_BUCKET'] ?? 'learnwren-dev-output');
+    : (env[""] ?? 'learnwren-dev-output');
   const stuckThresholdMinutes = readPositiveNumber(
     env,
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: expected 'learnwren-dev-output' to be 'out' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:55:5
   );
   const pollIntervalMs = readPositiveNumber(
     env,
-    'LEARNWREN_WEB_VIDEO_POLL_INTERVAL_MS',
+    "",
     '5000',
   );
killedBy: readVideoConfigFromEnv — slice B fields rejects non-finite poll interval
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/video/video.config.ts:66:7
 
   const playbackFakeRaw = env['LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE'];
   let playbackStorageImpl: 'real' | 'fake';
-  if (playbackFakeRaw === 'true') {
+  if (true) {
     playbackStorageImpl = 'fake';
   } else if (playbackFakeRaw === undefined) {
killedBy: readVideoConfigFromEnv — playback storage flag defaults playbackStorageImpl to "real" in production
statusReason: LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.

[Killed] ConditionalExpression
src/lib/video/video.config.ts:66:7
 
   const playbackFakeRaw = env['LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE'];
   let playbackStorageImpl: 'real' | 'fake';
-  if (playbackFakeRaw === 'true') {
+  if (false) {
     playbackStorageImpl = 'fake';
   } else if (playbackFakeRaw === undefined) {
killedBy: readVideoConfigFromEnv — playback storage flag honors LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true
statusReason: expected 'real' to be 'fake' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.config.ts:68:14
   let playbackStorageImpl: 'real' | 'fake';
   if (playbackFakeRaw === 'true') {
     playbackStorageImpl = 'fake';
-  } else if (playbackFakeRaw === undefined) {
+  } else if (true) {
     playbackStorageImpl = isProduction ? 'real' : 'fake';
   } else {
killedBy: readVideoConfigFromEnv — playback storage flag treats any non-"true" value as "real"
statusReason: expected 'fake' to be 'real' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.config.ts:68:14
   let playbackStorageImpl: 'real' | 'fake';
   if (playbackFakeRaw === 'true') {
     playbackStorageImpl = 'fake';
-  } else if (playbackFakeRaw === undefined) {
+  } else if (false) {
     playbackStorageImpl = isProduction ? 'real' : 'fake';
   } else {
killedBy: readVideoConfigFromEnv defaults the video stack to fake mode outside production
statusReason: expected 'real' to be 'fake' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.config.ts:69:42
   if (playbackFakeRaw === 'true') {
     playbackStorageImpl = 'fake';
   } else if (playbackFakeRaw === undefined) {
-    playbackStorageImpl = isProduction ? 'real' : 'fake';
+    playbackStorageImpl = isProduction ? "" : 'fake';
   } else {
     playbackStorageImpl = 'real';
killedBy: readVideoConfigFromEnv — playback storage flag defaults playbackStorageImpl to "real" in production
statusReason: expected '' to be 'real' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.config.ts:70:10
     playbackStorageImpl = 'fake';
   } else if (playbackFakeRaw === undefined) {
     playbackStorageImpl = isProduction ? 'real' : 'fake';
-  } else {
-    playbackStorageImpl = 'real';
-  }
+  } else {}
   if (playbackStorageImpl === 'fake' && isProduction) {
     throw new Error(
killedBy: readVideoConfigFromEnv — playback storage flag treats any non-"true" value as "real"
statusReason: expected undefined to be 'real' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.config.ts:73:7
   } else {
     playbackStorageImpl = 'real';
   }
-  if (playbackStorageImpl === 'fake' && isProduction) {
+  if (false) {
     throw new Error(
       'LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv — playback storage flag rejects fake playback storage in production by name, with the transcoder valid
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/video/video.config.ts:73:7
   } else {
     playbackStorageImpl = 'real';
   }
-  if (playbackStorageImpl === 'fake' && isProduction) {
+  if (playbackStorageImpl !== 'fake' && isProduction) {
     throw new Error(
       'LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv — playback storage flag defaults playbackStorageImpl to "real" in production
statusReason: LEARNWREN_VIDEO_STORAGE_PLAYBACK_FAKE=true is rejected when NODE_ENV=production.

[Killed] LogicalOperator
src/lib/video/video.config.ts:79:19
     );
   }
 
-  const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
+  const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] && (isProduction ? 'gcp' : 'fake');
   if (implRaw !== 'gcp' && implRaw !== 'fake') {
     throw new Error(
killedBy: readVideoConfigFromEnv defaults the video stack to fake mode outside production
statusReason: LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "undefined".

[NoCoverage] StringLiteral
src/lib/video/video.config.ts:79:72
     );
   }
 
-  const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
+  const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? "" : 'fake');
   if (implRaw !== 'gcp' && implRaw !== 'fake') {
     throw new Error(

[Killed] LogicalOperator
src/lib/video/video.config.ts:80:7
   }
 
   const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
-  if (implRaw !== 'gcp' && implRaw !== 'fake') {
+  if (implRaw !== 'gcp' || implRaw !== 'fake') {
     throw new Error(
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "fake".

[Killed] ConditionalExpression
src/lib/video/video.config.ts:80:28
   }
 
   const implRaw = env['LEARNWREN_VIDEO_TRANSCODER'] ?? (isProduction ? 'gcp' : 'fake');
-  if (implRaw !== 'gcp' && implRaw !== 'fake') {
+  if (implRaw !== 'gcp' && true) {
     throw new Error(
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "fake".

[Killed] LogicalOperator
src/lib/video/video.config.ts:85:7
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
     );
   }
-  if (implRaw === 'fake' && isProduction) {
+  if (implRaw === 'fake' || isProduction) {
     throw new Error(
       'LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.

[Killed] ConditionalExpression
src/lib/video/video.config.ts:85:7
       `LEARNWREN_VIDEO_TRANSCODER must be "gcp" or "fake", got "${implRaw}".`,
     );
   }
-  if (implRaw === 'fake' && isProduction) {
+  if (true) {
     throw new Error(
       'LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.',
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.

[Killed] StringLiteral
src/lib/video/video.config.ts:87:7
   }
   if (implRaw === 'fake' && isProduction) {
     throw new Error(
-      'LEARNWREN_VIDEO_TRANSCODER=fake is rejected when NODE_ENV=production.',
+      "",
     );
   }
killedBy: readVideoConfigFromEnv — slice B fields rejects transcoderImpl=fake when NODE_ENV=production
statusReason: expected [Function] to throw error matching /production/i but got ''

[Killed] ObjectLiteral
src/lib/video/video.config.ts:91:29
     );
   }
 
-  const base: VideoConfig = {
-    sourceBucket,
-    outputBucket,
-    stuckThresholdMinutes,
-    pollIntervalMs,
-    playbackSignedUrlTtlSec,
-    transcoderImpl: implRaw,
-    playbackStorageImpl,
-  };
+  const base: VideoConfig = {};
 
   if (implRaw === 'fake') return base;
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: expected undefined to be 'b' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.config.ts:101:7
     playbackStorageImpl,
   };
 
-  if (implRaw === 'fake') return base;
+  if (true) return base;
 
   return {
killedBy: readVideoConfigFromEnv — slice B fields requires gcp-specific vars when transcoderImpl=gcp
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/video/video.config.ts:101:7
     playbackStorageImpl,
   };
 
-  if (implRaw === 'fake') return base;
+  if (false) return base;
 
   return {
killedBy: readVideoConfigFromEnv returns config with provided bucket and default threshold of 30
statusReason: LEARNWREN_GCP_PROJECT_ID env var is required.

[Killed] StringLiteral
src/lib/video/video.config.ts:105:37
 
   return {
     ...base,
-    gcpProjectId: readRequired(env, 'LEARNWREN_GCP_PROJECT_ID'),
+    gcpProjectId: readRequired(env, ""),
     transcoderLocation: readRequired(env, 'LEARNWREN_TRANSCODER_LOCATION'),
     transcoderTopic: readRequired(env, 'LEARNWREN_TRANSCODER_TOPIC'),
killedBy: readVideoConfigFromEnv — slice B fields requires gcp-specific vars when transcoderImpl=gcp
statusReason: expected [Function] to throw error matching /LEARNWREN_GCP_PROJECT_ID/ but got ' env var is required.'

[Killed] StringLiteral
src/lib/video/video.config.ts:106:43
   return {
     ...base,
     gcpProjectId: readRequired(env, 'LEARNWREN_GCP_PROJECT_ID'),
-    transcoderLocation: readRequired(env, 'LEARNWREN_TRANSCODER_LOCATION'),
+    transcoderLocation: readRequired(env, ""),
     transcoderTopic: readRequired(env, 'LEARNWREN_TRANSCODER_TOPIC'),
     webhookAudience: readRequired(env, 'LEARNWREN_TRANSCODER_WEBHOOK_AUDIENCE'),
killedBy: readVideoConfigFromEnv — slice B fields accepts a complete gcp config
statusReason: env var is required.

[Killed] StringLiteral
src/lib/video/video.config.ts:109:39
     transcoderLocation: readRequired(env, 'LEARNWREN_TRANSCODER_LOCATION'),
     transcoderTopic: readRequired(env, 'LEARNWREN_TRANSCODER_TOPIC'),
     webhookAudience: readRequired(env, 'LEARNWREN_TRANSCODER_WEBHOOK_AUDIENCE'),
-    invokerSaEmail: readRequired(env, 'LEARNWREN_TRANSCODER_INVOKER_SA_EMAIL'),
+    invokerSaEmail: readRequired(env, ""),
   };
 }
killedBy: readVideoConfigFromEnv — slice B fields accepts a complete gcp config
statusReason: env var is required.
