[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:27:9
   catch(exception: unknown, host: ArgumentsHost): void {
     const response = host.switchToHttp().getResponse<Response>();
 
-    if (exception instanceof VideoException) {
+    if (false) {
       const body: VideoErrorBody = {
         error: { code: exception.code, message: exception.message },
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Received:

  1st vi.fn() call:

  [
-   404,

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:27:46
   catch(exception: unknown, host: ArgumentsHost): void {
     const response = host.switchToHttp().getResponse<Response>();
 
-    if (exception instanceof VideoException) {
-      const body: VideoErrorBody = {
-        error: { code: exception.code, message: exception.message },
-      };
-      if (exception.details) {
-        body.error.details = exception.details;
-      }
-      response.status(exception.status).json(body);
-      return;
-    }
+    if (exception instanceof VideoException) {}
 
     // Auth exceptions share the same shape (code/status/message)
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ 404 ]

Received:

  1st vi.fn() call:

  [
-   404,

[Killed] ObjectLiteral
src/lib/video/video.exception-filter.ts:28:36
     const response = host.switchToHttp().getResponse<Response>();
 
     if (exception instanceof VideoException) {
-      const body: VideoErrorBody = {
-        error: { code: exception.code, message: exception.message },
-      };
+      const body: VideoErrorBody = {};
       if (exception.details) {
         body.error.details = exception.details;
killedBy: VideoExceptionFilter maps a VideoException to its declared status and code
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:31:11
       const body: VideoErrorBody = {
         error: { code: exception.code, message: exception.message },
       };
-      if (exception.details) {
+      if (false) {
         body.error.details = exception.details;
       }
killedBy: VideoExceptionFilter preserves details when present
statusReason: expected undefined to be 'TRANSCODING' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:31:30
       const body: VideoErrorBody = {
         error: { code: exception.code, message: exception.message },
       };
-      if (exception.details) {
-        body.error.details = exception.details;
-      }
+      if (exception.details) {}
       response.status(exception.status).json(body);
       return;
killedBy: VideoExceptionFilter preserves details when present
statusReason: expected undefined to be 'TRANSCODING' // Object.is equality

[Killed] LogicalOperator
src/lib/video/video.exception-filter.ts:40:7
 
     // Auth exceptions share the same shape (code/status/message)
     if (
-      exception instanceof Error &&
-      (exception.name === 'AuthException' || exception.constructor.name === 'AuthException')
+      exception instanceof Error || exception.name === 'AuthException' || exception.constructor.name === 'AuthException'
     ) {
       const err = exception as Error & {
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:40:7
 
     // Auth exceptions share the same shape (code/status/message)
     if (
-      exception instanceof Error &&
-      (exception.name === 'AuthException' || exception.constructor.name === 'AuthException')
+      false
     ) {
       const err = exception as Error & {
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Received:

  1st vi.fn() call:

  [
-   403,

[Killed] LogicalOperator
src/lib/video/video.exception-filter.ts:41:8
     // Auth exceptions share the same shape (code/status/message)
     if (
       exception instanceof Error &&
-      (exception.name === 'AuthException' || exception.constructor.name === 'AuthException')
+      (exception.name === 'AuthException' && exception.constructor.name === 'AuthException')
     ) {
       const err = exception as Error & {
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Received:

  1st vi.fn() call:

  [
-   403,

[Killed] EqualityOperator
src/lib/video/video.exception-filter.ts:41:46
     // Auth exceptions share the same shape (code/status/message)
     if (
       exception instanceof Error &&
-      (exception.name === 'AuthException' || exception.constructor.name === 'AuthException')
+      (exception.name === 'AuthException' || exception.constructor.name !== 'AuthException')
     ) {
       const err = exception as Error & {
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:42:7
     if (
       exception instanceof Error &&
       (exception.name === 'AuthException' || exception.constructor.name === 'AuthException')
-    ) {
-      const err = exception as Error & {
-        code: string;
-        status: number;
-        details?: Record<string, unknown>;
-      };
-      const body: VideoErrorBody = {
-        error: { code: err.code, message: err.message },
-      };
-      if (err.details) body.error.details = err.details;
-      response.status(err.status).json(body);
-      return;
-    }
+    ) {}
 
     if (exception instanceof BadRequestException) {
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ 403 ]

Received:

  1st vi.fn() call:

  [
-   403,

[Killed] ObjectLiteral
src/lib/video/video.exception-filter.ts:48:36
         status: number;
         details?: Record<string, unknown>;
       };
-      const body: VideoErrorBody = {
-        error: { code: err.code, message: err.message },
-      };
+      const body: VideoErrorBody = {};
       if (err.details) body.error.details = err.details;
       response.status(err.status).json(body);
killedBy: VideoExceptionFilter delegates an InsufficientRoleException (AuthException subclass) to a 403 INSUFFICIENT_ROLE
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:51:11
       const body: VideoErrorBody = {
         error: { code: err.code, message: err.message },
       };
-      if (err.details) body.error.details = err.details;
+      if (true) body.error.details = err.details;
       response.status(err.status).json(body);
       return;

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:51:11
       const body: VideoErrorBody = {
         error: { code: err.code, message: err.message },
       };
-      if (err.details) body.error.details = err.details;
+      if (false) body.error.details = err.details;
       response.status(err.status).json(body);
       return;

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:56:9
       return;
     }
 
-    if (exception instanceof BadRequestException) {
+    if (false) {
       const payload = exception.getResponse() as { message?: string[] | string };
       const messages = Array.isArray(payload.message)
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received:

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:56:9
       return;
     }
 
-    if (exception instanceof BadRequestException) {
+    if (true) {
       const payload = exception.getResponse() as { message?: string[] | string };
       const messages = Array.isArray(payload.message)
killedBy: VideoExceptionFilter falls back to INTERNAL for unknown exceptions
statusReason: exception.getResponse is not a function

[NoCoverage] ArrayDeclaration
src/lib/video/video.exception-filter.ts:61:13
       const messages = Array.isArray(payload.message)
         ? payload.message
         : payload.message
-          ? [payload.message]
+          ? []
           : [];
       const fieldErrors = parseFieldErrors(messages);

[Survived] LogicalOperator
src/lib/video/video.exception-filter.ts:75:37
     }
 
     this.logger.error(
-      exception instanceof Error ? (exception.stack ?? exception.message) : String(exception),
+      exception instanceof Error ? (exception.stack && exception.message) : String(exception),
     );
     response.status(500).json({

[Killed] ObjectLiteral
src/lib/video/video.exception-filter.ts:77:31
     this.logger.error(
       exception instanceof Error ? (exception.stack ?? exception.message) : String(exception),
     );
-    response.status(500).json({
-      error: { code: 'INTERNAL', message: 'An internal error occurred.' },
-    } satisfies VideoErrorBody);
+    response.status(500).json({} satisfies VideoErrorBody);
   }
 }
killedBy: VideoExceptionFilter falls back to INTERNAL for unknown exceptions
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] StringLiteral
src/lib/video/video.exception-filter.ts:78:43
       exception instanceof Error ? (exception.stack ?? exception.message) : String(exception),
     );
     response.status(500).json({
-      error: { code: 'INTERNAL', message: 'An internal error occurred.' },
+      error: { code: 'INTERNAL', message: "" },
     } satisfies VideoErrorBody);
   }
killedBy: VideoExceptionFilter falls back to INTERNAL for unknown exceptions
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
src/lib/video/video.exception-filter.ts:78:22
       exception instanceof Error ? (exception.stack ?? exception.message) : String(exception),
     );
     response.status(500).json({
-      error: { code: 'INTERNAL', message: 'An internal error occurred.' },
+      error: { code: "", message: 'An internal error occurred.' },
     } satisfies VideoErrorBody);
   }
killedBy: VideoExceptionFilter falls back to INTERNAL for unknown exceptions
statusReason: expected "vi.fn()" to be called with arguments: [ { error: { …(2) } } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
src/lib/video/video.exception-filter.ts:87:73
  * class-validator emits messages like "sizeBytes must not be greater than 10000000000".
  * Extract the leading field name (the first word) as the key.
  */
-function parseFieldErrors(messages: string[]): Record<string, string[]> {
-  const out: Record<string, string[]> = {};
-  for (const msg of messages) {
-    const parts = msg.split(' ');
-    const field = parts[0];
-    if (!field) continue;
-    if (!out[field]) out[field] = [];
-    out[field].push(msg);
-  }
-  return out;
-}
+function parseFieldErrors(messages: string[]): Record<string, string[]> {}
 
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: expected undefined to be truthy

[Survived] BlockStatement
src/lib/video/video.exception-filter.ts:89:31
  */
 function parseFieldErrors(messages: string[]): Record<string, string[]> {
   const out: Record<string, string[]> = {};
-  for (const msg of messages) {
-    const parts = msg.split(' ');
-    const field = parts[0];
-    if (!field) continue;
-    if (!out[field]) out[field] = [];
-    out[field].push(msg);
-  }
+  for (const msg of messages) {}
   return out;
 }

[Survived] StringLiteral
src/lib/video/video.exception-filter.ts:90:29
 function parseFieldErrors(messages: string[]): Record<string, string[]> {
   const out: Record<string, string[]> = {};
   for (const msg of messages) {
-    const parts = msg.split(' ');
+    const parts = msg.split("");
     const field = parts[0];
     if (!field) continue;

[Survived] ConditionalExpression
src/lib/video/video.exception-filter.ts:92:9
   for (const msg of messages) {
     const parts = msg.split(' ');
     const field = parts[0];
-    if (!field) continue;
+    if (true) continue;
     if (!out[field]) out[field] = [];
     out[field].push(msg);

[Survived] BooleanLiteral
src/lib/video/video.exception-filter.ts:92:9
   for (const msg of messages) {
     const parts = msg.split(' ');
     const field = parts[0];
-    if (!field) continue;
+    if (field) continue;
     if (!out[field]) out[field] = [];
     out[field].push(msg);

[Killed] BooleanLiteral
src/lib/video/video.exception-filter.ts:93:9
     const parts = msg.split(' ');
     const field = parts[0];
     if (!field) continue;
-    if (!out[field]) out[field] = [];
+    if (out[field]) out[field] = [];
     out[field].push(msg);
   }
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/lib/video/video.exception-filter.ts:93:9
     const parts = msg.split(' ');
     const field = parts[0];
     if (!field) continue;
-    if (!out[field]) out[field] = [];
+    if (false) out[field] = [];
     out[field].push(msg);
   }
killedBy: VideoExceptionFilter maps a NestJS BadRequestException (DTO validation) to VALIDATION_FAILED with fieldErrors
statusReason: Cannot read properties of undefined (reading 'push')
