[Killed] StringLiteral
src/lib/video/video.service.ts:41:22
 
 const EXT_BY_CONTENT_TYPE: Record<SupportedVideoContentType, 'mp4' | 'mov' | 'mkv'> = {
   'video/mp4': 'mp4',
-  'video/quicktime': 'mov',
+  'video/quicktime': "",
   'video/x-matroska': 'mkv',
 };
killedBy: VideoService.createUploadSession selects the correct extension for each MIME type
statusReason: expected 'videos/v-mov/source.' to be 'videos/v-mov/source.mov' // Object.is equality

[Survived] StringLiteral
src/lib/video/video.service.ts:48:3
 const DELETABLE_STATES: Readonly<Set<Video['state']>> = new Set([
   'PENDING_UPLOAD',
   'UPLOADED',
-  'FAILED',
+  "",
   'TRANSCODING',
   'READY',

[Killed] BlockStatement
src/lib/video/video.service.ts:86:5
     @Inject(VIDEO_CONFIG) private readonly cfg: VideoConfig,
     @Inject(VIDEO_TRANSCODER) private readonly transcoder: VideoTranscoder,
     @Optional() deps?: VideoServiceDeps,
-  ) {
-    this.sleep = deps?.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
-  }
+  ) {}
 
   async createUploadSession(args: CreateUploadSessionInput): Promise<CreateUploadSessionResult> {
killedBy: VideoService.completeUpload — slice B retries submitJob up to 3 times before failing
statusReason: this.sleep is not a function

[Killed] LogicalOperator
src/lib/video/video.service.ts:87:18
     @Inject(VIDEO_TRANSCODER) private readonly transcoder: VideoTranscoder,
     @Optional() deps?: VideoServiceDeps,
   ) {
-    this.sleep = deps?.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
+    this.sleep = deps?.sleep && (ms => new Promise(r => setTimeout(r, ms)));
   }
 
killedBy: VideoService.completeUpload — slice B sleeps with exponential backoff between retries but not after the final attempt
statusReason: expected [] to deeply equal [ [ 1000 ], [ 2000 ] ]

[Killed] StringLiteral
src/lib/video/video.service.ts:101:14
       ownerInstructorId: args.uid,
       courseId: args.courseId,
       lessonId: args.lessonId,
-      state: 'PENDING_UPLOAD',
+      state: "",
       source: { bucket: this.cfg.sourceBucket, path, sizeBytes: args.input.sizeBytes },
       createdAt: now,
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: expected '' to be 'PENDING_UPLOAD' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.service.ts:127:38
     if (!v) throw new VideoNotFoundException();
     if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
     const updatedAt = nowIso();
-    await this.repo.updateVideo(vid, { state: 'FAILED', failureReason: reason, updatedAt });
+    await this.repo.updateVideo(vid, {});
     return { ...v, state: 'FAILED', failureReason: reason, updatedAt };
   }
killedBy: VideoService.markFailed advances PENDING_UPLOAD to FAILED with a reason
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1', ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    "v1",

[Killed] ConditionalExpression
src/lib/video/video.service.ts:137:9
     if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
 
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
-    if (!head) throw new UploadObjectMissingException();
+    if (false) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
     if (head.size > declared * SIZE_TOLERANCE) {
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_MISSING when HEAD returns null
statusReason: expected TypeError: Cannot read properties of null… to be an instance of UploadObjectMissingException

[Killed] EqualityOperator
src/lib/video/video.service.ts:139:9
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
     if (!head) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
-    if (head.size > declared * SIZE_TOLERANCE) {
+    if (head.size <= declared * SIZE_TOLERANCE) {
       await this.storage
         .deleteObject({ bucket: v.source.bucket, path: v.source.path })
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes object when over tolerance
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ArithmeticOperator
src/lib/video/video.service.ts:139:21
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
     if (!head) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
-    if (head.size > declared * SIZE_TOLERANCE) {
+    if (head.size > declared / SIZE_TOLERANCE) {
       await this.storage
         .deleteObject({ bucket: v.source.bucket, path: v.source.path })
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "VideoException: Uploaded object size exce… { …(3) }" instead of resolving

[Survived] StringLiteral
src/lib/video/video.service.ts:150:24
     try {
       probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
     } catch (err) {
-      this.logger.warn(`ffprobe failed for ${vid}: ${(err as Error).message}`);
+      this.logger.warn(``);
       return this.repo.markFailedFromSubmission({
         vid,

[Killed] ObjectLiteral
src/lib/video/video.service.ts:163:47
     const keyId = this.repo.newId<VideoKeyId>();
     const sourceUri = `gs://${v.source.bucket}/${v.source.path}`;
     const outputUriPrefix = `gs://${this.cfg.outputBucket}/videos/${vid}/hls/`;
-    const submit = await this.submitWithRetry({
-      videoId: vid,
-      sourceUri,
-      outputUriPrefix,
-      encryptionKey: { id: keyId, bytes: keyBytes },
-      sourceHeight: probe.height,
-      topic: this.cfg.transcoderTopic ?? '',
-    });
+    const submit = await this.submitWithRetry({});
     if (!submit.ok) {
       return this.repo.markFailedFromSubmission({
killedBy: VideoService.completeUpload — slice B passes sourceHeight from the probe to submitJob
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BooleanLiteral
src/lib/video/video.service.ts:171:9
       sourceHeight: probe.height,
       topic: this.cfg.transcoderTopic ?? '',
     });
-    if (!submit.ok) {
+    if (submit.ok) {
       return this.repo.markFailedFromSubmission({
         vid,
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/lib/video/video.service.ts:180:44
       });
     }
 
-    return this.repo.finalizeUploadWithJob({
-      vid,
-      lid: v.lessonId,
-      actualSizeBytes: head.size,
-      key: { id: keyId, bytes: keyBytes },
-      transcoderJobName: submit.jobName,
-      nowIso: nowIso(),
-    });
+    return this.repo.finalizeUploadWithJob({});
   }
 
killedBy: VideoService.completeUpload — slice B happy path: probes, generates key, submits, finalizes to TRANSCODING
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] EqualityOperator
src/lib/video/video.service.ts:194:27
     input: Parameters<VideoTranscoder['submitJob']>[0],
   ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
     let lastError = 'unknown';
-    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
+    for (let attempt = 0; attempt <= MAX_SUBMIT_ATTEMPTS; attempt++) {
       try {
         const handle = await this.transcoder.submitJob(input);
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected "vi.fn()" to be called 3 times, but got 4 times

[Killed] UpdateOperator
src/lib/video/video.service.ts:194:58
     input: Parameters<VideoTranscoder['submitJob']>[0],
   ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
     let lastError = 'unknown';
-    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
+    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt--) {
       try {
         const handle = await this.transcoder.submitJob(input);
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected "vi.fn()" to be called 3 times, but got 4 times

[Killed] ObjectLiteral
src/lib/video/video.service.ts:197:16
     for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
       try {
         const handle = await this.transcoder.submitJob(input);
-        return { ok: true, jobName: handle.jobName };
+        return {};
       } catch (err) {
         lastError = (err as Error).message;
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/lib/video/video.service.ts:201:13
       } catch (err) {
         lastError = (err as Error).message;
         this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
+        if (true) {
           await this.sleep(BACKOFF_MS[attempt]!);
         }
killedBy: VideoService.completeUpload — slice B sleeps with exponential backoff between retries but not after the final attempt
statusReason: expected [ [ 1000 ], [ 2000 ], [ 4000 ] ] to deeply equal [ [ 1000 ], [ 2000 ] ]

[Killed] EqualityOperator
src/lib/video/video.service.ts:201:13
       } catch (err) {
         lastError = (err as Error).message;
         this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
+        if (attempt >= MAX_SUBMIT_ATTEMPTS - 1) {
           await this.sleep(BACKOFF_MS[attempt]!);
         }
killedBy: VideoService.completeUpload — slice B sleeps with exponential backoff between retries but not after the final attempt
statusReason: expected [ [ 4000 ] ] to deeply equal [ [ 1000 ], [ 2000 ] ]

[Killed] ObjectLiteral
src/lib/video/video.service.ts:206:12
         }
       }
     }
-    return { ok: false, lastError };
+    return {};
   }
 
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/video/video.service.ts:212:20
   async handleTranscoderEvent(
     event: TranscoderEvent,
   ): Promise<{ acted: boolean; reason?: string }> {
-    const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
+    const common = {};
     if (event.type === 'JOB_SUCCEEDED') {
       return this.repo.applyTranscoderResult({
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/video/video.service.ts:213:9
     event: TranscoderEvent,
   ): Promise<{ acted: boolean; reason?: string }> {
     const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
-    if (event.type === 'JOB_SUCCEEDED') {
+    if (false) {
       return this.repo.applyTranscoderResult({
         ...common,
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ConditionalExpression
src/lib/video/video.service.ts:233:9
   async delete(vid: VideoId): Promise<void> {
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
-    if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
+    if (true) throw new InvalidVideoStateException(v.state);
 
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: Operation is not valid in state PENDING_UPLOAD.

[Killed] ConditionalExpression
src/lib/video/video.service.ts:240:9
         this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
       );
     }
-    if (v.state === 'READY' && v.output?.bucket) {
+    if (false) {
       await this.storage.deletePrefix({
         bucket: v.output.bucket,
killedBy: VideoService.delete — slice B state widening READY: deletes output prefix from output bucket best-effort
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'out', …(1) } ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/video/video.service.ts:254:9
 
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
-    if (!v) return;
+    if (false) return;
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
killedBy: VideoService.deleteForLesson (cascade) no-ops when no video attached
statusReason: Cannot read properties of null (reading 'state')

[Killed] ConditionalExpression
src/lib/video/video.service.ts:255:9
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
     if (!v) return;
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
+    if (false) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
     }
killedBy: VideoService.deleteForLesson (cascade) cancels the in-flight transcoder job when cascading a TRANSCODING video
statusReason: expected "vi.fn()" to be called with arguments: [ 'jobs/xyz' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/video/video.service.ts:258:50
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
     }
-    if (v.state === 'READY' && v.output?.bucket) {
-      await this.storage.deletePrefix({
-        bucket: v.output.bucket,
-        prefix: `videos/${v.id}/`,
-      });
-    }
+    if (v.state === 'READY' && v.output?.bucket) {}
     await this.storage
       .deleteObject({ bucket: v.source.bucket, path: v.source.path })
killedBy: VideoService.deleteForLesson (cascade) deletes the output prefix when cascading a READY video
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'out', …(1) } ]

Number of calls: 0

[Killed] StringLiteral
src/lib/video/video.service.ts:261:17
     if (v.state === 'READY' && v.output?.bucket) {
       await this.storage.deletePrefix({
         bucket: v.output.bucket,
-        prefix: `videos/${v.id}/`,
+        prefix: ``,
       });
     }
killedBy: VideoService.deleteForLesson (cascade) deletes the output prefix when cascading a READY video
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'out', …(1) } ]

Received:

  1st vi.fn() call:

  [
    {
