[Killed] BlockStatement
api-courses/src/lib/course-owner.guard.ts:16:62
 export class CourseOwnerGuard implements CanActivate {
   constructor(private readonly repo: CoursesRepository) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<CourseScopedRequest>();
-    const cid = req.params?.['cid'] as CourseId | undefined;
-    if (!cid) throw new CourseNotFoundException();
-
-    const course = await this.repo.getCourse(cid);
-    if (!course) throw new CourseNotFoundException();
-    if (course.instructorId !== req.user?.uid) {
-      throw new NotCourseOwnerException();
-    }
-
-    req.course = course;
-    return true;
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: CourseOwnerGuard returns true and stashes the course when the user owns it
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
api-courses/src/lib/course-owner.guard.ts:19:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<CourseScopedRequest>();
     const cid = req.params?.['cid'] as CourseId | undefined;
-    if (!cid) throw new CourseNotFoundException();
+    if (false) throw new CourseNotFoundException();
 
     const course = await this.repo.getCourse(cid);
killedBy: CourseOwnerGuard throws CourseNotFoundException without hitting the repo when :cid is missing
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "",

[Killed] ConditionalExpression
api-courses/src/lib/course-owner.guard.ts:19:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<CourseScopedRequest>();
     const cid = req.params?.['cid'] as CourseId | undefined;
-    if (!cid) throw new CourseNotFoundException();
+    if (true) throw new CourseNotFoundException();
 
     const course = await this.repo.getCourse(cid);
killedBy: CourseOwnerGuard returns true and stashes the course when the user owns it
statusReason: promise rejected "CoursesException: Course not found. { …(3) }" instead of resolving

[Killed] ConditionalExpression
api-courses/src/lib/course-owner.guard.ts:22:9
     if (!cid) throw new CourseNotFoundException();
 
     const course = await this.repo.getCourse(cid);
-    if (!course) throw new CourseNotFoundException();
+    if (true) throw new CourseNotFoundException();
     if (course.instructorId !== req.user?.uid) {
       throw new NotCourseOwnerException();
killedBy: CourseOwnerGuard returns true and stashes the course when the user owns it
statusReason: promise rejected "CoursesException: Course not found. { …(3) }" instead of resolving

[Killed] ConditionalExpression
api-courses/src/lib/course-owner.guard.ts:22:9
     if (!cid) throw new CourseNotFoundException();
 
     const course = await this.repo.getCourse(cid);
-    if (!course) throw new CourseNotFoundException();
+    if (false) throw new CourseNotFoundException();
     if (course.instructorId !== req.user?.uid) {
       throw new NotCourseOwnerException();
killedBy: CourseOwnerGuard throws CourseNotFoundException when the course does not exist
statusReason: expected TypeError: Cannot read properties of null… to be an instance of CourseNotFoundException

[Killed] ConditionalExpression
api-courses/src/lib/course-owner.guard.ts:23:9
 
     const course = await this.repo.getCourse(cid);
     if (!course) throw new CourseNotFoundException();
-    if (course.instructorId !== req.user?.uid) {
+    if (true) {
       throw new NotCourseOwnerException();
     }
killedBy: CourseOwnerGuard returns true and stashes the course when the user owns it
statusReason: promise rejected "CoursesException: You do not own this cou… { …(3) }" instead of resolving

[Killed] OptionalChaining
api-courses/src/lib/course-owner.guard.ts:23:33
 
     const course = await this.repo.getCourse(cid);
     if (!course) throw new CourseNotFoundException();
-    if (course.instructorId !== req.user?.uid) {
+    if (course.instructorId !== req.user.uid) {
       throw new NotCourseOwnerException();
     }
killedBy: CourseOwnerGuard throws NotCourseOwnerException when no user is attached (defensive — InstructorRoleGuard should have blocked already)
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of NotCourseOwnerException

[Killed] BooleanLiteral
api-courses/src/lib/course-owner.guard.ts:28:12
     }
 
     req.course = course;
-    return true;
+    return false;
   }
 }
killedBy: CourseOwnerGuard returns true and stashes the course when the user owns it
statusReason: expected false to be true // Object.is equality
