[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:56:22
   async createCourse(
     @Body() dto: CreateCourseDto,
     @Req() req: AuthenticatedRequest,
-  ): Promise<Course> {
-    return this.service.createCourse(req.user!.uid, dto);
-  }
+  ): Promise<Course> {}
 
   @Get()
killedBy: CoursesController POST /courses delegates to CoursesService.createCourse with uid + dto
statusReason: expected "vi.fn()" to be called with arguments: [ 'uid-1', …(1) ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:61:74
   }
 
   @Get()
-  async listCourses(@Req() req: AuthenticatedRequest): Promise<Course[]> {
-    return this.service.listCoursesForInstructor(req.user!.uid);
-  }
+  async listCourses(@Req() req: AuthenticatedRequest): Promise<Course[]> {}
 
   @Get(':cid')
killedBy: CoursesController GET /courses lists current instructor courses
statusReason: expected "vi.fn()" to be called with arguments: [ 'uid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:67:69
 
   @Get(':cid')
   @UseGuards(CourseOwnerGuard)
-  async getCourse(@Param('cid') cid: CourseId): Promise<CourseTree> {
-    return this.service.getCourseTree(cid);
-  }
+  async getCourse(@Param('cid') cid: CourseId): Promise<CourseTree> {}
 
   @Patch(':cid')
killedBy: CoursesController GET /courses/:cid returns hydrated tree
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:77:28
     @Param('cid') cid: CourseId,
     @Body() dto: UpdateCourseDto,
     @Req() _req: AuthenticatedRequest,
-  ): Promise<{ ok: true }> {
-    await this.service.updateCourse(cid, dto);
-    return { ok: true };
-  }
+  ): Promise<{ ok: true }> {}
 
   @Delete(':cid')
killedBy: CoursesController PATCH /courses/:cid forwards the patch
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', { title: 'New' } ]

Number of calls: 0

[Killed] BooleanLiteral
api-courses/src/lib/courses.controller.ts:79:18
     @Req() _req: AuthenticatedRequest,
   ): Promise<{ ok: true }> {
     await this.service.updateCourse(cid, dto);
-    return { ok: true };
+    return { ok: false };
   }
 
killedBy: CoursesController PATCH /courses/:cid forwards the patch
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:85:66
   @Delete(':cid')
   @HttpCode(204)
   @UseGuards(CourseOwnerGuard)
-  async deleteCourse(@Param('cid') cid: CourseId): Promise<void> {
-    await this.service.deleteCourse(cid);
-  }
+  async deleteCourse(@Param('cid') cid: CourseId): Promise<void> {}
 
   // ────────────────────────── Module ──────────────────────────
killedBy: CoursesController DELETE /courses/:cid deletes the course
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:96:22
   async createModule(
     @Param('cid') cid: CourseId,
     @Body() dto: CreateModuleDto,
-  ): Promise<Module> {
-    return this.service.createModule(cid, dto);
-  }
+  ): Promise<Module> {}
 
   @Patch(':cid/modules/:mid')
killedBy: CoursesController POST /courses/:cid/modules creates a module
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', { title: 'M' } ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:106:28
     @Param('cid') cid: CourseId,
     @Param('mid') mid: ModuleId,
     @Body() dto: UpdateModuleDto,
-  ): Promise<{ ok: true }> {
-    await this.service.updateModule(cid, mid, dto);
-    return { ok: true };
-  }
+  ): Promise<{ ok: true }> {}
 
   @Delete(':cid/modules/:mid')
killedBy: CoursesController PATCH /courses/:cid/modules/:mid updates a module
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', { title: 'New' } ]

Number of calls: 0

[Killed] BooleanLiteral
api-courses/src/lib/courses.controller.ts:108:18
     @Body() dto: UpdateModuleDto,
   ): Promise<{ ok: true }> {
     await this.service.updateModule(cid, mid, dto);
-    return { ok: true };
+    return { ok: false };
   }
 
killedBy: CoursesController PATCH /courses/:cid/modules/:mid updates a module
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:117:20
   async deleteModule(
     @Param('cid') cid: CourseId,
     @Param('mid') mid: ModuleId,
-  ): Promise<void> {
-    await this.service.deleteModule(cid, mid);
-  }
+  ): Promise<void> {}
 
   @Put(':cid/modules/order')
killedBy: CoursesController DELETE /courses/:cid/modules/:mid deletes a module
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:126:24
   async reorderModules(
     @Param('cid') cid: CourseId,
     @Body() dto: ReorderDto,
-  ): Promise<Module[]> {
-    return this.service.reorderModules(cid, dto.ids as ModuleId[]);
-  }
+  ): Promise<Module[]> {}
 
   // ────────────────────────── Lesson ──────────────────────────
killedBy: CoursesController PUT /courses/:cid/modules/order reorders modules
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', [ 'm1', 'm2' ] ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:138:22
     @Param('cid') cid: CourseId,
     @Param('mid') mid: ModuleId,
     @Body() dto: CreateLessonDto,
-  ): Promise<Lesson> {
-    return this.service.createLesson(cid, mid, dto);
-  }
+  ): Promise<Lesson> {}
 
   @Patch(':cid/modules/:mid/lessons/:lid')
killedBy: CoursesController POST /courses/:cid/modules/:mid/lessons creates a lesson
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', { title: 'L' } ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:149:28
     @Param('mid') mid: ModuleId,
     @Param('lid') lid: LessonId,
     @Body() dto: UpdateLessonDto,
-  ): Promise<{ ok: true }> {
-    await this.service.updateLesson(cid, mid, lid, dto);
-    return { ok: true };
-  }
+  ): Promise<{ ok: true }> {}
 
   @Delete(':cid/modules/:mid/lessons/:lid')
killedBy: CoursesController PATCH /courses/:cid/modules/:mid/lessons/:lid updates a lesson
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', 'lid-1', …(1) ]

Number of calls: 0

[Killed] BooleanLiteral
api-courses/src/lib/courses.controller.ts:151:18
     @Body() dto: UpdateLessonDto,
   ): Promise<{ ok: true }> {
     await this.service.updateLesson(cid, mid, lid, dto);
-    return { ok: true };
+    return { ok: false };
   }
 
killedBy: CoursesController PATCH /courses/:cid/modules/:mid/lessons/:lid updates a lesson
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] ObjectLiteral
api-courses/src/lib/courses.controller.ts:151:12
     @Body() dto: UpdateLessonDto,
   ): Promise<{ ok: true }> {
     await this.service.updateLesson(cid, mid, lid, dto);
-    return { ok: true };
+    return {};
   }
 
killedBy: CoursesController PATCH /courses/:cid/modules/:mid/lessons/:lid updates a lesson
statusReason: expected {} to deeply equal { ok: true }

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:161:20
     @Param('cid') cid: CourseId,
     @Param('mid') mid: ModuleId,
     @Param('lid') lid: LessonId,
-  ): Promise<void> {
-    await this.service.deleteLesson(cid, mid, lid);
-  }
+  ): Promise<void> {}
 
   @Put(':cid/modules/:mid/lessons/order')
killedBy: CoursesController DELETE /courses/:cid/modules/:mid/lessons/:lid deletes a lesson
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', 'lid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:171:24
     @Param('cid') cid: CourseId,
     @Param('mid') mid: ModuleId,
     @Body() dto: ReorderDto,
-  ): Promise<Lesson[]> {
-    return this.service.reorderLessons(cid, mid, dto.ids as LessonId[]);
-  }
+  ): Promise<Lesson[]> {}
 
   // ────────────────────────── Slice D — publish gate ──────────────────────────
killedBy: CoursesController PUT /courses/:cid/modules/:mid/lessons/order reorders lessons
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', [ 'l1', 'l2' ] ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:179:89
 
   @Get(':cid/publish-eligibility')
   @UseGuards(CourseOwnerGuard)
-  async getPublishEligibility(@Param('cid') cid: CourseId): Promise<PublishEligibility> {
-    return this.publishSvc.computeEligibility(cid);
-  }
+  async getPublishEligibility(@Param('cid') cid: CourseId): Promise<PublishEligibility> {}
 
   @Post(':cid/publish')
killedBy: CoursesController — slice D routes GET /publish-eligibility returns the service result
statusReason: expected undefined to be { eligible: true, reasons: [] } // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:186:69
   @Post(':cid/publish')
   @HttpCode(200)
   @UseGuards(CourseOwnerGuard)
-  async publishCourse(@Param('cid') cid: CourseId): Promise<Course> {
-    return this.publishSvc.publish(cid);
-  }
+  async publishCourse(@Param('cid') cid: CourseId): Promise<Course> {}
 
   @Post(':cid/unpublish')
killedBy: CoursesController — slice D routes POST /publish returns updated course
statusReason: expected undefined to be { id: 'c1', status: 'PUBLISHED' } // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:193:71
   @Post(':cid/unpublish')
   @HttpCode(200)
   @UseGuards(CourseOwnerGuard)
-  async unpublishCourse(@Param('cid') cid: CourseId): Promise<Course> {
-    return this.publishSvc.unpublish(cid);
-  }
+  async unpublishCourse(@Param('cid') cid: CourseId): Promise<Course> {}
 
   @Post(':cid/archive')
killedBy: CoursesController — slice D routes POST /unpublish returns updated course
statusReason: expected undefined to be { id: 'c1', status: 'DRAFT' } // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:200:69
   @Post(':cid/archive')
   @HttpCode(200)
   @UseGuards(CourseOwnerGuard)
-  async archiveCourse(@Param('cid') cid: CourseId): Promise<Course> {
-    return this.publishSvc.archive(cid);
-  }
+  async archiveCourse(@Param('cid') cid: CourseId): Promise<Course> {}
 
   @Post(':cid/restore')
killedBy: CoursesController — slice D routes POST /archive returns updated course
statusReason: expected undefined to be { id: 'c1', status: 'ARCHIVED' } // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.controller.ts:207:69
   @Post(':cid/restore')
   @HttpCode(200)
   @UseGuards(CourseOwnerGuard)
-  async restoreCourse(@Param('cid') cid: CourseId): Promise<Course> {
-    return this.publishSvc.restore(cid);
-  }
+  async restoreCourse(@Param('cid') cid: CourseId): Promise<Course> {}
 }
 
killedBy: CoursesController — slice D routes POST /restore returns updated course
statusReason: expected undefined to be { id: 'c1', status: 'DRAFT' } // Object.is equality
