[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:59:78
     private readonly materialsSvc: MaterialsService,
   ) {}
 
-  async createCourse(uid: UserId, input: CreateCourseInput): Promise<Course> {
-    const now = nowIso();
-    const course: Course = {
-      id: this.repo.newId<CourseId>(),
-      title: input.title,
-      description: input.description,
-      longDescription: input.longDescription,
-      category: input.category,
-      difficulty: input.difficulty,
-      instructorId: uid,
-      status: 'DRAFT',
-      createdAt: now,
-      updatedAt: now,
-    };
-    await this.repo.createCourse(course);
-    return course;
-  }
+  async createCourse(uid: UserId, input: CreateCourseInput): Promise<Course> {}
 
   async listCoursesForInstructor(uid: UserId): Promise<Course[]> {
killedBy: CoursesService — course operations createCourse writes a new DRAFT course with generated id and instructor ownership
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
api-courses/src/lib/courses.service.ts:61:28
 
   async createCourse(uid: UserId, input: CreateCourseInput): Promise<Course> {
     const now = nowIso();
-    const course: Course = {
-      id: this.repo.newId<CourseId>(),
-      title: input.title,
-      description: input.description,
-      longDescription: input.longDescription,
-      category: input.category,
-      difficulty: input.difficulty,
-      instructorId: uid,
-      status: 'DRAFT',
-      createdAt: now,
-      updatedAt: now,
-    };
+    const course: Course = {};
     await this.repo.createCourse(course);
     return course;
killedBy: CoursesService — course operations createCourse writes a new DRAFT course with generated id and instructor ownership
statusReason: expected undefined to be 'id-1' // Object.is equality

[Killed] StringLiteral
api-courses/src/lib/courses.service.ts:69:15
       category: input.category,
       difficulty: input.difficulty,
       instructorId: uid,
-      status: 'DRAFT',
+      status: "",
       createdAt: now,
       updatedAt: now,
killedBy: CoursesService — course operations createCourse writes a new DRAFT course with generated id and instructor ownership
statusReason: expected '' to be 'DRAFT' // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:77:66
     return course;
   }
 
-  async listCoursesForInstructor(uid: UserId): Promise<Course[]> {
-    return this.repo.listCoursesByInstructor(uid);
-  }
+  async listCoursesForInstructor(uid: UserId): Promise<Course[]> {}
 
   async getCourseTree(cid: CourseId): Promise<CourseTree> {
killedBy: CoursesService — course operations listCoursesForInstructor delegates to the repository
statusReason: expected undefined to deeply equal [ …(2) ]

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:81:59
     return this.repo.listCoursesByInstructor(uid);
   }
 
-  async getCourseTree(cid: CourseId): Promise<CourseTree> {
-    const course = await this.repo.getCourse(cid);
-    if (!course) throw new CourseNotFoundException();
-
-    const modules = await this.repo.listModulesByCourse(cid);
-    const childModules = await Promise.all(
-      modules.map(async (m) => ({
-        module: m,
-        lessons: await this.repo.listLessonsByModule(cid, m.id),
-      })),
-    );
-    return { course, modules: childModules };
-  }
+  async getCourseTree(cid: CourseId): Promise<CourseTree> {}
 
   async updateCourse(cid: CourseId, patch: UpdateCourseInput): Promise<void> {
killedBy: CoursesService — course operations getCourseTree returns hydrated course + modules + lessons
statusReason: Cannot read properties of undefined (reading 'course')

[Killed] BooleanLiteral
api-courses/src/lib/courses.service.ts:83:9
 
   async getCourseTree(cid: CourseId): Promise<CourseTree> {
     const course = await this.repo.getCourse(cid);
-    if (!course) throw new CourseNotFoundException();
+    if (course) throw new CourseNotFoundException();
 
     const modules = await this.repo.listModulesByCourse(cid);
killedBy: CoursesService — course operations getCourseTree returns hydrated course + modules + lessons
statusReason: Course not found.

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:87:19
 
     const modules = await this.repo.listModulesByCourse(cid);
     const childModules = await Promise.all(
-      modules.map(async (m) => ({
-        module: m,
-        lessons: await this.repo.listLessonsByModule(cid, m.id),
-      })),
+      modules.map(() => undefined),
     );
     return { course, modules: childModules };
killedBy: CoursesService — course operations getCourseTree returns hydrated course + modules + lessons
statusReason: expected [ undefined, undefined ] to deeply equal [ { module: { …(6) }, …(1) }, …(1) ]

[Killed] ObjectLiteral
api-courses/src/lib/courses.service.ts:87:33
 
     const modules = await this.repo.listModulesByCourse(cid);
     const childModules = await Promise.all(
-      modules.map(async (m) => ({
-        module: m,
-        lessons: await this.repo.listLessonsByModule(cid, m.id),
-      })),
+      modules.map(async (m) => ({})),
     );
     return { course, modules: childModules };
killedBy: CoursesService — course operations getCourseTree returns hydrated course + modules + lessons
statusReason: expected [ {}, {} ] to deeply equal [ { module: { …(6) }, …(1) }, …(1) ]

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:95:78
     return { course, modules: childModules };
   }
 
-  async updateCourse(cid: CourseId, patch: UpdateCourseInput): Promise<void> {
-    await this.repo.updateCourse(cid, patch);
-  }
+  async updateCourse(cid: CourseId, patch: UpdateCourseInput): Promise<void> {}
 
   async deleteCourse(cid: CourseId): Promise<void> {
killedBy: CoursesService — course operations updateCourse forwards the patch to the repository unchanged
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', { title: 'New' } ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:99:52
     await this.repo.updateCourse(cid, patch);
   }
 
-  async deleteCourse(cid: CourseId): Promise<void> {
-    await this.repo.deleteCourseRecursive(cid);
-  }
+  async deleteCourse(cid: CourseId): Promise<void> {}
 
   // ────────────────────────── Module ──────────────────────────
killedBy: CoursesService — course operations deleteCourse invokes recursive delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:105:80
 
   // ────────────────────────── Module ──────────────────────────
 
-  async createModule(cid: CourseId, input: { title: string }): Promise<Module> {
-    const id = this.repo.newId<ModuleId>();
-    return this.repo.appendModule(cid, {
-      id,
-      courseId: cid,
-      title: input.title,
-    });
-  }
+  async createModule(cid: CourseId, input: { title: string }): Promise<Module> {}
 
   async updateModule(
killedBy: CoursesService — module operations createModule appends a new module with a generated id
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
api-courses/src/lib/courses.service.ts:107:40
 
   async createModule(cid: CourseId, input: { title: string }): Promise<Module> {
     const id = this.repo.newId<ModuleId>();
-    return this.repo.appendModule(cid, {
-      id,
-      courseId: cid,
-      title: input.title,
-    });
+    return this.repo.appendModule(cid, {});
   }
 
killedBy: CoursesService — module operations createModule appends a new module with a generated id
statusReason: expected undefined to be 'id-1' // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:118:20
     cid: CourseId,
     mid: ModuleId,
     patch: { title?: string },
-  ): Promise<void> {
-    const existing = await this.repo.getModule(cid, mid);
-    if (!existing) throw new ModuleNotFoundException();
-    await this.repo.updateModule(cid, mid, patch);
-  }
+  ): Promise<void> {}
 
   async deleteModule(cid: CourseId, mid: ModuleId): Promise<void> {
killedBy: CoursesService — module operations updateModule forwards a rename patch
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', { title: 'New' } ]

Number of calls: 0

[Killed] BooleanLiteral
api-courses/src/lib/courses.service.ts:120:9
     patch: { title?: string },
   ): Promise<void> {
     const existing = await this.repo.getModule(cid, mid);
-    if (!existing) throw new ModuleNotFoundException();
+    if (existing) throw new ModuleNotFoundException();
     await this.repo.updateModule(cid, mid, patch);
   }
killedBy: CoursesService — module operations updateModule forwards a rename patch
statusReason: Module not found.

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:120:9
     patch: { title?: string },
   ): Promise<void> {
     const existing = await this.repo.getModule(cid, mid);
-    if (!existing) throw new ModuleNotFoundException();
+    if (false) throw new ModuleNotFoundException();
     await this.repo.updateModule(cid, mid, patch);
   }
killedBy: CoursesService — module operations updateModule throws ModuleNotFoundException when the module does not exist
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:124:67
     await this.repo.updateModule(cid, mid, patch);
   }
 
-  async deleteModule(cid: CourseId, mid: ModuleId): Promise<void> {
-    const existing = await this.repo.getModule(cid, mid);
-    if (!existing) throw new ModuleNotFoundException();
-    await this.repo.deleteModuleRecursive(cid, mid);
-  }
+  async deleteModule(cid: CourseId, mid: ModuleId): Promise<void> {}
 
   async reorderModules(cid: CourseId, ids: ModuleId[]): Promise<Module[]> {
killedBy: CoursesService — module operations deleteModule checks existence then recursive-deletes
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1' ]

Number of calls: 0

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:130:75
     await this.repo.deleteModuleRecursive(cid, mid);
   }
 
-  async reorderModules(cid: CourseId, ids: ModuleId[]): Promise<Module[]> {
-    const current = await this.repo.listModulesByCourse(cid);
-    assertReorderSetMatches(
-      current.map((m) => m.id),
-      ids,
-    );
-    await this.repo.writeModuleOrder(cid, ids);
-    return ids.map((id, index) => ({
-      ...current.find((m) => m.id === id)!,
-      order: index,
-    }));
-  }
+  async reorderModules(cid: CourseId, ids: ModuleId[]): Promise<Module[]> {}
 
   // ────────────────────────── Lesson ──────────────────────────
killedBy: CoursesService — module operations reorderModules writes the new order when ids match current children exactly
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', [ 'c', 'a', 'b' ] ]

Number of calls: 0

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:133:19
   async reorderModules(cid: CourseId, ids: ModuleId[]): Promise<Module[]> {
     const current = await this.repo.listModulesByCourse(cid);
     assertReorderSetMatches(
-      current.map((m) => m.id),
+      current.map(() => undefined),
       ids,
     );
killedBy: CoursesService — module operations reorderModules writes the new order when ids match current children exactly
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:137:20
       ids,
     );
     await this.repo.writeModuleOrder(cid, ids);
-    return ids.map((id, index) => ({
-      ...current.find((m) => m.id === id)!,
-      order: index,
-    }));
+    return ids.map(() => undefined);
   }
 
killedBy: CoursesService — module operations reorderModules places modules in the requested order by id, preserving each doc's other fields
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
api-courses/src/lib/courses.service.ts:138:30
     );
     await this.repo.writeModuleOrder(cid, ids);
     return ids.map((id, index) => ({
-      ...current.find((m) => m.id === id)!,
+      ...current.find((m) => m.id !== id)!,
       order: index,
     }));
killedBy: CoursesService — module operations reorderModules places modules in the requested order by id, preserving each doc's other fields
statusReason: expected 'mid-1' to be 'mid-3' // Object.is equality

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:138:30
     );
     await this.repo.writeModuleOrder(cid, ids);
     return ids.map((id, index) => ({
-      ...current.find((m) => m.id === id)!,
+      ...current.find((m) => true)!,
       order: index,
     }));
killedBy: CoursesService — module operations reorderModules places modules in the requested order by id, preserving each doc's other fields
statusReason: expected 'mid-1' to be 'mid-3' // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:149:22
     cid: CourseId,
     mid: ModuleId,
     input: { title: string; description?: string },
-  ): Promise<Lesson> {
-    const parent = await this.repo.getModule(cid, mid);
-    if (!parent) throw new ModuleNotFoundException();
-    const id = this.repo.newId<LessonId>();
-    return this.repo.appendLesson(cid, mid, {
-      id,
-      moduleId: mid,
-      title: input.title,
-      ...(input.description !== undefined ? { description: input.description } : {}),
-    });
-  }
+  ): Promise<Lesson> {}
 
   async updateLesson(
killedBy: CoursesService — lesson operations createLesson requires the module to exist
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
api-courses/src/lib/courses.service.ts:151:9
     input: { title: string; description?: string },
   ): Promise<Lesson> {
     const parent = await this.repo.getModule(cid, mid);
-    if (!parent) throw new ModuleNotFoundException();
+    if (parent) throw new ModuleNotFoundException();
     const id = this.repo.newId<LessonId>();
     return this.repo.appendLesson(cid, mid, {
killedBy: CoursesService — lesson operations createLesson requires the module to exist
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:151:9
     input: { title: string; description?: string },
   ): Promise<Lesson> {
     const parent = await this.repo.getModule(cid, mid);
-    if (!parent) throw new ModuleNotFoundException();
+    if (true) throw new ModuleNotFoundException();
     const id = this.repo.newId<LessonId>();
     return this.repo.appendLesson(cid, mid, {
killedBy: CoursesService — lesson operations createLesson appends a new lesson with a generated id
statusReason: Module not found.

[Killed] EqualityOperator
api-courses/src/lib/courses.service.ts:157:11
       id,
       moduleId: mid,
       title: input.title,
-      ...(input.description !== undefined ? { description: input.description } : {}),
+      ...(input.description === undefined ? { description: input.description } : {}),
     });
   }
killedBy: CoursesService — lesson operations createLesson appends a new lesson with a generated id
statusReason: expected undefined to be 'first' // Object.is equality

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:157:11
       id,
       moduleId: mid,
       title: input.title,
-      ...(input.description !== undefined ? { description: input.description } : {}),
+      ...(true ? { description: input.description } : {}),
     });
   }
killedBy: CoursesService — lesson operations createLesson omitting description does not pass a description key to the repository
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:166:20
     mid: ModuleId,
     lid: LessonId,
     patch: { title?: string; description?: string },
-  ): Promise<void> {
-    const existing = await this.repo.getLesson(cid, mid, lid);
-    if (!existing) throw new LessonNotFoundException();
-    await this.repo.updateLesson(cid, mid, lid, patch);
-  }
+  ): Promise<void> {}
 
   async deleteLesson(cid: CourseId, mid: ModuleId, lid: LessonId): Promise<void> {
killedBy: CoursesService — lesson operations updateLesson forwards the patch when the lesson exists
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', 'lid-1', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:168:9
     patch: { title?: string; description?: string },
   ): Promise<void> {
     const existing = await this.repo.getLesson(cid, mid, lid);
-    if (!existing) throw new LessonNotFoundException();
+    if (true) throw new LessonNotFoundException();
     await this.repo.updateLesson(cid, mid, lid, patch);
   }
killedBy: CoursesService — lesson operations updateLesson forwards the patch when the lesson exists
statusReason: Lesson not found.

[Killed] BooleanLiteral
api-courses/src/lib/courses.service.ts:168:9
     patch: { title?: string; description?: string },
   ): Promise<void> {
     const existing = await this.repo.getLesson(cid, mid, lid);
-    if (!existing) throw new LessonNotFoundException();
+    if (existing) throw new LessonNotFoundException();
     await this.repo.updateLesson(cid, mid, lid, patch);
   }
killedBy: CoursesService — lesson operations updateLesson forwards the patch when the lesson exists
statusReason: Lesson not found.

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:172:82
     await this.repo.updateLesson(cid, mid, lid, patch);
   }
 
-  async deleteLesson(cid: CourseId, mid: ModuleId, lid: LessonId): Promise<void> {
-    const existing = await this.repo.getLesson(cid, mid, lid);
-    if (!existing) throw new LessonNotFoundException();
-    await this.videoSvc.deleteForLesson(lid);
-    await this.materialsSvc.deleteForLesson(lid);
-    await this.repo.deleteLesson(cid, mid, lid);
-  }
+  async deleteLesson(cid: CourseId, mid: ModuleId, lid: LessonId): Promise<void> {}
 
   async reorderLessons(
killedBy: CoursesService — lesson operations deleteLesson throws LessonNotFoundException when the lesson is missing
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:184:24
     cid: CourseId,
     mid: ModuleId,
     ids: LessonId[],
-  ): Promise<Lesson[]> {
-    const parent = await this.repo.getModule(cid, mid);
-    if (!parent) throw new ModuleNotFoundException();
-    const current = await this.repo.listLessonsByModule(cid, mid);
-    assertReorderSetMatches(
-      current.map((l) => l.id),
-      ids,
-    );
-    await this.repo.writeLessonOrder(cid, mid, ids);
-    return ids.map((id, index) => ({
-      ...current.find((l) => l.id === id)!,
-      order: index,
-    }));
-  }
+  ): Promise<Lesson[]> {}
 }
 
killedBy: CoursesService — lesson operations reorderLessons writes the new order when ids match current children exactly
statusReason: expected "vi.fn()" to be called with arguments: [ 'cid-1', 'mid-1', [ 'b', 'a' ] ]

Number of calls: 0

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:186:9
     ids: LessonId[],
   ): Promise<Lesson[]> {
     const parent = await this.repo.getModule(cid, mid);
-    if (!parent) throw new ModuleNotFoundException();
+    if (false) throw new ModuleNotFoundException();
     const current = await this.repo.listLessonsByModule(cid, mid);
     assertReorderSetMatches(
killedBy: CoursesService — lesson operations reorderLessons requires the parent module to exist
statusReason: expected CoursesException: Reorder body does not m… { …(3) } to be an instance of ModuleNotFoundException

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:189:19
     if (!parent) throw new ModuleNotFoundException();
     const current = await this.repo.listLessonsByModule(cid, mid);
     assertReorderSetMatches(
-      current.map((l) => l.id),
+      current.map(() => undefined),
       ids,
     );
killedBy: CoursesService — lesson operations reorderLessons writes the new order when ids match current children exactly
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] ArrowFunction
api-courses/src/lib/courses.service.ts:193:20
       ids,
     );
     await this.repo.writeLessonOrder(cid, mid, ids);
-    return ids.map((id, index) => ({
-      ...current.find((l) => l.id === id)!,
-      order: index,
-    }));
+    return ids.map(() => undefined);
   }
 }
killedBy: CoursesService — lesson operations reorderLessons places lessons in the requested order by id, preserving each doc's other fields
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:194:30
     );
     await this.repo.writeLessonOrder(cid, mid, ids);
     return ids.map((id, index) => ({
-      ...current.find((l) => l.id === id)!,
+      ...current.find((l) => true)!,
       order: index,
     }));
killedBy: CoursesService — lesson operations reorderLessons places lessons in the requested order by id, preserving each doc's other fields
statusReason: expected 'lid-1' to be 'lid-3' // Object.is equality

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:194:30
     );
     await this.repo.writeLessonOrder(cid, mid, ids);
     return ids.map((id, index) => ({
-      ...current.find((l) => l.id === id)!,
+      ...current.find((l) => false)!,
       order: index,
     }));
killedBy: CoursesService — lesson operations reorderLessons places lessons in the requested order by id, preserving each doc's other fields
statusReason: expected undefined to be 'lid-3' // Object.is equality

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:200:85
   }
 }
 
-function assertReorderSetMatches(currentIds: string[], proposedIds: string[]): void {
-  if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
-  const current = new Set(currentIds);
-  const proposed = new Set(proposedIds);
-  if (current.size !== proposed.size) throw new StaleReorderException();
-  for (const id of proposed) {
-    if (!current.has(id)) throw new StaleReorderException();
-  }
-}
+function assertReorderSetMatches(currentIds: string[], proposedIds: string[]): void {}
 
killedBy: CoursesService — module operations reorderModules throws StaleReorderException when proposed list is shorter than current
statusReason: promise resolved "[ { id: 'a', …(5) }, { id: 'b', …(5) } ]" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:201:7
 }
 
 function assertReorderSetMatches(currentIds: string[], proposedIds: string[]): void {
-  if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
+  if (true) throw new StaleReorderException();
   const current = new Set(currentIds);
   const proposed = new Set(proposedIds);
killedBy: CoursesService — module operations reorderModules writes the new order when ids match current children exactly
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] EqualityOperator
api-courses/src/lib/courses.service.ts:201:7
 }
 
 function assertReorderSetMatches(currentIds: string[], proposedIds: string[]): void {
-  if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
+  if (currentIds.length === proposedIds.length) throw new StaleReorderException();
   const current = new Set(currentIds);
   const proposed = new Set(proposedIds);
killedBy: CoursesService — module operations reorderModules writes the new order when ids match current children exactly
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:204:7
   if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
   const current = new Set(currentIds);
   const proposed = new Set(proposedIds);
-  if (current.size !== proposed.size) throw new StaleReorderException();
+  if (false) throw new StaleReorderException();
   for (const id of proposed) {
     if (!current.has(id)) throw new StaleReorderException();
killedBy: CoursesService — module operations reorderModules throws StaleReorderException when ids contain duplicates
statusReason: promise resolved "[ { id: 'a', …(5) }, { id: 'a', …(5) } ]" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:204:7
   if (currentIds.length !== proposedIds.length) throw new StaleReorderException();
   const current = new Set(currentIds);
   const proposed = new Set(proposedIds);
-  if (current.size !== proposed.size) throw new StaleReorderException();
+  if (true) throw new StaleReorderException();
   for (const id of proposed) {
     if (!current.has(id)) throw new StaleReorderException();
killedBy: CoursesService — module operations reorderModules writes the new order when ids match current children exactly
statusReason: Reorder body does not match current children — refetch and retry.

[Killed] BlockStatement
api-courses/src/lib/courses.service.ts:205:30
   const current = new Set(currentIds);
   const proposed = new Set(proposedIds);
   if (current.size !== proposed.size) throw new StaleReorderException();
-  for (const id of proposed) {
-    if (!current.has(id)) throw new StaleReorderException();
-  }
+  for (const id of proposed) {}
 }
 
killedBy: CoursesService — module operations reorderModules throws StaleReorderException when proposed list contains an id not in current (same length)
statusReason: promise resolved "[ { id: 'a', …(5) }, …(2) ]" instead of rejecting

[Killed] ConditionalExpression
api-courses/src/lib/courses.service.ts:206:9
   const proposed = new Set(proposedIds);
   if (current.size !== proposed.size) throw new StaleReorderException();
   for (const id of proposed) {
-    if (!current.has(id)) throw new StaleReorderException();
+    if (false) throw new StaleReorderException();
   }
 }
killedBy: CoursesService — module operations reorderModules throws StaleReorderException when proposed list contains an id not in current (same length)
statusReason: promise resolved "[ { id: 'a', …(5) }, …(2) ]" instead of rejecting

[Killed] BooleanLiteral
api-courses/src/lib/courses.service.ts:206:9
   const proposed = new Set(proposedIds);
   if (current.size !== proposed.size) throw new StaleReorderException();
   for (const id of proposed) {
-    if (!current.has(id)) throw new StaleReorderException();
+    if (current.has(id)) throw new StaleReorderException();
   }
 }
killedBy: CoursesService — module operations reorderModules writes the new order when ids match current children exactly
statusReason: Reorder body does not match current children — refetch and retry.
