[Killed] BlockStatement
src/lib/errors/courses.exception.ts:17:17
 }
 
 export class NotCourseOwnerException extends CoursesException {
-  constructor() {
-    super('NOT_COURSE_OWNER', 'You do not own this course.', 403);
-  }
+  constructor() {}
 }
 
killedBy: CourseOwnerGuard throws NotCourseOwnerException when another user owns the course
statusReason: expected ReferenceError: Must call super construct… to be an instance of NotCourseOwnerException

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:18:11
 
 export class NotCourseOwnerException extends CoursesException {
   constructor() {
-    super('NOT_COURSE_OWNER', 'You do not own this course.', 403);
+    super("", 'You do not own this course.', 403);
   }
 }
killedBy: CoursesException family NotCourseOwnerException is 403 with code NOT_COURSE_OWNER
statusReason: expected '' to be 'NOT_COURSE_OWNER' // Object.is equality

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:18:31
 
 export class NotCourseOwnerException extends CoursesException {
   constructor() {
-    super('NOT_COURSE_OWNER', 'You do not own this course.', 403);
+    super('NOT_COURSE_OWNER', "", 403);
   }
 }
killedBy: CoursesException family NotCourseOwnerException is 403 with code NOT_COURSE_OWNER
statusReason: expected '' to be 'You do not own this course.' // Object.is equality

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:23:17
 }
 
 export class CourseNotFoundException extends CoursesException {
-  constructor() {
-    super('COURSE_NOT_FOUND', 'Course not found.', 404);
-  }
+  constructor() {}
 }
 
killedBy: CoursesService — course operations getCourseTree throws CourseNotFoundException when the course is missing
statusReason: expected ReferenceError: Must call super construct… to be an instance of CourseNotFoundException

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:24:11
 
 export class CourseNotFoundException extends CoursesException {
   constructor() {
-    super('COURSE_NOT_FOUND', 'Course not found.', 404);
+    super("", 'Course not found.', 404);
   }
 }
killedBy: CoursesException family CourseNotFoundException is 404 with code COURSE_NOT_FOUND
statusReason: expected '' to be 'COURSE_NOT_FOUND' // Object.is equality

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:29:17
 }
 
 export class ModuleNotFoundException extends CoursesException {
-  constructor() {
-    super('MODULE_NOT_FOUND', 'Module not found.', 404);
-  }
+  constructor() {}
 }
 
killedBy: CoursesService — module operations updateModule throws ModuleNotFoundException when the module does not exist
statusReason: expected ReferenceError: Must call super construct… to be an instance of ModuleNotFoundException

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:35:17
 }
 
 export class LessonNotFoundException extends CoursesException {
-  constructor() {
-    super('LESSON_NOT_FOUND', 'Lesson not found.', 404);
-  }
+  constructor() {}
 }
 
killedBy: CoursesException family LessonNotFoundException is 404 with code LESSON_NOT_FOUND
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:36:11
 
 export class LessonNotFoundException extends CoursesException {
   constructor() {
-    super('LESSON_NOT_FOUND', 'Lesson not found.', 404);
+    super("", 'Lesson not found.', 404);
   }
 }
killedBy: CoursesException family LessonNotFoundException is 404 with code LESSON_NOT_FOUND
statusReason: expected '' to be 'LESSON_NOT_FOUND' // Object.is equality

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:41:17
 }
 
 export class StaleReorderException extends CoursesException {
-  constructor() {
-    super(
-      'STALE_REORDER',
-      'Reorder body does not match current children — refetch and retry.',
-      409,
-    );
-  }
+  constructor() {}
 }
 
killedBy: CoursesException family StaleReorderException is 409 with code STALE_REORDER
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:43:7
 export class StaleReorderException extends CoursesException {
   constructor() {
     super(
-      'STALE_REORDER',
+      "",
       'Reorder body does not match current children — refetch and retry.',
       409,
killedBy: CoursesException family StaleReorderException is 409 with code STALE_REORDER
statusReason: expected '' to be 'STALE_REORDER' // Object.is equality

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:51:68
 }
 
 export class InvalidTransitionException extends CoursesException {
-  constructor(currentState: CourseStatus, requested: CourseStatus) {
-    super(
-      'INVALID_TRANSITION',
-      `Cannot transition from ${currentState} to ${requested}.`,
-      409,
-      { currentState, requested },
-    );
-  }
+  constructor(currentState: CourseStatus, requested: CourseStatus) {}
 }
 
killedBy: slice D exceptions InvalidTransitionException carries currentState + requested as details and is HTTP 409
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:53:7
 export class InvalidTransitionException extends CoursesException {
   constructor(currentState: CourseStatus, requested: CourseStatus) {
     super(
-      'INVALID_TRANSITION',
+      "",
       `Cannot transition from ${currentState} to ${requested}.`,
       409,
killedBy: slice D exceptions InvalidTransitionException carries currentState + requested as details and is HTTP 409
statusReason: expected '' to be 'INVALID_TRANSITION' // Object.is equality

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:62:46
 }
 
 export class PublishNotEligibleException extends CoursesException {
-  constructor(reasons: PublishBlockReason[]) {
-    super(
-      'PUBLISH_NOT_ELIGIBLE',
-      'Course does not meet publish requirements.',
-      409,
-      { reasons },
-    );
-  }
+  constructor(reasons: PublishBlockReason[]) {}
 }
 
killedBy: slice D exceptions PublishNotEligibleException carries reasons[] as details and is HTTP 409
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:64:7
 export class PublishNotEligibleException extends CoursesException {
   constructor(reasons: PublishBlockReason[]) {
     super(
-      'PUBLISH_NOT_ELIGIBLE',
+      "",
       'Course does not meet publish requirements.',
       409,
killedBy: slice D exceptions PublishNotEligibleException carries reasons[] as details and is HTTP 409
statusReason: expected '' to be 'PUBLISH_NOT_ELIGIBLE' // Object.is equality

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:65:7
   constructor(reasons: PublishBlockReason[]) {
     super(
       'PUBLISH_NOT_ELIGIBLE',
-      'Course does not meet publish requirements.',
+      "",
       409,
       { reasons },
killedBy: slice D exceptions PublishNotEligibleException carries reasons[] as details and is HTTP 409
statusReason: expected '' to be 'Course does not meet publish requirem…' // Object.is equality

[Killed] ObjectLiteral
src/lib/errors/courses.exception.ts:67:7
       'PUBLISH_NOT_ELIGIBLE',
       'Course does not meet publish requirements.',
       409,
-      { reasons },
+      {},
     );
   }
killedBy: PublishService.publish throws PublishNotEligibleException with reasons when revalidation fails
statusReason: expected CoursesException: Course does not meet pu… { …(3) } to match object { code: 'PUBLISH_NOT_ELIGIBLE', …(1) }
(2 matching properties omitted from actual)

[Killed] BlockStatement
src/lib/errors/courses.exception.ts:73:17
 }
 
 export class CourseArchivedException extends CoursesException {
-  constructor() {
-    super('COURSE_ARCHIVED', 'Cannot check publish eligibility on an archived course.', 409);
-  }
+  constructor() {}
 }
 
killedBy: slice D exceptions CourseArchivedException is HTTP 409 with code COURSE_ARCHIVED
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
src/lib/errors/courses.exception.ts:74:11
 
 export class CourseArchivedException extends CoursesException {
   constructor() {
-    super('COURSE_ARCHIVED', 'Cannot check publish eligibility on an archived course.', 409);
+    super("", 'Cannot check publish eligibility on an archived course.', 409);
   }
 }
killedBy: slice D exceptions CourseArchivedException is HTTP 409 with code COURSE_ARCHIVED
statusReason: expected '' to be 'COURSE_ARCHIVED' // Object.is equality
