[Killed] BlockStatement
lib/materials/errors/material.exception.ts:16:17
 }
 
 export class UnsupportedMaterialTypeException extends MaterialException {
-  constructor() {
-    super(
-      'UNSUPPORTED_MATERIAL_TYPE',
-      'Unsupported file type. Supported formats: PDF, DOCX, PPTX, XLSX, TXT, ZIP.',
-      400,
-    );
-  }
+  constructor() {}
 }
 
killedBy: MaterialsService.createUploadUrl rejects an unsupported extension
statusReason: expected [Function] to throw error matching /Unsupported file type/ but got 'Must call super constructor in derive…'

[Killed] BlockStatement
lib/materials/errors/material.exception.ts:26:17
 }
 
 export class MaterialNotFoundException extends MaterialException {
-  constructor() {
-    super('MATERIAL_NOT_FOUND', 'Material not found.', 404);
-  }
+  constructor() {}
 }
 
killedBy: material exceptions MaterialNotFoundException maps to 404 MATERIAL_NOT_FOUND
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
lib/materials/errors/material.exception.ts:27:11
 
 export class MaterialNotFoundException extends MaterialException {
   constructor() {
-    super('MATERIAL_NOT_FOUND', 'Material not found.', 404);
+    super("", 'Material not found.', 404);
   }
 }
killedBy: material exceptions MaterialNotFoundException maps to 404 MATERIAL_NOT_FOUND
statusReason: expected '' to be 'MATERIAL_NOT_FOUND' // Object.is equality

[Killed] BlockStatement
lib/materials/errors/material.exception.ts:32:17
 }
 
 export class NotMaterialOwnerException extends MaterialException {
-  constructor() {
-    super('NOT_MATERIAL_OWNER', 'You do not have access to this material.', 403);
-  }
+  constructor() {}
 }
 
killedBy: material exceptions NotMaterialOwnerException maps to 403 NOT_MATERIAL_OWNER
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
lib/materials/errors/material.exception.ts:33:33
 
 export class NotMaterialOwnerException extends MaterialException {
   constructor() {
-    super('NOT_MATERIAL_OWNER', 'You do not have access to this material.', 403);
+    super('NOT_MATERIAL_OWNER', "", 403);
   }
 }
killedBy: MaterialAccessGuard throws NOT_MATERIAL_OWNER for a non-owner (enrolled-student access is EP-06)
statusReason: expected [Function] to throw error matching /access/i but got ''

[Killed] BlockStatement
lib/materials/errors/material.exception.ts:38:37
 }
 
 export class InvalidMaterialStateException extends MaterialException {
-  constructor(currentState: string) {
-    super(
-      'INVALID_MATERIAL_STATE',
-      `Operation is not valid in state ${currentState}.`,
-      409,
-      { currentState },
-    );
-  }
+  constructor(currentState: string) {}
 }
 
killedBy: material exceptions InvalidMaterialStateException carries the current state in details
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
lib/materials/errors/material.exception.ts:49:17
 }
 
 export class UploadObjectMissingException extends MaterialException {
-  constructor() {
-    super(
-      'UPLOAD_OBJECT_MISSING',
-      'No uploaded object exists at the upload destination.',
-      422,
-    );
-  }
+  constructor() {}
 }
 
killedBy: material exceptions UploadObjectMissingException maps to 422
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
lib/materials/errors/material.exception.ts:59:17
 }
 
 export class UploadObjectSizeMismatchException extends MaterialException {
-  constructor() {
-    super(
-      'UPLOAD_OBJECT_SIZE_MISMATCH',
-      'Uploaded object size exceeds the allowed limit.',
-      422,
-    );
-  }
+  constructor() {}
 }
 
killedBy: material exceptions UploadObjectSizeMismatchException maps to 422
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor
