[Killed] BlockStatement
src/lib/materials/material-access.guard.ts:20:62
 export class MaterialAccessGuard implements CanActivate {
   constructor(private readonly repo: MaterialsRepository) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<MaterialScopedRequest>();
-    const matId = req.params?.['matId'] as MaterialId | undefined;
-    if (!matId) throw new MaterialNotFoundException();
-
-    const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
-
-    if (material.ownerInstructorId === req.user?.uid) {
-      req.material = material;
-      return true;
-    }
-
-    // TODO(EP-06): enrolled-student download. Wire an EnrollmentRepository here:
-    //   if (await this.enrollment.isEnrolled(req.user.uid, material.courseId)) {
-    //     req.material = material;
-    //     return true;
-    //   }
-
-    throw new NotMaterialOwnerException();
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: MaterialAccessGuard passes for the course owner
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/material-access.guard.ts:23:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<MaterialScopedRequest>();
     const matId = req.params?.['matId'] as MaterialId | undefined;
-    if (!matId) throw new MaterialNotFoundException();
+    if (false) throw new MaterialNotFoundException();
 
     const material = await this.repo.get(matId);
killedBy: MaterialAccessGuard throws MATERIAL_NOT_FOUND when the matId param is missing
statusReason: expected [Function] to throw error matching /not found/i but got 'You do not have access to this materi…'

[Killed] BooleanLiteral
src/lib/materials/material-access.guard.ts:23:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<MaterialScopedRequest>();
     const matId = req.params?.['matId'] as MaterialId | undefined;
-    if (!matId) throw new MaterialNotFoundException();
+    if (matId) throw new MaterialNotFoundException();
 
     const material = await this.repo.get(matId);
killedBy: MaterialAccessGuard passes for the course owner
statusReason: Material not found.

[Killed] ConditionalExpression
src/lib/materials/material-access.guard.ts:26:9
     if (!matId) throw new MaterialNotFoundException();
 
     const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
+    if (false) throw new MaterialNotFoundException();
 
     if (material.ownerInstructorId === req.user?.uid) {
killedBy: MaterialAccessGuard throws MATERIAL_NOT_FOUND when the material does not exist
statusReason: expected [Function] to throw error matching /not found/i but got 'Cannot read properties of null (readi…'

[Killed] BooleanLiteral
src/lib/materials/material-access.guard.ts:26:9
     if (!matId) throw new MaterialNotFoundException();
 
     const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
+    if (material) throw new MaterialNotFoundException();
 
     if (material.ownerInstructorId === req.user?.uid) {
killedBy: MaterialAccessGuard passes for the course owner
statusReason: Material not found.

[Killed] OptionalChaining
src/lib/materials/material-access.guard.ts:28:40
     const material = await this.repo.get(matId);
     if (!material) throw new MaterialNotFoundException();
 
-    if (material.ownerInstructorId === req.user?.uid) {
+    if (material.ownerInstructorId === req.user.uid) {
       req.material = material;
       return true;
killedBy: MaterialAccessGuard throws NOT_MATERIAL_OWNER when req.user is undefined (unauthenticated request)
statusReason: expected [Function] to throw error matching /access/i but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/lib/materials/material-access.guard.ts:28:9
     const material = await this.repo.get(matId);
     if (!material) throw new MaterialNotFoundException();
 
-    if (material.ownerInstructorId === req.user?.uid) {
+    if (material.ownerInstructorId !== req.user?.uid) {
       req.material = material;
       return true;
killedBy: MaterialAccessGuard passes for the course owner
statusReason: You do not have access to this material.

[Killed] BooleanLiteral
src/lib/materials/material-access.guard.ts:30:14
 
     if (material.ownerInstructorId === req.user?.uid) {
       req.material = material;
-      return true;
+      return false;
     }
 
killedBy: MaterialAccessGuard passes for the course owner
statusReason: expected false to be true // Object.is equality
