[Killed] BlockStatement
src/lib/materials/material-owner.guard.ts:16:62
 export class MaterialOwnerGuard implements CanActivate {
   constructor(private readonly repo: MaterialsRepository) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<MaterialScopedRequest>();
-    const matId = req.params?.['matId'] as MaterialId | undefined;
-    if (!matId) throw new MaterialNotFoundException();
-
-    const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
-    if (material.ownerInstructorId !== req.user?.uid) {
-      throw new NotMaterialOwnerException();
-    }
-    req.material = material;
-    return true;
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: MaterialOwnerGuard passes and attaches the material when the requester owns it
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/material-owner.guard.ts:19:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<MaterialScopedRequest>();
     const matId = req.params?.['matId'] as MaterialId | undefined;
-    if (!matId) throw new MaterialNotFoundException();
+    if (true) throw new MaterialNotFoundException();
 
     const material = await this.repo.get(matId);
killedBy: MaterialOwnerGuard passes and attaches the material when the requester owns it
statusReason: Material not found.

[Killed] ConditionalExpression
src/lib/materials/material-owner.guard.ts:22:9
     if (!matId) throw new MaterialNotFoundException();
 
     const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
+    if (true) throw new MaterialNotFoundException();
     if (material.ownerInstructorId !== req.user?.uid) {
       throw new NotMaterialOwnerException();
killedBy: MaterialOwnerGuard passes and attaches the material when the requester owns it
statusReason: Material not found.

[Killed] EqualityOperator
src/lib/materials/material-owner.guard.ts:23:9
 
     const material = await this.repo.get(matId);
     if (!material) throw new MaterialNotFoundException();
-    if (material.ownerInstructorId !== req.user?.uid) {
+    if (material.ownerInstructorId === req.user?.uid) {
       throw new NotMaterialOwnerException();
     }
killedBy: MaterialOwnerGuard passes and attaches the material when the requester owns it
statusReason: You do not have access to this material.

[Killed] ConditionalExpression
src/lib/materials/material-owner.guard.ts:23:9
 
     const material = await this.repo.get(matId);
     if (!material) throw new MaterialNotFoundException();
-    if (material.ownerInstructorId !== req.user?.uid) {
+    if (true) {
       throw new NotMaterialOwnerException();
     }
killedBy: MaterialOwnerGuard passes and attaches the material when the requester owns it
statusReason: You do not have access to this material.
