[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:41:49
 }
 
 /** Strip characters that would break an HTTP Content-Disposition header value. */
-function sanitizeFilename(name: string): string {
-  // eslint-disable-next-line no-control-regex
-  return name.replace(/["\\\r\n]/g, '_');
-}
+function sanitizeFilename(name: string): string {}
 
 @Injectable()
killedBy: MaterialsStorageAdapter — real mode signDownloadUrl requests a read URL with attachment disposition
statusReason: expected 'attachment; filename="undefined"' to contain 'doc.pdf'

[Killed] Regex
src/lib/materials/materials-storage.adapter.ts:43:23
 /** Strip characters that would break an HTTP Content-Disposition header value. */
 function sanitizeFilename(name: string): string {
   // eslint-disable-next-line no-control-regex
-  return name.replace(/["\\\r\n]/g, '_');
+  return name.replace(/[^"\\\r\n]/g, '_');
 }
 
killedBy: MaterialsStorageAdapter — real mode signDownloadUrl requests a read URL with attachment disposition
statusReason: expected 'attachment; filename="_______"' to contain 'doc.pdf'

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:58:32
     path: string;
     contentType: string;
     materialId: string;
-  }): Promise<SignedUploadUrl> {
-    const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
-      return {
-        uploadUrl: `/api/internal/fake-materials/${input.materialId}`,
-        expiresAt: new Date(expiresMs).toISOString(),
-      };
-    }
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    const [url] = await file.getSignedUrl({
-      version: 'v4',
-      action: 'write',
-      contentType: input.contentType,
-      expires: expiresMs,
-    });
-    return { uploadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
-  }
+  }): Promise<SignedUploadUrl> {}
 
   async headObject(input: {
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: Cannot read properties of undefined (reading 'uploadUrl')

[Killed] ArithmeticOperator
src/lib/materials/materials-storage.adapter.ts:59:23
     contentType: string;
     materialId: string;
   }): Promise<SignedUploadUrl> {
-    const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
+    const expiresMs = Date.now() - this.cfg.uploadUrlTtlSec * 1000;
     if (this.cfg.storageImpl === 'fake') {
       return {
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: expected 1779418308259 to be greater than 1779420008259

[Killed] ArithmeticOperator
src/lib/materials/materials-storage.adapter.ts:59:36
     contentType: string;
     materialId: string;
   }): Promise<SignedUploadUrl> {
-    const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
+    const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec / 1000;
     if (this.cfg.storageImpl === 'fake') {
       return {
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: expected 1779419208286 to be greater than 1779420008286

[Killed] EqualityOperator
src/lib/materials/materials-storage.adapter.ts:60:9
     materialId: string;
   }): Promise<SignedUploadUrl> {
     const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
+    if (this.cfg.storageImpl !== 'fake') {
       return {
         uploadUrl: `/api/internal/fake-materials/${input.materialId}`,
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: file.getSignedUrl is not a function

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:60:42
     materialId: string;
   }): Promise<SignedUploadUrl> {
     const expiresMs = Date.now() + this.cfg.uploadUrlTtlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
-      return {
-        uploadUrl: `/api/internal/fake-materials/${input.materialId}`,
-        expiresAt: new Date(expiresMs).toISOString(),
-      };
-    }
+    if (this.cfg.storageImpl === 'fake') {}
     const file = this.storage.bucket(input.bucket).file(input.path);
     const [url] = await file.getSignedUrl({
killedBy: MaterialsStorageAdapter — fake mode signUploadUrl returns an internal passthrough URL with a future expiresAt
statusReason: file.getSignedUrl is not a function

[Killed] StringLiteral
src/lib/materials/materials-storage.adapter.ts:69:15
     const file = this.storage.bucket(input.bucket).file(input.path);
     const [url] = await file.getSignedUrl({
       version: 'v4',
-      action: 'write',
+      action: "",
       contentType: input.contentType,
       expires: expiresMs,
killedBy: MaterialsStorageAdapter — real mode signUploadUrl asks Cloud Storage for a v4 write URL bound to the content-type
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/lib/materials/materials-storage.adapter.ts:73:12
       contentType: input.contentType,
       expires: expiresMs,
     });
-    return { uploadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
+    return {};
   }
 
killedBy: MaterialsStorageAdapter — real mode signUploadUrl asks Cloud Storage for a v4 write URL bound to the content-type
statusReason: expected undefined to be 'https://signed.example/upload' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:79:46
   async headObject(input: {
     bucket: string;
     path: string;
-  }): Promise<MaterialObjectMetadata | null> {
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    try {
-      const [meta] = await file.getMetadata();
-      const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
-      return { size };
-    } catch (err) {
-      if ((err as { code?: number }).code === 404) return null;
-      throw err;
-    }
-  }
+  }): Promise<MaterialObjectMetadata | null> {}
 
   async signDownloadUrl(input: {
killedBy: MaterialsStorageAdapter — real mode headObject returns the numeric size when metadata size is a string
statusReason: expected undefined to deeply equal { size: 4096 }

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:85:19
       const [meta] = await file.getMetadata();
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
-    } catch (err) {
-      if ((err as { code?: number }).code === 404) return null;
-      throw err;
-    }
+    } catch (err) {}
   }
 
killedBy: MaterialsStorageAdapter — real mode headObject returns null when the object is missing (404)
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:86:11
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {
-      if ((err as { code?: number }).code === 404) return null;
+      if (true) return null;
       throw err;
     }
killedBy: MaterialsStorageAdapter — real mode headObject rethrows non-404 errors
statusReason: promise resolved "null" instead of rejecting

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:86:11
       const size = typeof meta.size === 'string' ? Number(meta.size) : (meta.size as number);
       return { size };
     } catch (err) {
-      if ((err as { code?: number }).code === 404) return null;
+      if (false) return null;
       throw err;
     }
killedBy: MaterialsStorageAdapter — real mode headObject returns null when the object is missing (404)
statusReason: StrykerJS: Unknown test failure

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:98:34
     contentType: string;
     materialId: string;
     ttlSec: number;
-  }): Promise<SignedDownloadUrl> {
-    const expiresMs = Date.now() + input.ttlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
-      return {
-        downloadUrl: `/api/internal/fake-materials/${input.materialId}`,
-        expiresAt: new Date(expiresMs).toISOString(),
-      };
-    }
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    const [url] = await file.getSignedUrl({
-      version: 'v4',
-      action: 'read',
-      expires: expiresMs,
-      responseDisposition: `attachment; filename="${sanitizeFilename(input.filename)}"`,
-      responseType: input.contentType,
-    });
-    return { downloadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
-  }
+  }): Promise<SignedDownloadUrl> {}
 
   async deleteObject(input: { bucket: string; path: string }): Promise<void> {
killedBy: MaterialsStorageAdapter — fake mode signDownloadUrl returns an internal passthrough URL with a future expiresAt
statusReason: Cannot read properties of undefined (reading 'downloadUrl')

[Killed] ArithmeticOperator
src/lib/materials/materials-storage.adapter.ts:99:36
     materialId: string;
     ttlSec: number;
   }): Promise<SignedDownloadUrl> {
-    const expiresMs = Date.now() + input.ttlSec * 1000;
+    const expiresMs = Date.now() + input.ttlSec / 1000;
     if (this.cfg.storageImpl === 'fake') {
       return {
killedBy: MaterialsStorageAdapter — fake mode signDownloadUrl returns an internal passthrough URL with a future expiresAt
statusReason: expected 1779419209197 to be greater than 1779420009197

[Killed] ArithmeticOperator
src/lib/materials/materials-storage.adapter.ts:99:23
     materialId: string;
     ttlSec: number;
   }): Promise<SignedDownloadUrl> {
-    const expiresMs = Date.now() + input.ttlSec * 1000;
+    const expiresMs = Date.now() - input.ttlSec * 1000;
     if (this.cfg.storageImpl === 'fake') {
       return {
killedBy: MaterialsStorageAdapter — fake mode signDownloadUrl returns an internal passthrough URL with a future expiresAt
statusReason: expected 1779418309153 to be greater than 1779420009153

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:100:9
     ttlSec: number;
   }): Promise<SignedDownloadUrl> {
     const expiresMs = Date.now() + input.ttlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
+    if (false) {
       return {
         downloadUrl: `/api/internal/fake-materials/${input.materialId}`,
killedBy: MaterialsStorageAdapter — fake mode signDownloadUrl returns an internal passthrough URL with a future expiresAt
statusReason: file.getSignedUrl is not a function

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:100:9
     ttlSec: number;
   }): Promise<SignedDownloadUrl> {
     const expiresMs = Date.now() + input.ttlSec * 1000;
-    if (this.cfg.storageImpl === 'fake') {
+    if (true) {
       return {
         downloadUrl: `/api/internal/fake-materials/${input.materialId}`,
killedBy: MaterialsStorageAdapter — real mode signDownloadUrl requests a read URL with attachment disposition
statusReason: expected '/api/internal/fake-materials/m1' to be 'https://signed.example/download' // Object.is equality

[Killed] ObjectLiteral
src/lib/materials/materials-storage.adapter.ts:107:43
       };
     }
     const file = this.storage.bucket(input.bucket).file(input.path);
-    const [url] = await file.getSignedUrl({
-      version: 'v4',
-      action: 'read',
-      expires: expiresMs,
-      responseDisposition: `attachment; filename="${sanitizeFilename(input.filename)}"`,
-      responseType: input.contentType,
-    });
+    const [url] = await file.getSignedUrl({});
     return { downloadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
   }
killedBy: MaterialsStorageAdapter — real mode signDownloadUrl requests a read URL with attachment disposition
statusReason: expected undefined to be 'v4' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials-storage.adapter.ts:108:16
     }
     const file = this.storage.bucket(input.bucket).file(input.path);
     const [url] = await file.getSignedUrl({
-      version: 'v4',
+      version: "",
       action: 'read',
       expires: expiresMs,
killedBy: MaterialsStorageAdapter — real mode signDownloadUrl requests a read URL with attachment disposition
statusReason: expected '' to be 'v4' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:117:78
     return { downloadUrl: url, expiresAt: new Date(expiresMs).toISOString() };
   }
 
-  async deleteObject(input: { bucket: string; path: string }): Promise<void> {
-    const file = this.storage.bucket(input.bucket).file(input.path);
-    try {
-      await file.delete();
-    } catch (err) {
-      if ((err as { code?: number }).code === 404) return;
-      throw err;
-    }
-  }
+  async deleteObject(input: { bucket: string; path: string }): Promise<void> {}
 }
 
killedBy: MaterialsStorageAdapter — real mode deleteObject rethrows non-404 errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/lib/materials/materials-storage.adapter.ts:121:19
     const file = this.storage.bucket(input.bucket).file(input.path);
     try {
       await file.delete();
-    } catch (err) {
-      if ((err as { code?: number }).code === 404) return;
-      throw err;
-    }
+    } catch (err) {}
   }
 }
killedBy: MaterialsStorageAdapter — real mode deleteObject rethrows non-404 errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:122:11
     try {
       await file.delete();
     } catch (err) {
-      if ((err as { code?: number }).code === 404) return;
+      if (true) return;
       throw err;
     }
killedBy: MaterialsStorageAdapter — real mode deleteObject rethrows non-404 errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/materials/materials-storage.adapter.ts:122:11
     try {
       await file.delete();
     } catch (err) {
-      if ((err as { code?: number }).code === 404) return;
+      if (false) return;
       throw err;
     }
killedBy: MaterialsStorageAdapter — real mode deleteObject swallows a 404
statusReason: promise rejected "{ code: 404 }" instead of resolving
