[Killed] EqualityOperator
src/lib/materials/materials.config.ts:19:30
 function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {
   const raw = env[name] ?? dflt;
   const n = Number(raw);
-  if (!Number.isFinite(n) || n <= 0) {
+  if (!Number.isFinite(n) || n < 0) {
     throw new Error(`${name} must be a positive number, got "${raw}".`);
   }
killedBy: readMaterialsConfigFromEnv rejects a non-positive TTL
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:19:30
 function readPositiveNumber(env: NodeJS.ProcessEnv, name: string, dflt: string): number {
   const raw = env[name] ?? dflt;
   const n = Number(raw);
-  if (!Number.isFinite(n) || n <= 0) {
+  if (!Number.isFinite(n) || false) {
     throw new Error(`${name} must be a positive number, got "${raw}".`);
   }
killedBy: readMaterialsConfigFromEnv rejects a non-positive TTL
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/lib/materials/materials.config.ts:20:21
   const raw = env[name] ?? dflt;
   const n = Number(raw);
   if (!Number.isFinite(n) || n <= 0) {
-    throw new Error(`${name} must be a positive number, got "${raw}".`);
+    throw new Error(``);
   }
   return n;
killedBy: readMaterialsConfigFromEnv rejects a non-positive TTL
statusReason: expected [Function] to throw error matching /positive number/ but got ''

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:28:24
 export function readMaterialsConfigFromEnv(env: NodeJS.ProcessEnv): MaterialsConfig {
   // Outside production the materials stack defaults to its credential-free fake
   // mode, so `nx serve` and the e2e suite boot with no GCP project or buckets.
-  const isProduction = env['NODE_ENV'] === 'production';
+  const isProduction = false;
 
   const materialsBucket = isProduction
killedBy: readMaterialsConfigFromEnv requires the bucket name in production
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:28:24
 export function readMaterialsConfigFromEnv(env: NodeJS.ProcessEnv): MaterialsConfig {
   // Outside production the materials stack defaults to its credential-free fake
   // mode, so `nx serve` and the e2e suite boot with no GCP project or buckets.
-  const isProduction = env['NODE_ENV'] === 'production';
+  const isProduction = true;
 
   const materialsBucket = isProduction
killedBy: readMaterialsConfigFromEnv defaults to fake storage and a dev bucket outside production
statusReason: LEARNWREN_MATERIALS_BUCKET env var is required.

[Killed] LogicalOperator
src/lib/materials/materials.config.ts:32:8
 
   const materialsBucket = isProduction
     ? readRequired(env, 'LEARNWREN_MATERIALS_BUCKET')
-    : (env['LEARNWREN_MATERIALS_BUCKET'] ?? 'learnwren-dev-materials');
+    : (env['LEARNWREN_MATERIALS_BUCKET'] && 'learnwren-dev-materials');
 
   const fakeRaw = env['LEARNWREN_MATERIALS_STORAGE_FAKE'];
killedBy: readMaterialsConfigFromEnv defaults to fake storage and a dev bucket outside production
statusReason: expected undefined to be 'learnwren-dev-materials' // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:36:7
 
   const fakeRaw = env['LEARNWREN_MATERIALS_STORAGE_FAKE'];
   let storageImpl: 'real' | 'fake';
-  if (fakeRaw === 'true') {
+  if (false) {
     storageImpl = 'fake';
   } else if (fakeRaw === undefined) {
killedBy: readMaterialsConfigFromEnv rejects fake storage when NODE_ENV=production
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/lib/materials/materials.config.ts:36:7
 
   const fakeRaw = env['LEARNWREN_MATERIALS_STORAGE_FAKE'];
   let storageImpl: 'real' | 'fake';
-  if (fakeRaw === 'true') {
+  if (fakeRaw !== 'true') {
     storageImpl = 'fake';
   } else if (fakeRaw === undefined) {
killedBy: readMaterialsConfigFromEnv defaults to real storage in production
statusReason: LEARNWREN_MATERIALS_STORAGE_FAKE=true is rejected when NODE_ENV=production.

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:38:14
   let storageImpl: 'real' | 'fake';
   if (fakeRaw === 'true') {
     storageImpl = 'fake';
-  } else if (fakeRaw === undefined) {
+  } else if (true) {
     storageImpl = isProduction ? 'real' : 'fake';
   } else {
killedBy: readMaterialsConfigFromEnv treats any non-"true" fake flag as real
statusReason: expected 'fake' to be 'real' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.config.ts:38:37
   let storageImpl: 'real' | 'fake';
   if (fakeRaw === 'true') {
     storageImpl = 'fake';
-  } else if (fakeRaw === undefined) {
-    storageImpl = isProduction ? 'real' : 'fake';
-  } else {
+  } else if (fakeRaw === undefined) {} else {
     storageImpl = 'real';
   }
killedBy: readMaterialsConfigFromEnv defaults to fake storage and a dev bucket outside production
statusReason: expected undefined to be 'fake' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials.config.ts:39:43
   if (fakeRaw === 'true') {
     storageImpl = 'fake';
   } else if (fakeRaw === undefined) {
-    storageImpl = isProduction ? 'real' : 'fake';
+    storageImpl = isProduction ? 'real' : "";
   } else {
     storageImpl = 'real';
killedBy: readMaterialsConfigFromEnv defaults to fake storage and a dev bucket outside production
statusReason: expected '' to be 'fake' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials.config.ts:39:34
   if (fakeRaw === 'true') {
     storageImpl = 'fake';
   } else if (fakeRaw === undefined) {
-    storageImpl = isProduction ? 'real' : 'fake';
+    storageImpl = isProduction ? "" : 'fake';
   } else {
     storageImpl = 'real';
killedBy: readMaterialsConfigFromEnv defaults to real storage in production
statusReason: expected '' to be 'real' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.config.ts:40:10
     storageImpl = 'fake';
   } else if (fakeRaw === undefined) {
     storageImpl = isProduction ? 'real' : 'fake';
-  } else {
-    storageImpl = 'real';
-  }
+  } else {}
   if (storageImpl === 'fake' && isProduction) {
     throw new Error(
killedBy: readMaterialsConfigFromEnv treats any non-"true" fake flag as real
statusReason: expected undefined to be 'real' // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:43:7
   } else {
     storageImpl = 'real';
   }
-  if (storageImpl === 'fake' && isProduction) {
+  if (true) {
     throw new Error(
       'LEARNWREN_MATERIALS_STORAGE_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readMaterialsConfigFromEnv defaults to fake storage and a dev bucket outside production
statusReason: LEARNWREN_MATERIALS_STORAGE_FAKE=true is rejected when NODE_ENV=production.

[Killed] ConditionalExpression
src/lib/materials/materials.config.ts:43:7
   } else {
     storageImpl = 'real';
   }
-  if (storageImpl === 'fake' && isProduction) {
+  if (true && isProduction) {
     throw new Error(
       'LEARNWREN_MATERIALS_STORAGE_FAKE=true is rejected when NODE_ENV=production.',
killedBy: readMaterialsConfigFromEnv defaults to real storage in production
statusReason: LEARNWREN_MATERIALS_STORAGE_FAKE=true is rejected when NODE_ENV=production.

[Killed] ObjectLiteral
src/lib/materials/materials.config.ts:49:10
     );
   }
 
-  return {
-    materialsBucket,
-    storageImpl,
-    uploadUrlTtlSec: readPositiveNumber(env, 'LEARNWREN_MATERIALS_UPLOAD_URL_TTL_SEC', '900'),
-    downloadUrlTtlSec: readPositiveNumber(env, 'LEARNWREN_MATERIALS_DOWNLOAD_URL_TTL_SEC', '900'),
-  };
+  return {};
 }
 
killedBy: readMaterialsConfigFromEnv defaults to fake storage and a dev bucket outside production
statusReason: expected undefined to be 'fake' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials.config.ts:52:46
   return {
     materialsBucket,
     storageImpl,
-    uploadUrlTtlSec: readPositiveNumber(env, 'LEARNWREN_MATERIALS_UPLOAD_URL_TTL_SEC', '900'),
+    uploadUrlTtlSec: readPositiveNumber(env, "", '900'),
     downloadUrlTtlSec: readPositiveNumber(env, 'LEARNWREN_MATERIALS_DOWNLOAD_URL_TTL_SEC', '900'),
   };
killedBy: readMaterialsConfigFromEnv parses TTL overrides
statusReason: expected 900 to be 120 // Object.is equality
