[Killed] BlockStatement
src/lib/materials/materials.controller.ts:58:37
     @Param('lid') lid: LessonId,
     @Body() body: CreateMaterialUploadDto,
     @Req() req: MaterialScopedRequest,
-  ): Promise<CreateUploadUrlResult> {
-    await this.assertLessonExists(cid, mid, lid);
-    return this.svc.createUploadUrl({
-      uid: req.user!.uid,
-      courseId: cid,
-      lessonId: lid,
-      filename: body.filename,
-      sizeBytes: body.sizeBytes,
-    });
-  }
+  ): Promise<CreateUploadUrlResult> {}
 
   @Get('courses/:cid/modules/:mid/lessons/:lid/materials')
killedBy: MaterialsController createUploadUrl resolves the lesson then delegates to the service
statusReason: Cannot read properties of undefined (reading 'materialId')

[Killed] BlockStatement
src/lib/materials/materials.controller.ts:75:26
     @Param('cid') cid: CourseId,
     @Param('mid') mid: ModuleId,
     @Param('lid') lid: LessonId,
-  ): Promise<Material[]> {
-    await this.assertLessonExists(cid, mid, lid);
-    return this.svc.listForLesson(lid);
-  }
+  ): Promise<Material[]> {}
 
   @Post('materials/:matId/complete')
killedBy: MaterialsController list resolves the lesson then returns the service result
statusReason: expected undefined to deeply equal [ { id: 'm1', displayName: 'Doc' } ]

[Killed] BlockStatement
src/lib/materials/materials.controller.ts:83:72
   @Post('materials/:matId/complete')
   @HttpCode(200)
   @UseGuards(InstructorRoleGuard, MaterialOwnerGuard)
-  async complete(@Req() req: MaterialScopedRequest): Promise<Material> {
-    return this.svc.complete(req.material!.id);
-  }
+  async complete(@Req() req: MaterialScopedRequest): Promise<Material> {}
 
   @Patch('materials/:matId')
killedBy: MaterialsController complete delegates with the loaded material id
statusReason: expected "vi.fn()" to be called with arguments: [ 'm1' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/materials/materials.controller.ts:92:24
   async rename(
     @Body() body: RenameMaterialDto,
     @Req() req: MaterialScopedRequest,
-  ): Promise<Material> {
-    return this.svc.rename(req.material!.id, body.displayName);
-  }
+  ): Promise<Material> {}
 
   @Delete('materials/:matId')
killedBy: MaterialsController rename delegates the new display name
statusReason: expected "vi.fn()" to be called with arguments: [ 'm1', 'New' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/materials/materials.controller.ts:99:66
   @Delete('materials/:matId')
   @HttpCode(204)
   @UseGuards(InstructorRoleGuard, MaterialOwnerGuard)
-  async remove(@Req() req: MaterialScopedRequest): Promise<void> {
-    await this.svc.remove(req.material!.id);
-  }
+  async remove(@Req() req: MaterialScopedRequest): Promise<void> {}
 
   @Get('materials/:matId/download-url')
killedBy: MaterialsController remove delegates to the service
statusReason: expected "vi.fn()" to be called with arguments: [ 'm1' ]

Number of calls: 0

[Killed] BlockStatement
src/lib/materials/materials.controller.ts:105:84
 
   @Get('materials/:matId/download-url')
   @UseGuards(MaterialAccessGuard)
-  async downloadUrl(@Req() req: MaterialScopedRequest): Promise<DownloadUrlResult> {
-    return this.svc.buildDownloadUrl(req.material!.id);
-  }
+  async downloadUrl(@Req() req: MaterialScopedRequest): Promise<DownloadUrlResult> {}
 
   private async assertLessonExists(
killedBy: MaterialsController downloadUrl returns the signed URL
statusReason: expected undefined to deeply equal { downloadUrl: 'd', expiresAt: 'T' }

[Killed] BlockStatement
src/lib/materials/materials.controller.ts:113:20
     cid: CourseId,
     mid: ModuleId,
     lid: LessonId,
-  ): Promise<void> {
-    const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
-    if (!moduleOk) throw new ModuleNotFoundException();
-    const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
-    if (!lesson) throw new LessonNotFoundException();
-  }
+  ): Promise<void> {}
 }
 
killedBy: MaterialsController createUploadUrl throws MODULE_NOT_FOUND when the module is unknown
statusReason: promise resolved "{ materialId: 'm1', …(2) }" instead of rejecting
