[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:31:7
     // MaterialException, CoursesException, and AuthException share the same
     // { code, status, message, details? } shape.
     if (
-      exception instanceof MaterialException ||
-      exception instanceof CoursesException ||
-      (exception instanceof Error &&
-        (exception.name === 'AuthException' ||
-          exception.constructor.name === 'AuthException'))
+      false
     ) {
       const err = exception as Error & {
killedBy: MaterialsExceptionFilter maps a MaterialException to its code + status
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:31:7
     // MaterialException, CoursesException, and AuthException share the same
     // { code, status, message, details? } shape.
     if (
-      exception instanceof MaterialException ||
-      exception instanceof CoursesException ||
+      false ||
       (exception instanceof Error &&
         (exception.name === 'AuthException' ||
killedBy: MaterialsExceptionFilter maps a MaterialException to its code + status
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:33:8
     if (
       exception instanceof MaterialException ||
       exception instanceof CoursesException ||
-      (exception instanceof Error &&
-        (exception.name === 'AuthException' ||
-          exception.constructor.name === 'AuthException'))
+      (false)
     ) {
       const err = exception as Error & {
killedBy: MaterialsExceptionFilter maps an AuthException by name
statusReason: expected 500 to be 401 // Object.is equality

[Killed] LogicalOperator
src/lib/materials/materials.exception-filter.ts:33:8
     if (
       exception instanceof MaterialException ||
       exception instanceof CoursesException ||
-      (exception instanceof Error &&
-        (exception.name === 'AuthException' ||
-          exception.constructor.name === 'AuthException'))
+      (exception instanceof Error || exception.name === 'AuthException' || exception.constructor.name === 'AuthException')
     ) {
       const err = exception as Error & {
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] LogicalOperator
src/lib/materials/materials.exception-filter.ts:34:10
       exception instanceof MaterialException ||
       exception instanceof CoursesException ||
       (exception instanceof Error &&
-        (exception.name === 'AuthException' ||
-          exception.constructor.name === 'AuthException'))
+        (exception.name === 'AuthException' && exception.constructor.name === 'AuthException'))
     ) {
       const err = exception as Error & {
killedBy: MaterialsExceptionFilter maps an AuthException by name
statusReason: expected 500 to be 401 // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:34:10
       exception instanceof MaterialException ||
       exception instanceof CoursesException ||
       (exception instanceof Error &&
-        (exception.name === 'AuthException' ||
+        (false ||
           exception.constructor.name === 'AuthException'))
     ) {
killedBy: MaterialsExceptionFilter maps an AuthException by name
statusReason: expected 500 to be 401 // Object.is equality

[Killed] EqualityOperator
src/lib/materials/materials.exception-filter.ts:35:11
       exception instanceof CoursesException ||
       (exception instanceof Error &&
         (exception.name === 'AuthException' ||
-          exception.constructor.name === 'AuthException'))
+          exception.constructor.name !== 'AuthException'))
     ) {
       const err = exception as Error & {
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected undefined to be 'VALIDATION_FAILED' // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:35:11
       exception instanceof CoursesException ||
       (exception instanceof Error &&
         (exception.name === 'AuthException' ||
-          exception.constructor.name === 'AuthException'))
+          false))
     ) {
       const err = exception as Error & {
killedBy: MaterialsExceptionFilter maps an AuthException when matched by constructor.name rather than .name
statusReason: expected 500 to be 401 // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.exception-filter.ts:36:7
       (exception instanceof Error &&
         (exception.name === 'AuthException' ||
           exception.constructor.name === 'AuthException'))
-    ) {
-      const err = exception as Error & {
-        code: string;
-        status: number;
-        details?: Record<string, unknown>;
-      };
-      const body: MaterialErrorBody = {
-        error: { code: err.code, message: err.message },
-      };
-      if (err.details) body.error.details = err.details;
-      response.status(err.status).json(body);
-      return;
-    }
+    ) {}
 
     if (exception instanceof BadRequestException) {
killedBy: MaterialsExceptionFilter maps a MaterialException to its code + status
statusReason: expected 500 to be 404 // Object.is equality

[Killed] ObjectLiteral
src/lib/materials/materials.exception-filter.ts:42:39
         status: number;
         details?: Record<string, unknown>;
       };
-      const body: MaterialErrorBody = {
-        error: { code: err.code, message: err.message },
-      };
+      const body: MaterialErrorBody = {};
       if (err.details) body.error.details = err.details;
       response.status(err.status).json(body);
killedBy: MaterialsExceptionFilter maps a MaterialException to its code + status
statusReason: expected {} to deeply equal { error: { …(2) } }

[Killed] BlockStatement
src/lib/materials/materials.exception-filter.ts:50:51
       return;
     }
 
-    if (exception instanceof BadRequestException) {
-      const payload = exception.getResponse() as { message?: string[] | string };
-      const messages = Array.isArray(payload.message)
-        ? payload.message
-        : payload.message
-          ? [payload.message]
-          : [];
-      response.status(400).json({
-        error: {
-          code: 'VALIDATION_FAILED',
-          message: 'Request body failed validation.',
-          details: { fieldErrors: parseFieldErrors(messages) },
-        },
-      } satisfies MaterialErrorBody);
-      return;
-    }
+    if (exception instanceof BadRequestException) {}
 
     this.logger.error(
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected 500 to be 400 // Object.is equality

[Survived] ArrayDeclaration
src/lib/materials/materials.exception-filter.ts:56:13
         ? payload.message
         : payload.message
           ? [payload.message]
-          : [];
+          : ["Stryker was here"];
       response.status(400).json({
         error: {

[Killed] ObjectLiteral
src/lib/materials/materials.exception-filter.ts:57:33
         : payload.message
           ? [payload.message]
           : [];
-      response.status(400).json({
-        error: {
-          code: 'VALIDATION_FAILED',
-          message: 'Request body failed validation.',
-          details: { fieldErrors: parseFieldErrors(messages) },
-        },
-      } satisfies MaterialErrorBody);
+      response.status(400).json({} satisfies MaterialErrorBody);
       return;
     }
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] StringLiteral
src/lib/materials/materials.exception-filter.ts:59:17
           : [];
       response.status(400).json({
         error: {
-          code: 'VALIDATION_FAILED',
+          code: "",
           message: 'Request body failed validation.',
           details: { fieldErrors: parseFieldErrors(messages) },
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected '' to be 'VALIDATION_FAILED' // Object.is equality

[Killed] ObjectLiteral
src/lib/materials/materials.exception-filter.ts:61:20
         error: {
           code: 'VALIDATION_FAILED',
           message: 'Request body failed validation.',
-          details: { fieldErrors: parseFieldErrors(messages) },
+          details: {},
         },
       } satisfies MaterialErrorBody);
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected {} to deeply equal { Object (fieldErrors) }

[Killed] ObjectLiteral
src/lib/materials/materials.exception-filter.ts:70:31
     this.logger.error(
       exception instanceof Error ? (exception.stack ?? exception.message) : String(exception),
     );
-    response.status(500).json({
-      error: { code: 'INTERNAL', message: 'An internal error occurred.' },
-    } satisfies MaterialErrorBody);
+    response.status(500).json({} satisfies MaterialErrorBody);
   }
 }
killedBy: MaterialsExceptionFilter maps an unknown error to 500 INTERNAL with the correct message
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/lib/materials/materials.exception-filter.ts:77:73
 }
 
 /** class-validator emits "filename should not be empty" — key on the first word. */
-function parseFieldErrors(messages: string[]): Record<string, string[]> {
-  const out: Record<string, string[]> = {};
-  for (const msg of messages) {
-    const field = msg.split(' ')[0];
-    if (!field) continue;
-    (out[field] ??= []).push(msg);
-  }
-  return out;
-}
+function parseFieldErrors(messages: string[]): Record<string, string[]> {}
 
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected { fieldErrors: undefined } to deeply equal { Object (fieldErrors) }

[Killed] BlockStatement
src/lib/materials/materials.exception-filter.ts:79:31
 /** class-validator emits "filename should not be empty" — key on the first word. */
 function parseFieldErrors(messages: string[]): Record<string, string[]> {
   const out: Record<string, string[]> = {};
-  for (const msg of messages) {
-    const field = msg.split(' ')[0];
-    if (!field) continue;
-    (out[field] ??= []).push(msg);
-  }
+  for (const msg of messages) {}
   return out;
 }
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected { fieldErrors: {} } to deeply equal { Object (fieldErrors) }

[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:81:9
   const out: Record<string, string[]> = {};
   for (const msg of messages) {
     const field = msg.split(' ')[0];
-    if (!field) continue;
+    if (false) continue;
     (out[field] ??= []).push(msg);
   }
killedBy: MaterialsExceptionFilter skips messages with no leading field name in parseFieldErrors (pins the !field guard)
statusReason: expected [ '', 'email' ] to not include ''

[Killed] ConditionalExpression
src/lib/materials/materials.exception-filter.ts:81:9
   const out: Record<string, string[]> = {};
   for (const msg of messages) {
     const field = msg.split(' ')[0];
-    if (!field) continue;
+    if (true) continue;
     (out[field] ??= []).push(msg);
   }
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: expected { fieldErrors: {} } to deeply equal { Object (fieldErrors) }

[Killed] AssignmentOperator
src/lib/materials/materials.exception-filter.ts:82:6
   for (const msg of messages) {
     const field = msg.split(' ')[0];
     if (!field) continue;
-    (out[field] ??= []).push(msg);
+    (out[field] &&= []).push(msg);
   }
   return out;
killedBy: MaterialsExceptionFilter maps a BadRequestException to 400 VALIDATION_FAILED with fieldErrors (array message)
statusReason: Cannot read properties of undefined (reading 'push')
