[Killed] BlockStatement
src/lib/materials/materials.repository.ts:10:32
 export class MaterialsRepository {
   constructor(@Inject(FIRESTORE) private readonly db: FirestoreHandle) {}
 
-  newId<T extends string>(): T {
-    return this.db.collection('_ids').doc().id as T;
-  }
+  newId<T extends string>(): T {}
 
   async get(matId: MaterialId): Promise<Material | null> {
killedBy: MaterialsRepository newId returns a non-empty string
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/lib/materials/materials.repository.ts:14:58
     return this.db.collection('_ids').doc().id as T;
   }
 
-  async get(matId: MaterialId): Promise<Material | null> {
-    const snap = await this.db.collection('materials').doc(matId).get();
-    return snap.exists ? (snap.data() as Material) : null;
-  }
+  async get(matId: MaterialId): Promise<Material | null> {}
 
   async listByLesson(lessonId: LessonId): Promise<Material[]> {
killedBy: MaterialsRepository create then get round-trips a material
statusReason: expected undefined to be 'm1' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.repository.ts:19:63
     return snap.exists ? (snap.data() as Material) : null;
   }
 
-  async listByLesson(lessonId: LessonId): Promise<Material[]> {
-    const q = await this.db
-      .collection('materials')
-      .where('lessonId', '==', lessonId)
-      .get();
-    return q.docs.map((d) => d.data() as Material);
-  }
+  async listByLesson(lessonId: LessonId): Promise<Material[]> {}
 
   async create(material: Material): Promise<void> {
killedBy: MaterialsRepository listByLesson returns only that lesson’s materials
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/lib/materials/materials.repository.ts:24:23
       .collection('materials')
       .where('lessonId', '==', lessonId)
       .get();
-    return q.docs.map((d) => d.data() as Material);
+    return q.docs.map(() => undefined);
   }
 
killedBy: MaterialsRepository listByLesson returns only that lesson’s materials
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/lib/materials/materials.repository.ts:27:51
     return q.docs.map((d) => d.data() as Material);
   }
 
-  async create(material: Material): Promise<void> {
-    await this.db.collection('materials').doc(material.id).set(material);
-  }
+  async create(material: Material): Promise<void> {}
 
   async update(matId: MaterialId, patch: Partial<Material>): Promise<void> {
killedBy: MaterialsRepository create then get round-trips a material
statusReason: expected undefined to be 'm1' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials.repository.ts:28:30
   }
 
   async create(material: Material): Promise<void> {
-    await this.db.collection('materials').doc(material.id).set(material);
+    await this.db.collection("").doc(material.id).set(material);
   }
 
killedBy: MaterialsRepository create then get round-trips a material
statusReason: expected undefined to be 'm1' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.repository.ts:31:76
     await this.db.collection('materials').doc(material.id).set(material);
   }
 
-  async update(matId: MaterialId, patch: Partial<Material>): Promise<void> {
-    await this.db.collection('materials').doc(matId).update(patch);
-  }
+  async update(matId: MaterialId, patch: Partial<Material>): Promise<void> {}
 
   async delete(matId: MaterialId): Promise<void> {
killedBy: MaterialsRepository update patches fields
statusReason: expected 'PENDING_UPLOAD' to be 'READY' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.repository.ts:35:50
     await this.db.collection('materials').doc(matId).update(patch);
   }
 
-  async delete(matId: MaterialId): Promise<void> {
-    await this.db.collection('materials').doc(matId).delete();
-  }
+  async delete(matId: MaterialId): Promise<void> {}
 }
 
killedBy: MaterialsRepository delete removes the document
statusReason: expected { id: 'm1', …(12) } to be null
