[Killed] BlockStatement
src/lib/materials/materials.service.ts:41:71
 
 /** Parse + validate the file extension from a filename. The browser-reported
  *  MIME type is unreliable for Office formats, so the extension is authoritative. */
-function parseExtension(filename: string): SupportedMaterialExtension {
-  const dot = filename.lastIndexOf('.');
-  const ext = dot >= 0 ? filename.slice(dot + 1).toLowerCase() : '';
-  if (!(SUPPORTED_MATERIAL_EXTENSIONS as readonly string[]).includes(ext)) {
-    throw new UnsupportedMaterialTypeException();
-  }
-  return ext as SupportedMaterialExtension;
-}
+function parseExtension(filename: string): SupportedMaterialExtension {}
 
 export interface CreateUploadUrlInput {
killedBy: MaterialsService.createUploadUrl creates a PENDING_UPLOAD doc and returns the upload URL
statusReason: expected undefined to be 'pdf' // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:43:15
  *  MIME type is unreliable for Office formats, so the extension is authoritative. */
 function parseExtension(filename: string): SupportedMaterialExtension {
   const dot = filename.lastIndexOf('.');
-  const ext = dot >= 0 ? filename.slice(dot + 1).toLowerCase() : '';
+  const ext = false ? filename.slice(dot + 1).toLowerCase() : '';
   if (!(SUPPORTED_MATERIAL_EXTENSIONS as readonly string[]).includes(ext)) {
     throw new UnsupportedMaterialTypeException();
killedBy: MaterialsService.createUploadUrl creates a PENDING_UPLOAD doc and returns the upload URL
statusReason: Unsupported file type. Supported formats: PDF, DOCX, PPTX, XLSX, TXT, ZIP.

[Killed] EqualityOperator
src/lib/materials/materials.service.ts:43:15
  *  MIME type is unreliable for Office formats, so the extension is authoritative. */
 function parseExtension(filename: string): SupportedMaterialExtension {
   const dot = filename.lastIndexOf('.');
-  const ext = dot >= 0 ? filename.slice(dot + 1).toLowerCase() : '';
+  const ext = dot < 0 ? filename.slice(dot + 1).toLowerCase() : '';
   if (!(SUPPORTED_MATERIAL_EXTENSIONS as readonly string[]).includes(ext)) {
     throw new UnsupportedMaterialTypeException();
killedBy: MaterialsService.createUploadUrl creates a PENDING_UPLOAD doc and returns the upload URL
statusReason: Unsupported file type. Supported formats: PDF, DOCX, PPTX, XLSX, TXT, ZIP.

[Killed] BlockStatement
src/lib/materials/materials.service.ts:44:76
 function parseExtension(filename: string): SupportedMaterialExtension {
   const dot = filename.lastIndexOf('.');
   const ext = dot >= 0 ? filename.slice(dot + 1).toLowerCase() : '';
-  if (!(SUPPORTED_MATERIAL_EXTENSIONS as readonly string[]).includes(ext)) {
-    throw new UnsupportedMaterialTypeException();
-  }
+  if (!(SUPPORTED_MATERIAL_EXTENSIONS as readonly string[]).includes(ext)) {}
   return ext as SupportedMaterialExtension;
 }
killedBy: MaterialsService.createUploadUrl rejects an unsupported extension
statusReason: promise resolved "{ materialId: 'mat-1', …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:44:7
 function parseExtension(filename: string): SupportedMaterialExtension {
   const dot = filename.lastIndexOf('.');
   const ext = dot >= 0 ? filename.slice(dot + 1).toLowerCase() : '';
-  if (!(SUPPORTED_MATERIAL_EXTENSIONS as readonly string[]).includes(ext)) {
+  if (true) {
     throw new UnsupportedMaterialTypeException();
   }
killedBy: MaterialsService.createUploadUrl creates a PENDING_UPLOAD doc and returns the upload URL
statusReason: Unsupported file type. Supported formats: PDF, DOCX, PPTX, XLSX, TXT, ZIP.

[Killed] BlockStatement
src/lib/materials/materials.service.ts:108:56
     return { materialId, uploadUrl: signed.uploadUrl, expiresAt: signed.expiresAt };
   }
 
-  async complete(matId: MaterialId): Promise<Material> {
-    const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
-    if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
-
-    const head = await this.storage.headObject({
-      bucket: m.storage.bucket,
-      path: m.storage.path,
-    });
-    if (!head) throw new UploadObjectMissingException();
-    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
-      await this.storage
-        .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
-        .catch(() => undefined);
-      throw new UploadObjectSizeMismatchException();
-    }
-
-    const updatedAt = nowIso();
-    await this.repo.update(matId, { state: 'READY', sizeBytes: head.size, updatedAt });
-    return { ...m, state: 'READY', sizeBytes: head.size, updatedAt };
-  }
+  async complete(matId: MaterialId): Promise<Material> {}
 
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:110:9
 
   async complete(matId: MaterialId): Promise<Material> {
     const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
+    if (false) throw new MaterialNotFoundException();
     if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
 
killedBy: MaterialsService.complete throws MATERIAL_NOT_FOUND for a missing material
statusReason: expected [Function] to throw error matching /not found/i but got 'Cannot read properties of null (readi…'

[Killed] BooleanLiteral
src/lib/materials/materials.service.ts:110:9
 
   async complete(matId: MaterialId): Promise<Material> {
     const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
+    if (m) throw new MaterialNotFoundException();
     if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
 
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Material not found.

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:111:9
   async complete(matId: MaterialId): Promise<Material> {
     const m = await this.repo.get(matId);
     if (!m) throw new MaterialNotFoundException();
-    if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
+    if (false) throw new InvalidMaterialStateException(m.state);
 
     const head = await this.storage.headObject({
killedBy: MaterialsService.complete throws INVALID_MATERIAL_STATE when not PENDING_UPLOAD
statusReason: promise resolved "{ id: 'm1', …(12) }" instead of rejecting

[Killed] EqualityOperator
src/lib/materials/materials.service.ts:111:9
   async complete(matId: MaterialId): Promise<Material> {
     const m = await this.repo.get(matId);
     if (!m) throw new MaterialNotFoundException();
-    if (m.state !== 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
+    if (m.state === 'PENDING_UPLOAD') throw new InvalidMaterialStateException(m.state);
 
     const head = await this.storage.headObject({
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: Operation is not valid in state PENDING_UPLOAD.

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:117:9
       bucket: m.storage.bucket,
       path: m.storage.path,
     });
-    if (!head) throw new UploadObjectMissingException();
+    if (false) throw new UploadObjectMissingException();
     if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
       await this.storage
killedBy: MaterialsService.complete throws UPLOAD_OBJECT_MISSING when no object was uploaded
statusReason: expected [Function] to throw error matching /no uploaded object/i but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:117:9
       bucket: m.storage.bucket,
       path: m.storage.path,
     });
-    if (!head) throw new UploadObjectMissingException();
+    if (true) throw new UploadObjectMissingException();
     if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
       await this.storage
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: No uploaded object exists at the upload destination.

[Killed] BlockStatement
src/lib/materials/materials.service.ts:118:63
       path: m.storage.path,
     });
     if (!head) throw new UploadObjectMissingException();
-    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
-      await this.storage
-        .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
-        .catch(() => undefined);
-      throw new UploadObjectSizeMismatchException();
-    }
+    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {}
 
     const updatedAt = nowIso();
killedBy: MaterialsService.complete throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes the object when oversized
statusReason: promise resolved "{ id: 'm1', …(12) }" instead of rejecting

[Killed] ArithmeticOperator
src/lib/materials/materials.service.ts:118:21
       path: m.storage.path,
     });
     if (!head) throw new UploadObjectMissingException();
-    if (head.size > MATERIAL_MAX_SIZE_BYTES * SIZE_TOLERANCE) {
+    if (head.size > MATERIAL_MAX_SIZE_BYTES / SIZE_TOLERANCE) {
       await this.storage
         .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
killedBy: MaterialsService.complete accepts a file exactly at the tolerance boundary (size === MAX * 1.05) without throwing
statusReason: Uploaded object size exceeds the allowed limit.

[Killed] ObjectLiteral
src/lib/materials/materials.service.ts:126:35
     }
 
     const updatedAt = nowIso();
-    await this.repo.update(matId, { state: 'READY', sizeBytes: head.size, updatedAt });
+    await this.repo.update(matId, {});
     return { ...m, state: 'READY', sizeBytes: head.size, updatedAt };
   }
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: expected 'PENDING_UPLOAD' to be 'READY' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials.service.ts:126:44
     }
 
     const updatedAt = nowIso();
-    await this.repo.update(matId, { state: 'READY', sizeBytes: head.size, updatedAt });
+    await this.repo.update(matId, { state: "", sizeBytes: head.size, updatedAt });
     return { ...m, state: 'READY', sizeBytes: head.size, updatedAt };
   }
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: expected '' to be 'READY' // Object.is equality

[Killed] StringLiteral
src/lib/materials/materials.service.ts:127:27
 
     const updatedAt = nowIso();
     await this.repo.update(matId, { state: 'READY', sizeBytes: head.size, updatedAt });
-    return { ...m, state: 'READY', sizeBytes: head.size, updatedAt };
+    return { ...m, state: "", sizeBytes: head.size, updatedAt };
   }
 
killedBy: MaterialsService.complete flips PENDING_UPLOAD → READY and records the actual size
statusReason: expected '' to be 'READY' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:130:64
     return { ...m, state: 'READY', sizeBytes: head.size, updatedAt };
   }
 
-  async listForLesson(lessonId: LessonId): Promise<Material[]> {
-    const all = await this.repo.listByLesson(lessonId);
-    return all
-      .filter((m) => m.state === 'READY')
-      .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
-  }
+  async listForLesson(lessonId: LessonId): Promise<Material[]> {}
 
   async rename(matId: MaterialId, displayName: string): Promise<Material> {
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/lib/materials/materials.service.ts:132:12
 
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
     const all = await this.repo.listByLesson(lessonId);
-    return all
-      .filter((m) => m.state === 'READY')
+    return all
       .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
   }
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: expected [ 'm3', 'm1', 'm2' ] to deeply equal [ 'm1', 'm2' ]

[Killed] MethodExpression
src/lib/materials/materials.service.ts:132:12
 
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
     const all = await this.repo.listByLesson(lessonId);
-    return all
-      .filter((m) => m.state === 'READY')
-      .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
+    return all.filter(m => m.state === 'READY');
   }
 
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: expected [ 'm2', 'm1' ] to deeply equal [ 'm1', 'm2' ]

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:133:22
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
     const all = await this.repo.listByLesson(lessonId);
     return all
-      .filter((m) => m.state === 'READY')
+      .filter((m) => true)
       .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
   }
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: expected [ 'm3', 'm1', 'm2' ] to deeply equal [ 'm1', 'm2' ]

[Killed] EqualityOperator
src/lib/materials/materials.service.ts:133:22
   async listForLesson(lessonId: LessonId): Promise<Material[]> {
     const all = await this.repo.listByLesson(lessonId);
     return all
-      .filter((m) => m.state === 'READY')
+      .filter((m) => m.state !== 'READY')
       .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
   }
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: expected [ 'm3' ] to deeply equal [ 'm1', 'm2' ]

[Killed] ArrowFunction
src/lib/materials/materials.service.ts:134:13
     const all = await this.repo.listByLesson(lessonId);
     return all
       .filter((m) => m.state === 'READY')
-      .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
+      .sort(() => undefined);
   }
 
killedBy: MaterialsService.listForLesson returns only READY materials, sorted by createdAt ascending
statusReason: expected [ 'm2', 'm1' ] to deeply equal [ 'm1', 'm2' ]

[Killed] BlockStatement
src/lib/materials/materials.service.ts:137:75
       .sort((a, b) => a.createdAt.localeCompare(b.createdAt));
   }
 
-  async rename(matId: MaterialId, displayName: string): Promise<Material> {
-    const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
-    const updatedAt = nowIso();
-    await this.repo.update(matId, { displayName, updatedAt });
-    return { ...m, displayName, updatedAt };
-  }
+  async rename(matId: MaterialId, displayName: string): Promise<Material> {}
 
   async remove(matId: MaterialId): Promise<void> {
killedBy: MaterialsService.rename updates displayName and returns the material
statusReason: Cannot read properties of undefined (reading 'displayName')

[Killed] ObjectLiteral
src/lib/materials/materials.service.ts:141:35
     const m = await this.repo.get(matId);
     if (!m) throw new MaterialNotFoundException();
     const updatedAt = nowIso();
-    await this.repo.update(matId, { displayName, updatedAt });
+    await this.repo.update(matId, {});
     return { ...m, displayName, updatedAt };
   }
killedBy: MaterialsService.rename updates displayName and returns the material
statusReason: expected 'doc.pdf' to be 'Final Notes' // Object.is equality

[Killed] ObjectLiteral
src/lib/materials/materials.service.ts:142:12
     if (!m) throw new MaterialNotFoundException();
     const updatedAt = nowIso();
     await this.repo.update(matId, { displayName, updatedAt });
-    return { ...m, displayName, updatedAt };
+    return {};
   }
 
killedBy: MaterialsService.rename updates displayName and returns the material
statusReason: expected undefined to be 'Final Notes' // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:145:50
     return { ...m, displayName, updatedAt };
   }
 
-  async remove(matId: MaterialId): Promise<void> {
-    const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
-    await this.storage
-      .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
-      .catch(() => undefined);
-    await this.repo.delete(m.id);
-  }
+  async remove(matId: MaterialId): Promise<void> {}
 
   async buildDownloadUrl(matId: MaterialId): Promise<DownloadUrlResult> {
killedBy: MaterialsService.remove deletes the storage object and the doc
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/materials/materials.service.ts:147:9
 
   async remove(matId: MaterialId): Promise<void> {
     const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
+    if (true) throw new MaterialNotFoundException();
     await this.storage
       .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
killedBy: MaterialsService.remove deletes the storage object and the doc
statusReason: Material not found.

[Killed] BlockStatement
src/lib/materials/materials.service.ts:154:73
     await this.repo.delete(m.id);
   }
 
-  async buildDownloadUrl(matId: MaterialId): Promise<DownloadUrlResult> {
-    const m = await this.repo.get(matId);
-    if (!m) throw new MaterialNotFoundException();
-    return this.storage.signDownloadUrl({
-      bucket: m.storage.bucket,
-      path: m.storage.path,
-      filename: m.originalFilename,
-      contentType: m.contentType,
-      materialId: m.id,
-      ttlSec: this.cfg.downloadUrlTtlSec,
-    });
-  }
+  async buildDownloadUrl(matId: MaterialId): Promise<DownloadUrlResult> {}
 
   /** Cascade entry point — called by CoursesService.deleteLesson before the
killedBy: MaterialsService.buildDownloadUrl returns a signed download URL for an existing material
statusReason: Cannot read properties of undefined (reading 'downloadUrl')

[Killed] BlockStatement
src/lib/materials/materials.service.ts:169:60
 
   /** Cascade entry point — called by CoursesService.deleteLesson before the
    *  lesson doc is removed. Best-effort object delete, then doc delete. */
-  async deleteForLesson(lessonId: LessonId): Promise<void> {
-    const materials = await this.repo.listByLesson(lessonId);
-    for (const m of materials) {
-      await this.storage
-        .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
-        .catch(() => undefined);
-      await this.repo.delete(m.id);
-    }
-  }
+  async deleteForLesson(lessonId: LessonId): Promise<void> {}
 }
 
killedBy: MaterialsService.deleteForLesson removes every material attached to the lesson
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/materials/materials.service.ts:171:32
    *  lesson doc is removed. Best-effort object delete, then doc delete. */
   async deleteForLesson(lessonId: LessonId): Promise<void> {
     const materials = await this.repo.listByLesson(lessonId);
-    for (const m of materials) {
-      await this.storage
-        .deleteObject({ bucket: m.storage.bucket, path: m.storage.path })
-        .catch(() => undefined);
-      await this.repo.delete(m.id);
-    }
+    for (const m of materials) {}
   }
 }
killedBy: MaterialsService.deleteForLesson removes every material attached to the lesson
statusReason: expected true to be false // Object.is equality
