[Killed] BlockStatement
lib/materials/webhook/fake-materials.controller.ts:13:55
 
 /** Collect a raw request stream into a Buffer (no body parser runs for the
  *  binary content-types materials use, so the stream is intact). */
-function collectStream(req: Request): Promise<Buffer> {
-  return new Promise((resolve, reject) => {
-    const chunks: Buffer[] = [];
-    req.on('data', (c: Buffer) => chunks.push(c));
-    req.on('end', () => resolve(Buffer.concat(chunks)));
-    req.on('error', reject);
-  });
-}
+function collectStream(req: Request): Promise<Buffer> {}
 
 function sanitizeFilename(name: string): string {
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
lib/materials/webhook/fake-materials.controller.ts:14:43
 /** Collect a raw request stream into a Buffer (no body parser runs for the
  *  binary content-types materials use, so the stream is intact). */
 function collectStream(req: Request): Promise<Buffer> {
-  return new Promise((resolve, reject) => {
-    const chunks: Buffer[] = [];
-    req.on('data', (c: Buffer) => chunks.push(c));
-    req.on('end', () => resolve(Buffer.concat(chunks)));
-    req.on('error', reject);
-  });
+  return new Promise((resolve, reject) => {});
 }
 
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrayDeclaration
lib/materials/webhook/fake-materials.controller.ts:15:30
  *  binary content-types materials use, so the stream is intact). */
 function collectStream(req: Request): Promise<Buffer> {
   return new Promise((resolve, reject) => {
-    const chunks: Buffer[] = [];
+    const chunks: Buffer[] = ["Stryker was here"];
     req.on('data', (c: Buffer) => chunks.push(c));
     req.on('end', () => resolve(Buffer.concat(chunks)));
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
lib/materials/webhook/fake-materials.controller.ts:16:20
 function collectStream(req: Request): Promise<Buffer> {
   return new Promise((resolve, reject) => {
     const chunks: Buffer[] = [];
-    req.on('data', (c: Buffer) => chunks.push(c));
+    req.on('data', () => undefined);
     req.on('end', () => resolve(Buffer.concat(chunks)));
     req.on('error', reject);
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: expected '' to be 'PDF-PAYLOAD' // Object.is equality

[Killed] ArrowFunction
lib/materials/webhook/fake-materials.controller.ts:17:19
   return new Promise((resolve, reject) => {
     const chunks: Buffer[] = [];
     req.on('data', (c: Buffer) => chunks.push(c));
-    req.on('end', () => resolve(Buffer.concat(chunks)));
+    req.on('end', () => undefined);
     req.on('error', reject);
   });
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:17:12
   return new Promise((resolve, reject) => {
     const chunks: Buffer[] = [];
     req.on('data', (c: Buffer) => chunks.push(c));
-    req.on('end', () => resolve(Buffer.concat(chunks)));
+    req.on("", () => resolve(Buffer.concat(chunks)));
     req.on('error', reject);
   });
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:18:12
     const chunks: Buffer[] = [];
     req.on('data', (c: Buffer) => chunks.push(c));
     req.on('end', () => resolve(Buffer.concat(chunks)));
-    req.on('error', reject);
+    req.on("", reject);
   });
 }

[Killed] BlockStatement
lib/materials/webhook/fake-materials.controller.ts:22:49
   });
 }
 
-function sanitizeFilename(name: string): string {
-  // eslint-disable-next-line no-control-regex
-  return name.replace(/["\\\r\n]/g, '_');
-}
+function sanitizeFilename(name: string): string {}
 
 /**
killedBy: FakeMaterialsController download streams the object back with attachment headers
statusReason: expected 'attachment; filename="undefined"' to contain 'doc.pdf'

[Survived] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:24:37
 
 function sanitizeFilename(name: string): string {
   // eslint-disable-next-line no-control-regex
-  return name.replace(/["\\\r\n]/g, '_');
+  return name.replace(/["\\\r\n]/g, "");
 }
 

[Killed] BlockStatement
lib/materials/webhook/fake-materials.controller.ts:45:28
   async upload(
     @Param('matId') matId: MaterialId,
     @Req() req: Request,
-  ): Promise<{ ok: true }> {
-    const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
-    const buf = await collectStream(req);
-    await this.storage
-      .bucket(material.storage.bucket)
-      .file(material.storage.path)
-      .save(buf, { contentType: material.contentType, resumable: false });
-    return { ok: true };
-  }
+  ): Promise<{ ok: true }> {}
 
   @Get(':matId')
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: expected undefined to deeply equal { ok: true }

[Killed] BooleanLiteral
lib/materials/webhook/fake-materials.controller.ts:52:66
     await this.storage
       .bucket(material.storage.bucket)
       .file(material.storage.path)
-      .save(buf, { contentType: material.contentType, resumable: false });
+      .save(buf, { contentType: material.contentType, resumable: true });
     return { ok: true };
   }
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Buffer>, { …(2) } ]

Received:

  1st vi.fn() call:

  [
-   Any<Buffer>,

[Killed] BooleanLiteral
lib/materials/webhook/fake-materials.controller.ts:53:18
       .bucket(material.storage.bucket)
       .file(material.storage.path)
       .save(buf, { contentType: material.contentType, resumable: false });
-    return { ok: true };
+    return { ok: false };
   }
 
killedBy: FakeMaterialsController upload writes the request body to storage
statusReason: expected { ok: false } to deeply equal { ok: true }

[Killed] BlockStatement
lib/materials/webhook/fake-materials.controller.ts:60:20
   async download(
     @Param('matId') matId: MaterialId,
     @Res() res: Response,
-  ): Promise<void> {
-    const material = await this.repo.get(matId);
-    if (!material) throw new MaterialNotFoundException();
-    const [buf] = await this.storage
-      .bucket(material.storage.bucket)
-      .file(material.storage.path)
-      .download();
-    res.set('Content-Type', material.contentType);
-    res.set(
-      'Content-Disposition',
-      `attachment; filename="${sanitizeFilename(material.originalFilename)}"`,
-    );
-    res.send(buf);
-  }
+  ): Promise<void> {}
 }
 
killedBy: FakeMaterialsController download streams the object back with attachment headers
statusReason: expected undefined to be 'FILE-BYTES' // Object.is equality

[Killed] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:67:13
       .bucket(material.storage.bucket)
       .file(material.storage.path)
       .download();
-    res.set('Content-Type', material.contentType);
+    res.set("", material.contentType);
     res.set(
       'Content-Disposition',
killedBy: FakeMaterialsController download streams the object back with attachment headers
statusReason: expected undefined to be 'application/pdf' // Object.is equality

[Killed] StringLiteral
lib/materials/webhook/fake-materials.controller.ts:70:7
     res.set('Content-Type', material.contentType);
     res.set(
       'Content-Disposition',
-      `attachment; filename="${sanitizeFilename(material.originalFilename)}"`,
+      ``,
     );
     res.send(buf);
killedBy: FakeMaterialsController download streams the object back with attachment headers
statusReason: expected '' to contain 'doc.pdf'
