[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:15:7
   lessonsByModule: Lesson[][],
   videoStateById: Map<VideoId, VideoState>,
 ): PublishEligibility {
-  if (modules.length === 0) {
+  if (true) {
     return {
       eligible: false,
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: true, reasons: [] }

[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:15:7
   lessonsByModule: Lesson[][],
   videoStateById: Map<VideoId, VideoState>,
 ): PublishEligibility {
-  if (modules.length === 0) {
+  if (false) {
     return {
       eligible: false,
killedBy: composeReasons returns COURSE_HAS_NO_MODULES (alone) for an empty course
statusReason: expected { eligible: true, reasons: [] } to deeply equal { eligible: false, …(1) }

[Killed] BooleanLiteral
src/lib/publish/publish-eligibility.ts:17:17
 ): PublishEligibility {
   if (modules.length === 0) {
     return {
-      eligible: false,
+      eligible: true,
       reasons: [{ kind: 'COURSE_HAS_NO_MODULES' }],
     };
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: expected { eligible: true, …(1) } to deeply equal { eligible: false, …(1) }

[Killed] ObjectLiteral
src/lib/publish/publish-eligibility.ts:18:17
   if (modules.length === 0) {
     return {
       eligible: false,
-      reasons: [{ kind: 'COURSE_HAS_NO_MODULES' }],
+      reasons: [{}],
     };
   }
killedBy: composeReasons returns COURSE_HAS_NO_MODULES (alone) for an empty course
statusReason: expected { eligible: false, reasons: [ {} ] } to deeply equal { eligible: false, …(1) }

[Killed] StringLiteral
src/lib/publish/publish-eligibility.ts:18:25
   if (modules.length === 0) {
     return {
       eligible: false,
-      reasons: [{ kind: 'COURSE_HAS_NO_MODULES' }],
+      reasons: [{ kind: "" }],
     };
   }
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: false, …(1) }

[Killed] ArrayDeclaration
src/lib/publish/publish-eligibility.ts:22:41
     };
   }
 
-  const reasons: PublishBlockReason[] = [];
+  const reasons: PublishBlockReason[] = ["Stryker was here"];
 
   for (const [i, m] of modules.entries()) {
killedBy: composeReasons returns MODULE_HAS_NO_LESSONS for a module with zero lessons
statusReason: expected { eligible: false, reasons: [ …(2) ] } to deeply equal { eligible: false, …(1) }

[Killed] LogicalOperator
src/lib/publish/publish-eligibility.ts:25:21
   const reasons: PublishBlockReason[] = [];
 
   for (const [i, m] of modules.entries()) {
-    const lessons = lessonsByModule[i] ?? [];
+    const lessons = lessonsByModule[i] && [];
     const moduleCtx = { moduleId: m.id, moduleTitle: m.title, moduleOrder: m.order };
 
killedBy: composeReasons treats a module with no entry in lessonsByModule as MODULE_HAS_NO_LESSONS
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:28:9
     const lessons = lessonsByModule[i] ?? [];
     const moduleCtx = { moduleId: m.id, moduleTitle: m.title, moduleOrder: m.order };
 
-    if (lessons.length === 0) {
+    if (false) {
       reasons.push({ kind: 'MODULE_HAS_NO_LESSONS', ...moduleCtx });
       continue;
killedBy: composeReasons returns MODULE_HAS_NO_LESSONS for a module with zero lessons
statusReason: expected { eligible: true, reasons: [] } to deeply equal { eligible: false, …(1) }

[Killed] BlockStatement
src/lib/publish/publish-eligibility.ts:28:31
     const lessons = lessonsByModule[i] ?? [];
     const moduleCtx = { moduleId: m.id, moduleTitle: m.title, moduleOrder: m.order };
 
-    if (lessons.length === 0) {
-      reasons.push({ kind: 'MODULE_HAS_NO_LESSONS', ...moduleCtx });
-      continue;
-    }
+    if (lessons.length === 0) {}
 
     for (const l of lessons) {
killedBy: composeReasons returns MODULE_HAS_NO_LESSONS for a module with zero lessons
statusReason: expected { eligible: true, reasons: [] } to deeply equal { eligible: false, …(1) }

[Killed] StringLiteral
src/lib/publish/publish-eligibility.ts:29:28
     const moduleCtx = { moduleId: m.id, moduleTitle: m.title, moduleOrder: m.order };
 
     if (lessons.length === 0) {
-      reasons.push({ kind: 'MODULE_HAS_NO_LESSONS', ...moduleCtx });
+      reasons.push({ kind: "", ...moduleCtx });
       continue;
     }
killedBy: composeReasons returns MODULE_HAS_NO_LESSONS for a module with zero lessons
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: false, …(1) }

[Killed] BlockStatement
src/lib/publish/publish-eligibility.ts:33:30
       continue;
     }
 
-    for (const l of lessons) {
-      const lessonCtx = {
-        ...moduleCtx,
-        lessonId: l.id,
-        lessonTitle: l.title,
-        lessonOrder: l.order,
-      };
-      if (!l.videoId) {
-        reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
-        continue;
-      }
-      const state = videoStateById.get(l.videoId);
-      if (state === undefined) {
-        // Orphan: lesson.videoId set but Video doc missing → fold into LESSON_HAS_NO_VIDEO
-        reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
-        continue;
-      }
-      if (state !== 'READY') {
-        reasons.push({
-          kind: 'LESSON_VIDEO_NOT_READY',
-          ...lessonCtx,
-          currentState: state as Exclude<VideoState, 'READY'>,
-        });
-      }
-    }
+    for (const l of lessons) {}
   }
 
killedBy: composeReasons returns LESSON_HAS_NO_VIDEO when lesson.videoId is undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:40:11
         lessonTitle: l.title,
         lessonOrder: l.order,
       };
-      if (!l.videoId) {
+      if (true) {
         reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
         continue;
killedBy: composeReasons treats a module with no entry in lessonsByModule as MODULE_HAS_NO_LESSONS
statusReason: expected { eligible: false, reasons: [ …(2) ] } to deeply equal { eligible: false, …(1) }

[Killed] BooleanLiteral
src/lib/publish/publish-eligibility.ts:40:11
         lessonTitle: l.title,
         lessonOrder: l.order,
       };
-      if (!l.videoId) {
+      if (l.videoId) {
         reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
         continue;
killedBy: composeReasons treats a module with no entry in lessonsByModule as MODULE_HAS_NO_LESSONS
statusReason: expected { eligible: false, reasons: [ …(2) ] } to deeply equal { eligible: false, …(1) }

[Killed] ObjectLiteral
src/lib/publish/publish-eligibility.ts:41:22
         lessonOrder: l.order,
       };
       if (!l.videoId) {
-        reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
+        reasons.push({});
         continue;
       }
killedBy: composeReasons returns LESSON_HAS_NO_VIDEO when lesson.videoId is undefined
statusReason: expected [ {} ] to deeply equal [ { …(7) } ]

[Killed] EqualityOperator
src/lib/publish/publish-eligibility.ts:45:11
         continue;
       }
       const state = videoStateById.get(l.videoId);
-      if (state === undefined) {
+      if (state !== undefined) {
         // Orphan: lesson.videoId set but Video doc missing → fold into LESSON_HAS_NO_VIDEO
         reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
killedBy: composeReasons treats a module with no entry in lessonsByModule as MODULE_HAS_NO_LESSONS
statusReason: expected { eligible: false, reasons: [ …(2) ] } to deeply equal { eligible: false, …(1) }

[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:45:11
         continue;
       }
       const state = videoStateById.get(l.videoId);
-      if (state === undefined) {
+      if (false) {
         // Orphan: lesson.videoId set but Video doc missing → fold into LESSON_HAS_NO_VIDEO
         reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
killedBy: PublishService.computeEligibility folds VideoNotFoundException into LESSON_HAS_NO_VIDEO (orphan)
statusReason: expected { Object (kind, moduleId, ...) } to match object { kind: 'LESSON_HAS_NO_VIDEO', …(1) }
(6 matching properties omitted from actual)

[Killed] ObjectLiteral
src/lib/publish/publish-eligibility.ts:47:22
       const state = videoStateById.get(l.videoId);
       if (state === undefined) {
         // Orphan: lesson.videoId set but Video doc missing → fold into LESSON_HAS_NO_VIDEO
-        reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
+        reasons.push({});
         continue;
       }
killedBy: composeReasons returns LESSON_HAS_NO_VIDEO when videoId is set but video doc is missing (orphan fold)
statusReason: expected [ {} ] to deeply equal [ { …(7) } ]

[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:50:11
         reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
         continue;
       }
-      if (state !== 'READY') {
+      if (false) {
         reasons.push({
           kind: 'LESSON_VIDEO_NOT_READY',
killedBy: composeReasons returns LESSON_VIDEO_NOT_READY for state PENDING_UPLOAD
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/publish/publish-eligibility.ts:50:30
         reasons.push({ kind: 'LESSON_HAS_NO_VIDEO', ...lessonCtx });
         continue;
       }
-      if (state !== 'READY') {
-        reasons.push({
-          kind: 'LESSON_VIDEO_NOT_READY',
-          ...lessonCtx,
-          currentState: state as Exclude<VideoState, 'READY'>,
-        });
-      }
+      if (state !== 'READY') {}
     }
   }
killedBy: composeReasons returns LESSON_VIDEO_NOT_READY for state PENDING_UPLOAD
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/lib/publish/publish-eligibility.ts:52:17
       }
       if (state !== 'READY') {
         reasons.push({
-          kind: 'LESSON_VIDEO_NOT_READY',
+          kind: "",
           ...lessonCtx,
           currentState: state as Exclude<VideoState, 'READY'>,
killedBy: composeReasons returns LESSON_VIDEO_NOT_READY for state PENDING_UPLOAD
statusReason: expected [ { kind: '', moduleId: 'm1', …(6) } ] to deeply equal [ { …(8) } ]

[Killed] ConditionalExpression
src/lib/publish/publish-eligibility.ts:60:7
     }
   }
 
-  if (reasons.length === 0) {
+  if (true) {
     return { eligible: true, reasons: [] };
   }
killedBy: PublishService.computeEligibility folds VideoNotFoundException into LESSON_HAS_NO_VIDEO (orphan)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/lib/publish/publish-eligibility.ts:60:29
     }
   }
 
-  if (reasons.length === 0) {
-    return { eligible: true, reasons: [] };
-  }
+  if (reasons.length === 0) {}
   return { eligible: false, reasons };
 }
killedBy: composeReasons returns eligible:true with no reasons when every lesson has a READY video
statusReason: expected { eligible: false, reasons: [] } to deeply equal { eligible: true, reasons: [] }

[Killed] BooleanLiteral
src/lib/publish/publish-eligibility.ts:61:24
   }
 
   if (reasons.length === 0) {
-    return { eligible: true, reasons: [] };
+    return { eligible: false, reasons: [] };
   }
   return { eligible: false, reasons };
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: expected { eligible: false, reasons: [] } to deeply equal { eligible: true, reasons: [] }

[Killed] ArrayDeclaration
src/lib/publish/publish-eligibility.ts:61:39
   }
 
   if (reasons.length === 0) {
-    return { eligible: true, reasons: [] };
+    return { eligible: true, reasons: ["Stryker was here"] };
   }
   return { eligible: false, reasons };
killedBy: composeReasons returns eligible:true with no reasons when every lesson has a READY video
statusReason: expected { eligible: true, …(1) } to deeply equal { eligible: true, reasons: [] }

[Killed] BooleanLiteral
src/lib/publish/publish-eligibility.ts:63:22
   if (reasons.length === 0) {
     return { eligible: true, reasons: [] };
   }
-  return { eligible: false, reasons };
+  return { eligible: true, reasons };
 }
 
killedBy: composeReasons returns MODULE_HAS_NO_LESSONS for a module with zero lessons
statusReason: expected { eligible: true, …(1) } to deeply equal { eligible: false, …(1) }
