[Killed] BlockStatement
src/lib/publish/publish.service.ts:29:47
   return new Date().toISOString() as ISODateString;
 }
 
-function isVideoNotFound(e: unknown): boolean {
-  // Detects a "video not found" error structurally (by name/message) so an
-  // orphan lesson.videoId — one pointing at a deleted Video — folds into a
-  // LESSON_HAS_NO_VIDEO reason instead of aborting eligibility computation.
-  return e instanceof Error && (e.name === 'VideoNotFoundException' || /not found/i.test(e.message));
-}
+function isVideoNotFound(e: unknown): boolean {}
 
 @Injectable()
killedBy: PublishService.computeEligibility folds VideoNotFoundException into LESSON_HAS_NO_VIDEO (orphan)
statusReason: Video not found.

[Killed] EqualityOperator
src/lib/publish/publish.service.ts:33:33
   // Detects a "video not found" error structurally (by name/message) so an
   // orphan lesson.videoId — one pointing at a deleted Video — folds into a
   // LESSON_HAS_NO_VIDEO reason instead of aborting eligibility computation.
-  return e instanceof Error && (e.name === 'VideoNotFoundException' || /not found/i.test(e.message));
+  return e instanceof Error && (e.name !== 'VideoNotFoundException' || /not found/i.test(e.message));
 }
 
killedBy: PublishService.computeEligibility folds an error by name even when its message has no "not found" text
statusReason: the requested resource is gone

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:33:10
   // Detects a "video not found" error structurally (by name/message) so an
   // orphan lesson.videoId — one pointing at a deleted Video — folds into a
   // LESSON_HAS_NO_VIDEO reason instead of aborting eligibility computation.
-  return e instanceof Error && (e.name === 'VideoNotFoundException' || /not found/i.test(e.message));
+  return true;
 }
 
killedBy: PublishService.computeEligibility rethrows an unrelated getVideo error instead of folding it
statusReason: promise resolved "{ eligible: false, …(1) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:48:9
   async computeEligibility(cid: CourseId): Promise<PublishEligibility> {
     const course = await this.repo.getCourse(cid);
     if (!course) throw new CourseNotFoundException();
-    if (course.status === 'ARCHIVED') throw new CourseArchivedException();
+    if (true) throw new CourseArchivedException();
 
     const modules = await this.repo.listModulesByCourse(cid);
killedBy: PublishService.computeEligibility returns COURSE_HAS_NO_MODULES for a course with no modules
statusReason: Cannot check publish eligibility on an archived course.

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:48:9
   async computeEligibility(cid: CourseId): Promise<PublishEligibility> {
     const course = await this.repo.getCourse(cid);
     if (!course) throw new CourseNotFoundException();
-    if (course.status === 'ARCHIVED') throw new CourseArchivedException();
+    if (false) throw new CourseArchivedException();
 
     const modules = await this.repo.listModulesByCourse(cid);
killedBy: PublishService.computeEligibility throws CourseArchivedException when status === ARCHIVED
statusReason: expected TypeError: Cannot read properties of unde… to match object { Object (code, status) }

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:52:19
 
     const modules = await this.repo.listModulesByCourse(cid);
     const lessonsByModule = await Promise.all(
-      modules.map((m) => this.repo.listLessonsByModule(cid, m.id)),
+      modules.map(() => undefined),
     );
     const allLessons = lessonsByModule.flat();
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: Cannot read properties of undefined (reading 'videoId')

[Killed] MethodExpression
src/lib/publish/publish.service.ts:56:18
     );
     const allLessons = lessonsByModule.flat();
     const uniqueVideoIds = [
-      ...new Set(allLessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
+      ...new Set(allLessons.map(l => l.videoId)),
     ];
     const videos = await Promise.all(
killedBy: PublishService.computeEligibility does not read a video for a lesson with no videoId
statusReason: expected "vi.fn()" to not be called with arguments: [ undefined ]

Received:

  1st vi.fn() call:

  [
-   undefined,

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:56:58
     );
     const allLessons = lessonsByModule.flat();
     const uniqueVideoIds = [
-      ...new Set(allLessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
+      ...new Set(allLessons.map((l) => l.videoId).filter(() => undefined)),
     ];
     const videos = await Promise.all(
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: true, reasons: [] }

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:59:26
       ...new Set(allLessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
     ];
     const videos = await Promise.all(
-      uniqueVideoIds.map((vid) =>
-        this.videoSvc.getVideo(vid).catch((e) => {
-          if (isVideoNotFound(e)) return null;
-          throw e;
-        }),
+      uniqueVideoIds.map(() => undefined,
       ),
     );
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:60:50
     ];
     const videos = await Promise.all(
       uniqueVideoIds.map((vid) =>
-        this.videoSvc.getVideo(vid).catch((e) => {
-          if (isVideoNotFound(e)) return null;
-          throw e;
-        }),
+        this.videoSvc.getVideo(vid).catch((e) => {}),
       ),
     );
killedBy: PublishService.computeEligibility folds VideoNotFoundException into LESSON_HAS_NO_VIDEO (orphan)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:61:15
     const videos = await Promise.all(
       uniqueVideoIds.map((vid) =>
         this.videoSvc.getVideo(vid).catch((e) => {
-          if (isVideoNotFound(e)) return null;
+          if (true) return null;
           throw e;
         }),
killedBy: PublishService.computeEligibility rethrows an unrelated getVideo error instead of folding it
statusReason: promise resolved "{ eligible: false, …(1) }" instead of rejecting

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:61:15
     const videos = await Promise.all(
       uniqueVideoIds.map((vid) =>
         this.videoSvc.getVideo(vid).catch((e) => {
-          if (isVideoNotFound(e)) return null;
+          if (false) return null;
           throw e;
         }),
killedBy: PublishService.computeEligibility folds VideoNotFoundException into LESSON_HAS_NO_VIDEO (orphan)
statusReason: Video not found.

[Killed] EqualityOperator
src/lib/publish/publish.service.ts:67:40
       ),
     );
     const videoStateById = new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
+      videos.filter((v): v is Video => v === null).map((v) => [v.id, v.state]),
     );
 
killedBy: PublishService.computeEligibility returns eligible:true when every lesson has a READY video
statusReason: expected { eligible: false, …(1) } to deeply equal { eligible: true, reasons: [] }

[Killed] MethodExpression
src/lib/publish/publish.service.ts:67:7
       ),
     );
     const videoStateById = new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
+      videos.map((v) => [v.id, v.state]),
     );
 
killedBy: PublishService.computeEligibility folds VideoNotFoundException into LESSON_HAS_NO_VIDEO (orphan)
statusReason: Cannot read properties of null (reading 'id')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:73:49
     return composeReasons(modules, lessonsByModule, videoStateById);
   }
 
-  async publish(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT') {
-        throw new InvalidTransitionException(course.status, 'PUBLISHED');
-      }
-      const eligibility = await this.computeEligibilityInTxn(t, cid);
-      if (!eligibility.eligible) {
-        throw new PublishNotEligibleException(eligibility.reasons);
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'PUBLISHED', {
-        publishedAt: nowIso(),
-      });
-    });
-  }
+  async publish(cid: CourseId): Promise<Course> {}
 
   async unpublish(cid: CourseId): Promise<Course> {
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:74:55
   }
 
   async publish(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT') {
-        throw new InvalidTransitionException(course.status, 'PUBLISHED');
-      }
-      const eligibility = await this.computeEligibilityInTxn(t, cid);
-      if (!eligibility.eligible) {
-        throw new PublishNotEligibleException(eligibility.reasons);
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'PUBLISHED', {
-        publishedAt: nowIso(),
-      });
-    });
+    return this.firestore.runTransaction(async (t) => {});
   }
 
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:76:11
   async publish(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT') {
+      if (false) {
         throw new InvalidTransitionException(course.status, 'PUBLISHED');
       }
killedBy: PublishService.publish throws InvalidTransitionException when source state is not DRAFT
statusReason: expected TypeError: this.repo.listModulesByCourseI… to match object { code: 'INVALID_TRANSITION', …(1) }

[Killed] BlockStatement
src/lib/publish/publish.service.ts:76:38
   async publish(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT') {
-        throw new InvalidTransitionException(course.status, 'PUBLISHED');
-      }
+      if (course.status !== 'DRAFT') {}
       const eligibility = await this.computeEligibilityInTxn(t, cid);
       if (!eligibility.eligible) {
killedBy: PublishService.publish throws InvalidTransitionException when source state is not DRAFT
statusReason: expected TypeError: this.repo.listModulesByCourseI… to match object { code: 'INVALID_TRANSITION', …(1) }

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:80:11
         throw new InvalidTransitionException(course.status, 'PUBLISHED');
       }
       const eligibility = await this.computeEligibilityInTxn(t, cid);
-      if (!eligibility.eligible) {
+      if (false) {
         throw new PublishNotEligibleException(eligibility.reasons);
       }
killedBy: PublishService.publish throws PublishNotEligibleException with reasons when revalidation fails
statusReason: expected TypeError: this.repo.updateStatusInTxn is… to match object { code: 'PUBLISH_NOT_ELIGIBLE', …(1) }

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:80:11
         throw new InvalidTransitionException(course.status, 'PUBLISHED');
       }
       const eligibility = await this.computeEligibilityInTxn(t, cid);
-      if (!eligibility.eligible) {
+      if (true) {
         throw new PublishNotEligibleException(eligibility.reasons);
       }
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Course does not meet publish requirements.

[Killed] BlockStatement
src/lib/publish/publish.service.ts:89:51
     });
   }
 
-  async unpublish(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'PUBLISHED') {
-        throw new InvalidTransitionException(course.status, 'DRAFT');
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'DRAFT', {});
-    });
-  }
+  async unpublish(cid: CourseId): Promise<Course> {}
 
   async archive(cid: CourseId): Promise<Course> {
killedBy: PublishService.unpublish transitions PUBLISHED → DRAFT, preserves publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:90:55
   }
 
   async unpublish(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'PUBLISHED') {
-        throw new InvalidTransitionException(course.status, 'DRAFT');
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'DRAFT', {});
-    });
+    return this.firestore.runTransaction(async (t) => {});
   }
 
killedBy: PublishService.unpublish transitions PUBLISHED → DRAFT, preserves publishedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:92:11
   async unpublish(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'PUBLISHED') {
+      if (true) {
         throw new InvalidTransitionException(course.status, 'DRAFT');
       }
killedBy: PublishService.unpublish transitions PUBLISHED → DRAFT, preserves publishedAt
statusReason: Cannot transition from PUBLISHED to DRAFT.

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:92:11
   async unpublish(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'PUBLISHED') {
+      if (false) {
         throw new InvalidTransitionException(course.status, 'DRAFT');
       }
killedBy: PublishService.unpublish throws InvalidTransitionException when source is not PUBLISHED
statusReason: expected TypeError: this.repo.updateStatusInTxn is… to match object { code: 'INVALID_TRANSITION', …(1) }

[Killed] BlockStatement
src/lib/publish/publish.service.ts:99:49
     });
   }
 
-  async archive(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT' && course.status !== 'PUBLISHED') {
-        throw new InvalidTransitionException(course.status, 'ARCHIVED');
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'ARCHIVED', {
-        archivedAt: nowIso(),
-      });
-    });
-  }
+  async archive(cid: CourseId): Promise<Course> {}
 
   async restore(cid: CourseId): Promise<Course> {
killedBy: PublishService.archive archives a DRAFT course, sets archivedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:100:55
   }
 
   async archive(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT' && course.status !== 'PUBLISHED') {
-        throw new InvalidTransitionException(course.status, 'ARCHIVED');
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'ARCHIVED', {
-        archivedAt: nowIso(),
-      });
-    });
+    return this.firestore.runTransaction(async (t) => {});
   }
 
killedBy: PublishService.archive archives a DRAFT course, sets archivedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:102:11
   async archive(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT' && course.status !== 'PUBLISHED') {
+      if (false) {
         throw new InvalidTransitionException(course.status, 'ARCHIVED');
       }
killedBy: PublishService.archive throws InvalidTransitionException when already ARCHIVED
statusReason: expected TypeError: this.repo.updateStatusInTxn is… to match object { code: 'INVALID_TRANSITION', …(1) }

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:102:40
   async archive(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'DRAFT' && course.status !== 'PUBLISHED') {
+      if (course.status !== 'DRAFT' && true) {
         throw new InvalidTransitionException(course.status, 'ARCHIVED');
       }
killedBy: PublishService.archive archives a PUBLISHED course, sets archivedAt
statusReason: Cannot transition from PUBLISHED to ARCHIVED.

[Killed] ObjectLiteral
src/lib/publish/publish.service.ts:105:62
       if (course.status !== 'DRAFT' && course.status !== 'PUBLISHED') {
         throw new InvalidTransitionException(course.status, 'ARCHIVED');
       }
-      return this.repo.updateStatusInTxn(t, cid, 'ARCHIVED', {
-        archivedAt: nowIso(),
-      });
+      return this.repo.updateStatusInTxn(t, cid, 'ARCHIVED', {});
     });
   }
killedBy: PublishService.archive archives a DRAFT course, sets archivedAt
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/lib/publish/publish.service.ts:111:49
     });
   }
 
-  async restore(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'ARCHIVED') {
-        throw new InvalidTransitionException(course.status, 'DRAFT');
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'DRAFT', { archivedAt: null });
-    });
-  }
+  async restore(cid: CourseId): Promise<Course> {}
 
   /**
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] BlockStatement
src/lib/publish/publish.service.ts:112:55
   }
 
   async restore(cid: CourseId): Promise<Course> {
-    return this.firestore.runTransaction(async (t) => {
-      const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'ARCHIVED') {
-        throw new InvalidTransitionException(course.status, 'DRAFT');
-      }
-      return this.repo.updateStatusInTxn(t, cid, 'DRAFT', { archivedAt: null });
-    });
+    return this.firestore.runTransaction(async (t) => {});
   }
 
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
src/lib/publish/publish.service.ts:114:11
   async restore(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'ARCHIVED') {
+      if (course.status === 'ARCHIVED') {
         throw new InvalidTransitionException(course.status, 'DRAFT');
       }
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: Cannot transition from ARCHIVED to DRAFT.

[Killed] ConditionalExpression
src/lib/publish/publish.service.ts:114:11
   async restore(cid: CourseId): Promise<Course> {
     return this.firestore.runTransaction(async (t) => {
       const course = await this.repo.getCourseInTxn(t, cid);
-      if (course.status !== 'ARCHIVED') {
+      if (true) {
         throw new InvalidTransitionException(course.status, 'DRAFT');
       }
killedBy: PublishService.restore transitions ARCHIVED → DRAFT, clears archivedAt
statusReason: Cannot transition from ARCHIVED to DRAFT.

[Killed] BlockStatement
src/lib/publish/publish.service.ts:129:34
   private async computeEligibilityInTxn(
     t: adminFirestore.Transaction,
     cid: CourseId,
-  ): Promise<PublishEligibility> {
-    const modules = await this.repo.listModulesByCourseInTxn(t, cid);
-    const lessonsByModule = await Promise.all(
-      modules.map((m) => this.repo.listLessonsByModuleInTxn(t, cid, m.id)),
-    );
-    const allLessons = lessonsByModule.flat();
-    const uniqueVideoIds = [
-      ...new Set(allLessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
-    ];
-    const videos = await Promise.all(
-      uniqueVideoIds.map((vid) =>
-        this.videoSvc.getVideo(vid).catch((e) => {
-          if (isVideoNotFound(e)) return null;
-          throw e;
-        }),
-      ),
-    );
-    const videoStateById = new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
-    );
-    return composeReasons(modules, lessonsByModule, videoStateById);
-  }
+  ): Promise<PublishEligibility> {}
 }
 
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'eligible')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:132:19
   ): Promise<PublishEligibility> {
     const modules = await this.repo.listModulesByCourseInTxn(t, cid);
     const lessonsByModule = await Promise.all(
-      modules.map((m) => this.repo.listLessonsByModuleInTxn(t, cid, m.id)),
+      modules.map(() => undefined),
     );
     const allLessons = lessonsByModule.flat();
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Cannot read properties of undefined (reading 'videoId')

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:136:33
     );
     const allLessons = lessonsByModule.flat();
     const uniqueVideoIds = [
-      ...new Set(allLessons.map((l) => l.videoId).filter((v): v is VideoId => Boolean(v))),
+      ...new Set(allLessons.map(() => undefined).filter((v): v is VideoId => Boolean(v))),
     ];
     const videos = await Promise.all(
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Course does not meet publish requirements.

[Killed] ArrowFunction
src/lib/publish/publish.service.ts:147:56
       ),
     );
     const videoStateById = new Map<VideoId, VideoState>(
-      videos.filter((v): v is Video => v !== null).map((v) => [v.id, v.state]),
+      videos.filter((v): v is Video => v !== null).map(() => undefined),
     );
     return composeReasons(modules, lessonsByModule, videoStateById);
killedBy: PublishService.publish publishes a DRAFT course when eligible, setting publishedAt
statusReason: Iterator value undefined is not an entry object
