[Killed] BlockStatement
lib/video/errors/video.exception.ts:16:17
 }
 
 export class VideoNotFoundException extends VideoException {
-  constructor() {
-    super('VIDEO_NOT_FOUND', 'Video not found.', 404);
-  }
+  constructor() {}
 }
 
killedBy: VideoService.getVideo throws VIDEO_NOT_FOUND when the repo has no such video
statusReason: expected ReferenceError: Must call super construct… to be an instance of VideoNotFoundException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:17:30
 
 export class VideoNotFoundException extends VideoException {
   constructor() {
-    super('VIDEO_NOT_FOUND', 'Video not found.', 404);
+    super('VIDEO_NOT_FOUND', "", 404);
   }
 }
killedBy: Video exceptions exposes the expected code, status, and message
statusReason: expected '' to be 'Video not found.' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:22:17
 }
 
 export class NotVideoOwnerException extends VideoException {
-  constructor() {
-    super('NOT_VIDEO_OWNER', 'You do not own this video.', 403);
-  }
+  constructor() {}
 }
 
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: expected ReferenceError: Must call super construct… to be an instance of NotVideoOwnerException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:23:30
 
 export class NotVideoOwnerException extends VideoException {
   constructor() {
-    super('NOT_VIDEO_OWNER', 'You do not own this video.', 403);
+    super('NOT_VIDEO_OWNER', "", 403);
   }
 }
killedBy: Video exceptions exposes the expected code, status, and message
statusReason: expected '' to be 'You do not own this video.' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:28:17
 }
 
 export class LessonAlreadyHasVideoException extends VideoException {
-  constructor() {
-    super(
-      'LESSON_ALREADY_HAS_VIDEO',
-      'This lesson already has a video. Replace flow is not yet supported.',
-      409,
-    );
-  }
+  constructor() {}
 }
 
killedBy: VideoService.createUploadSession rejects when the lesson already has a video
statusReason: expected ReferenceError: Must call super construct… to be an instance of LessonAlreadyHasVideoException

[Killed] BlockStatement
lib/video/errors/video.exception.ts:38:37
 }
 
 export class InvalidVideoStateException extends VideoException {
-  constructor(currentState: string) {
-    super(
-      'INVALID_VIDEO_STATE',
-      `Operation is not valid in state ${currentState}.`,
-      409,
-      { currentState },
-    );
-  }
+  constructor(currentState: string) {}
 }
 
killedBy: VideoService.completeUpload — slice A (guard tests) throws INVALID_VIDEO_STATE when video is not PENDING_UPLOAD
statusReason: expected ReferenceError: Must call super construct… to be an instance of InvalidVideoStateException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:40:7
 export class InvalidVideoStateException extends VideoException {
   constructor(currentState: string) {
     super(
-      'INVALID_VIDEO_STATE',
+      "",
       `Operation is not valid in state ${currentState}.`,
       409,
killedBy: Video exceptions exposes the expected code, status, and message
statusReason: expected '' to be 'INVALID_VIDEO_STATE' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:49:17
 }
 
 export class UploadObjectMissingException extends VideoException {
-  constructor() {
-    super(
-      'UPLOAD_OBJECT_MISSING',
-      'No source object exists at the upload destination.',
-      422,
-    );
-  }
+  constructor() {}
 }
 
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_MISSING when HEAD returns null
statusReason: expected ReferenceError: Must call super construct… to be an instance of UploadObjectMissingException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:52:7
   constructor() {
     super(
       'UPLOAD_OBJECT_MISSING',
-      'No source object exists at the upload destination.',
+      "",
       422,
     );
killedBy: Video exceptions exposes the expected code, status, and message
statusReason: expected '' to be 'No source object exists at the upload…' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:59:17
 }
 
 export class UploadObjectSizeMismatchException extends VideoException {
-  constructor() {
-    super(
-      'UPLOAD_OBJECT_SIZE_MISMATCH',
-      'Uploaded object size exceeds declared size by more than the allowed tolerance.',
-      422,
-    );
-  }
+  constructor() {}
 }
 
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes object when over tolerance
statusReason: expected ReferenceError: Must call super construct… to be an instance of UploadObjectSizeMismatchException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:61:7
 export class UploadObjectSizeMismatchException extends VideoException {
   constructor() {
     super(
-      'UPLOAD_OBJECT_SIZE_MISMATCH',
+      "",
       'Uploaded object size exceeds declared size by more than the allowed tolerance.',
       422,
killedBy: Video exceptions exposes the expected code, status, and message
statusReason: expected '' to be 'UPLOAD_OBJECT_SIZE_MISMATCH' // Object.is equality

[Killed] StringLiteral
lib/video/errors/video.exception.ts:62:7
   constructor() {
     super(
       'UPLOAD_OBJECT_SIZE_MISMATCH',
-      'Uploaded object size exceeds declared size by more than the allowed tolerance.',
+      "",
       422,
     );
killedBy: Video exceptions exposes the expected code, status, and message
statusReason: expected '' to be 'Uploaded object size exceeds declared…' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:69:32
 }
 
 export class PubSubInvalidTokenException extends VideoException {
-  constructor(detail?: string) {
-    super(
-      'PUBSUB_INVALID_TOKEN',
-      detail ? `Pub/Sub OIDC token invalid: ${detail}.` : 'Pub/Sub OIDC token invalid.',
-      401,
-    );
-  }
+  constructor(detail?: string) {}
 }
 
killedBy: PubSubPushGuard rejects when Authorization header is missing
statusReason: expected ReferenceError: Must call super construct… to be an instance of PubSubInvalidTokenException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:72:16
   constructor(detail?: string) {
     super(
       'PUBSUB_INVALID_TOKEN',
-      detail ? `Pub/Sub OIDC token invalid: ${detail}.` : 'Pub/Sub OIDC token invalid.',
+      detail ? `` : 'Pub/Sub OIDC token invalid.',
       401,
     );
killedBy: PubSubPushGuard rejects when the Authorization header is an array, not a string
statusReason: expected VideoException { …(3) } to match object { code: 'PUBSUB_INVALID_TOKEN', …(1) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
lib/video/errors/video.exception.ts:79:17
 }
 
 export class PubSubWrongAudienceException extends VideoException {
-  constructor() {
-    super(
-      'PUBSUB_WRONG_AUDIENCE',
-      'Pub/Sub OIDC token audience does not match the configured webhook URL.',
-      403,
-    );
-  }
+  constructor() {}
 }
 
killedBy: PubSubPushGuard rejects when audience does not match
statusReason: expected ReferenceError: Must call super construct… to be an instance of PubSubWrongAudienceException

[Killed] StringLiteral
lib/video/errors/video.exception.ts:81:7
 export class PubSubWrongAudienceException extends VideoException {
   constructor() {
     super(
-      'PUBSUB_WRONG_AUDIENCE',
+      "",
       'Pub/Sub OIDC token audience does not match the configured webhook URL.',
       403,
killedBy: Pub/Sub exceptions PubSubWrongAudienceException has status 403 and correct code
statusReason: expected '' to be 'PUBSUB_WRONG_AUDIENCE' // Object.is equality

[Killed] StringLiteral
lib/video/errors/video.exception.ts:82:7
   constructor() {
     super(
       'PUBSUB_WRONG_AUDIENCE',
-      'Pub/Sub OIDC token audience does not match the configured webhook URL.',
+      "",
       403,
     );
killedBy: Pub/Sub exceptions PubSubWrongAudienceException has status 403 and correct code
statusReason: expected '' to be 'Pub/Sub OIDC token audience does not …' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:89:17
 }
 
 export class PubSubWrongInvokerException extends VideoException {
-  constructor() {
-    super(
-      'PUBSUB_WRONG_INVOKER',
-      'Pub/Sub OIDC token email does not match the configured invoker service account.',
-      403,
-    );
-  }
+  constructor() {}
 }
 
killedBy: PubSubPushGuard rejects when invoker email does not match
statusReason: expected ReferenceError: Must call super construct… to be an instance of PubSubWrongInvokerException

[Killed] BlockStatement
lib/video/errors/video.exception.ts:99:34
 }
 
 export class RenditionNotFoundException extends VideoException {
-  constructor(rendition: string) {
-    super(
-      'RENDITION_NOT_FOUND',
-      `Rendition "${rendition}" is not available.`,
-      404,
-      { rendition },
-    );
-  }
+  constructor(rendition: string) {}
 }
 
killedBy: slice C exceptions RenditionNotFoundException → 404 RENDITION_NOT_FOUND carries rendition detail
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
lib/video/errors/video.exception.ts:110:37
 }
 
 export class VideoNotReadyException extends VideoException {
-  constructor(currentState: string) {
-    super(
-      'VIDEO_NOT_READY',
-      `Video is not ready for playback (current state: ${currentState}).`,
-      409,
-      { currentState },
-    );
-  }
+  constructor(currentState: string) {}
 }
 
killedBy: slice C exceptions VideoNotReadyException → 409 VIDEO_NOT_READY carries currentState
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
lib/video/errors/video.exception.ts:112:7
 export class VideoNotReadyException extends VideoException {
   constructor(currentState: string) {
     super(
-      'VIDEO_NOT_READY',
+      "",
       `Video is not ready for playback (current state: ${currentState}).`,
       409,
killedBy: slice C exceptions VideoNotReadyException → 409 VIDEO_NOT_READY carries currentState
statusReason: expected '' to be 'VIDEO_NOT_READY' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:121:32
 }
 
 export class KeyLookupFailedException extends VideoException {
-  constructor(detail?: string) {
-    super(
-      'KEY_LOOKUP_FAILED',
-      detail ? `Encryption key lookup failed: ${detail}.` : 'Encryption key lookup failed.',
-      500,
-    );
-  }
+  constructor(detail?: string) {}
 }
 
killedBy: slice C exceptions KeyLookupFailedException → 500 KEY_LOOKUP_FAILED, generic message without detail
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
lib/video/errors/video.exception.ts:123:7
 export class KeyLookupFailedException extends VideoException {
   constructor(detail?: string) {
     super(
-      'KEY_LOOKUP_FAILED',
+      "",
       detail ? `Encryption key lookup failed: ${detail}.` : 'Encryption key lookup failed.',
       500,
killedBy: slice C exceptions KeyLookupFailedException → 500 KEY_LOOKUP_FAILED, generic message without detail
statusReason: expected '' to be 'KEY_LOOKUP_FAILED' // Object.is equality

[Killed] BlockStatement
lib/video/errors/video.exception.ts:131:31
 }
 
 export class ManifestParseFailedException extends VideoException {
-  constructor(detail: string) {
-    super(
-      'MANIFEST_PARSE_FAILED',
-      `Manifest parse failed: ${detail}.`,
-      502,
-    );
-  }
+  constructor(detail: string) {}
 }
 
killedBy: slice C exceptions ManifestParseFailedException → 502 MANIFEST_PARSE_FAILED carries detail
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] StringLiteral
lib/video/errors/video.exception.ts:133:7
 export class ManifestParseFailedException extends VideoException {
   constructor(detail: string) {
     super(
-      'MANIFEST_PARSE_FAILED',
+      "",
       `Manifest parse failed: ${detail}.`,
       502,
killedBy: slice C exceptions ManifestParseFailedException → 502 MANIFEST_PARSE_FAILED carries detail
statusReason: expected '' to be 'MANIFEST_PARSE_FAILED' // Object.is equality
