[Killed] ConditionalExpression
lib/video/playback/current-video.decorator.ts:17:7
   ctx: ExecutionContext,
 ): Video {
   const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-  if (!req.video) {
+  if (false) {
     throw new Error(
       '@CurrentVideo() used on a route without EnrollmentOrOwnerGuard.',
killedBy: currentVideoFactory (the @CurrentVideo param-decorator factory) throws when req.video is missing (guard skipped)
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
lib/video/playback/current-video.decorator.ts:17:7
   ctx: ExecutionContext,
 ): Video {
   const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-  if (!req.video) {
+  if (req.video) {
     throw new Error(
       '@CurrentVideo() used on a route without EnrollmentOrOwnerGuard.',
killedBy: currentVideoFactory (the @CurrentVideo param-decorator factory) returns req.video when EnrollmentOrOwnerGuard has attached it
statusReason: @CurrentVideo() used on a route without EnrollmentOrOwnerGuard.
