[Killed] ConditionalExpression
lib/video/playback/enrollment-or-owner.guard.ts:26:9
     if (!video) throw new VideoNotFoundException();
     if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
 
-    if (video.ownerInstructorId === req.user?.uid) {
+    if (false) {
       req.video = video;
       return true;
killedBy: EnrollmentOrOwnerGuard attaches video and returns true when requester is the owner
statusReason: promise rejected "VideoException: You do not own this video. { …(3) }" instead of resolving
