[Killed] BlockStatement
lib/video/playback/key.service.ts:13:23
   constructor(private readonly repo: VideoRepository) {}
 
   async fetch(video: Video): Promise<Buffer> {
-    if (!video.keyId) {
-      throw new KeyLookupFailedException('video has no keyId');
-    }
+    if (!video.keyId) {}
     const doc = await this.repo.getVideoKey(video.keyId);
     if (!doc) {
killedBy: KeyService.fetch throws KEY_LOOKUP_FAILED when keyId is missing on the video
statusReason: promise resolved "Buffer[ 1, 2, 3, 4, 5, 6, 7, 8, …(8) ]" instead of rejecting

[Killed] ConditionalExpression
lib/video/playback/key.service.ts:13:9
   constructor(private readonly repo: VideoRepository) {}
 
   async fetch(video: Video): Promise<Buffer> {
-    if (!video.keyId) {
+    if (true) {
       throw new KeyLookupFailedException('video has no keyId');
     }
killedBy: KeyService.fetch returns 16-byte Buffer for a healthy video
statusReason: Encryption key lookup failed: video has no keyId.

[Killed] BlockStatement
lib/video/playback/key.service.ts:17:15
       throw new KeyLookupFailedException('video has no keyId');
     }
     const doc = await this.repo.getVideoKey(video.keyId);
-    if (!doc) {
-      throw new KeyLookupFailedException(`videoKeys/${video.keyId} missing`);
-    }
+    if (!doc) {}
     return Buffer.from(doc.key, 'base64');
   }
killedBy: KeyService.fetch throws KEY_LOOKUP_FAILED when the key document is absent
statusReason: expected TypeError: Cannot read properties of null… to be an instance of KeyLookupFailedException
