[Killed] ConditionalExpression
lib/video/playback/manifest.rewriter.ts:13:7
 }
 
 function assertM3u8Header(body: string): void {
-  if (!body.startsWith('#EXTM3U')) {
+  if (false) {
     throw new ManifestParseFailedException('missing #EXTM3U header');
   }
killedBy: rewriteMaster throws ManifestParseFailedException on missing #EXTM3U header
statusReason: expected function to throw an error, but it didn't

[Killed] MethodExpression
lib/video/playback/manifest.rewriter.ts:13:8
 }
 
 function assertM3u8Header(body: string): void {
-  if (!body.startsWith('#EXTM3U')) {
+  if (!body.endsWith('#EXTM3U')) {
     throw new ManifestParseFailedException('missing #EXTM3U header');
   }
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Manifest parse failed: missing #EXTM3U header.

[Killed] StringLiteral
lib/video/playback/manifest.rewriter.ts:14:44
 
 function assertM3u8Header(body: string): void {
   if (!body.startsWith('#EXTM3U')) {
-    throw new ManifestParseFailedException('missing #EXTM3U header');
+    throw new ManifestParseFailedException("");
   }
 }
killedBy: rewriteMaster throws with the exact "missing #EXTM3U" message on a non-#EXTM3U start
statusReason: expected [Function] to throw error matching /missing #EXTM3U/ but got 'Manifest parse failed: .'

[Killed] ConditionalExpression
lib/video/playback/manifest.rewriter.ts:21:7
 function renditionNameFromUri(uri: string): string {
   // Expect 'X/playlist.m3u8' (single segment), produced by Transcoder API.
   const slash = uri.indexOf('/');
-  if (slash <= 0) {
+  if (false) {
     throw new ManifestParseFailedException(
       `cannot extract rendition name from URI "${uri}"`,
killedBy: rewriteMaster throws when the URI line starts with a leading slash (slash position 0)
statusReason: expected [Function] to throw error matching /cannot extract rendition name/ but got 'Manifest parse failed: unknown rendit…'

[Killed] StringLiteral
lib/video/playback/manifest.rewriter.ts:23:7
   const slash = uri.indexOf('/');
   if (slash <= 0) {
     throw new ManifestParseFailedException(
-      `cannot extract rendition name from URI "${uri}"`,
+      ``,
     );
   }
killedBy: rewriteMaster throws when the URI line starts with a leading slash (slash position 0)
statusReason: expected [Function] to throw error matching /cannot extract rendition name/ but got 'Manifest parse failed: .'

[Killed] EqualityOperator
lib/video/playback/manifest.rewriter.ts:33:19
   assertM3u8Header(masterBody);
   const out: string[] = [];
   const lines = masterBody.split('\n');
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; i <= lines.length; i++) {
     const line = lines[i]!;
     out.push(line);
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
lib/video/playback/manifest.rewriter.ts:36:9
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i]!;
     out.push(line);
-    if (line.startsWith('#EXT-X-STREAM-INF')) {
+    if (false) {
       const nextIdx = i + 1;
       const uri = lines[nextIdx]?.trim();
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: expected [ Array(12) ] to include '/api/playback/manifest/v123/rendition…'

[Killed] MethodExpression
lib/video/playback/manifest.rewriter.ts:39:19
     if (line.startsWith('#EXT-X-STREAM-INF')) {
       const nextIdx = i + 1;
       const uri = lines[nextIdx]?.trim();
-      if (!uri || uri.startsWith('#')) {
+      if (!uri || uri.endsWith('#')) {
         throw new ManifestParseFailedException(
           'expected URI line after #EXT-X-STREAM-INF',
killedBy: rewriteMaster trims the URI lookahead so a leading-whitespace "#" line is rejected as no-URI
statusReason: expected [Function] to throw error matching /expected URI line after #EXT-X-STREAM…/ but got 'Manifest parse failed: cannot extract…'

[Killed] StringLiteral
lib/video/playback/manifest.rewriter.ts:47:11
       const rendition = renditionNameFromUri(uri);
       if (!isAllowedRendition(rendition)) {
         throw new ManifestParseFailedException(
-          `unknown rendition "${rendition}" in master`,
+          ``,
         );
       }
killedBy: rewriteMaster throws when a rendition is outside the allow-list
statusReason: expected [Function] to throw error matching /240p/ but got 'Manifest parse failed: .'

[Killed] BooleanLiteral
lib/video/playback/manifest.rewriter.ts:61:7
 
 function isSegmentUri(line: string): boolean {
   const t = line.trim();
-  if (!t) return false;
+  if (t) return false;
   if (t.startsWith('#')) return false;
   if (t.startsWith('http://') || t.startsWith('https://')) return false;
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [ '' ] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] LogicalOperator
lib/video/playback/manifest.rewriter.ts:63:7
   const t = line.trim();
   if (!t) return false;
   if (t.startsWith('#')) return false;
-  if (t.startsWith('http://') || t.startsWith('https://')) return false;
+  if (t.startsWith('http://') && t.startsWith('https://')) return false;
   return true;
 }
killedBy: rewriteRendition does not double-sign already-signed URIs (http/https)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "https://storage.googleapis.com/b/segment_001.ts?signature=xyz",

[Killed] StringLiteral
lib/video/playback/manifest.rewriter.ts:79:37
 ): Promise<string> {
   assertM3u8Header(renditionBody);
   const out: string[] = [];
-  const lines = renditionBody.split('\n');
+  const lines = renditionBody.split("");
   for (const line of lines) {
     if (line.startsWith('#EXT-X-KEY')) {
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '#\nsigned://E\nsigned://X\nsigned://T…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'

[Killed] MethodExpression
lib/video/playback/manifest.rewriter.ts:81:9
   const out: string[] = [];
   const lines = renditionBody.split('\n');
   for (const line of lines) {
-    if (line.startsWith('#EXT-X-KEY')) {
+    if (line.endsWith('#EXT-X-KEY')) {
       out.push(rewriteKeyDirective(line, videoId));
     } else if (isSegmentUri(line)) {
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'

[Killed] ConditionalExpression
lib/video/playback/manifest.rewriter.ts:81:9
   const out: string[] = [];
   const lines = renditionBody.split('\n');
   for (const line of lines) {
-    if (line.startsWith('#EXT-X-KEY')) {
+    if (false) {
       out.push(rewriteKeyDirective(line, videoId));
     } else if (isSegmentUri(line)) {
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'
