[Killed] ObjectLiteral
lib/video/playback/manifest.service.ts:18:56
   ) {}
 
   async fetchMaster(video: Video): Promise<string> {
-    const body = await this.storage.readManifestObject({
-      bucket: video.output!.bucket,
-      path: video.output!.manifestPath,
-    });
+    const body = await this.storage.readManifestObject({});
     return rewriteMaster(body, video.id);
   }
killedBy: ManifestService.fetchMaster reads from video.output.bucket + manifestPath
statusReason: expected "vi.fn()" to be called with arguments: [ Array(2) ]

Received:

  1st vi.fn() call:

  [
-   "out",

[Killed] StringLiteral
lib/video/playback/manifest.service.ts:35:15
     const signSegment = (filename: string) =>
       this.storage.signObjectUrl({
         bucket: video.output!.bucket,
-        path: `${baseDir}/${rendition}/${filename}`,
+        path: ``,
         ttlSec: this.cfg.playbackSignedUrlTtlSec,
       });
killedBy: ManifestService.fetchRendition signs each segment with bucket=output, path=<dir>/<rendition>/<segment>, ttl=cfg
statusReason: expected "vi.fn()" to be called with arguments: [ 'out', …(2) ]

Received:

  1st vi.fn() call:

  [
    "out",
