[Killed] StringLiteral
lib/video/playback/playback.controller.ts:15:27
 import { isAllowedRendition, type RenditionName } from './manifest.rewriter';
 import { ManifestService } from './manifest.service';
 
-const M3U8_CONTENT_TYPE = 'application/vnd.apple.mpegurl; charset=utf-8';
+const M3U8_CONTENT_TYPE = "";
 
 @Controller('playback')
killedBy: PlaybackController.master returns the rewritten master with HLS content-type and no-store
statusReason: expected '' to match /application\/vnd\.…/vnd\.apple\.mpegurl

[Killed] StringLiteral
lib/video/playback/playback.controller.ts:30:19
   async master(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {
     const body = await this.manifest.fetchMaster(video);
     res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
-    res.setHeader('Cache-Control', 'no-store');
+    res.setHeader("", 'no-store');
     res.send(body);
   }
killedBy: PlaybackController.master returns the rewritten master with HLS content-type and no-store
statusReason: expected undefined to be 'no-store' // Object.is equality

[Killed] BlockStatement
lib/video/playback/playback.controller.ts:40:33
     @Param('r') r: string,
     @Res() res: Response,
   ): Promise<void> {
-    if (!isAllowedRendition(r)) {
-      throw new RenditionNotFoundException(r);
-    }
+    if (!isAllowedRendition(r)) {}
     const body = await this.manifest.fetchRendition(video, r as RenditionName);
     res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
killedBy: PlaybackController.rendition returns 404 RENDITION_NOT_FOUND for an unknown rendition (allow-list miss)
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
lib/video/playback/playback.controller.ts:44:19
       throw new RenditionNotFoundException(r);
     }
     const body = await this.manifest.fetchRendition(video, r as RenditionName);
-    res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
+    res.setHeader("", M3U8_CONTENT_TYPE);
     res.setHeader('Cache-Control', 'no-store');
     res.send(body);
killedBy: PlaybackController.rendition returns 200 with rewritten rendition for an allowed rendition (720p)
statusReason: .toMatch() expects to receive a string, but got undefined
