[Killed] ConditionalExpression
lib/video/transcoder/transcoder-job.builder.ts:52:47
 }
 
 export function buildJobConfig(input: TranscoderJobInput): JobConfig {
-  const renditions = RENDITIONS.filter((r) => r.height <= input.sourceHeight);
+  const renditions = RENDITIONS.filter((r) => false);
   if (renditions.length === 0) {
     throw new Error(
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: sourceHeight 1080px is below the lowest supported rendition (360px).

[Killed] BlockStatement
lib/video/transcoder/transcoder-job.builder.ts:53:32
 
 export function buildJobConfig(input: TranscoderJobInput): JobConfig {
   const renditions = RENDITIONS.filter((r) => r.height <= input.sourceHeight);
-  if (renditions.length === 0) {
-    throw new Error(
-      `sourceHeight ${input.sourceHeight}px is below the lowest supported rendition ` +
-        `(${RENDITIONS[RENDITIONS.length - 1]!.height}px).`,
-    );
-  }
+  if (renditions.length === 0) {}
 
   const elementaryStreams: ElementaryStream[] = [
killedBy: buildJobConfig throws when sourceHeight is below the lowest rendition
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
lib/video/transcoder/transcoder-job.builder.ts:72:47
         },
       },
     })),
-    { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
+    { key: 'audio_aac', audioStream: { codec: "", bitrateBps: AUDIO_BITRATE_BPS } },
   ];
 
killedBy: buildJobConfig wires input, elementary-stream, mux-stream and manifest keys consistently
statusReason: expected '' to be 'aac' // Object.is equality

[Killed] ObjectLiteral
lib/video/transcoder/transcoder-job.builder.ts:72:5
         },
       },
     })),
-    { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
+    {},
   ];
 
killedBy: buildJobConfig emits one elementary audio stream
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
lib/video/transcoder/transcoder-job.builder.ts:76:10
   ];
 
   const muxStreams: MuxStream[] = renditions.map((r) => ({
-    key: `hls_${r.name}`,
+    key: ``,
     container: 'ts',
     elementaryStreams: [`video_${r.name}`, 'audio_aac'],
killedBy: buildJobConfig wires input, elementary-stream, mux-stream and manifest keys consistently
statusReason: expected [ '' ] to deeply equal [ 'hls_360p' ]

[Killed] StringLiteral
lib/video/transcoder/transcoder-job.builder.ts:77:16
 
   const muxStreams: MuxStream[] = renditions.map((r) => ({
     key: `hls_${r.name}`,
-    container: 'ts',
+    container: "",
     elementaryStreams: [`video_${r.name}`, 'audio_aac'],
     segmentSettings: { segmentDuration: { seconds: SEGMENT_DURATION_S } },
killedBy: buildJobConfig emits one HLS mux stream per video rendition
statusReason: expected [] to have a length of 4 but got +0

[Killed] ObjectLiteral
lib/video/transcoder/transcoder-job.builder.ts:79:41
     key: `hls_${r.name}`,
     container: 'ts',
     elementaryStreams: [`video_${r.name}`, 'audio_aac'],
-    segmentSettings: { segmentDuration: { seconds: SEGMENT_DURATION_S } },
+    segmentSettings: { segmentDuration: {} },
     encryptionId: input.encryptionKey.id,
   }));
killedBy: buildJobConfig uses 6-second segments and 2-second key-frame interval
statusReason: expected undefined to be 6 // Object.is equality

[Killed] ObjectLiteral
lib/video/transcoder/transcoder-job.builder.ts:83:10
     encryptionId: input.encryptionKey.id,
   }));
 
-  return {
-    inputs: [{ key: 'input0', uri: input.sourceUri }],
-    output: { uri: input.outputUriPrefix },
-    elementaryStreams,
-    muxStreams,
-    manifests: [
-      {
-        fileName: 'manifest.m3u8',
-        type: 'HLS',
-        muxStreams: muxStreams.map((m) => m.key),
-      },
-    ],
-    encryptions: [
-      {
-        id: input.encryptionKey.id,
-        aes128: {},
-      },
-    ],
-    pubsubDestination: { topic: input.topic },
-    labels: { videoid: input.videoId as string },
-  };
+  return {};
 }
 
killedBy: buildJobConfig emits one elementary video stream per applicable rendition
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] StringLiteral
lib/video/transcoder/transcoder-job.builder.ts:84:21
   }));
 
   return {
-    inputs: [{ key: 'input0', uri: input.sourceUri }],
+    inputs: [{ key: "", uri: input.sourceUri }],
     output: { uri: input.outputUriPrefix },
     elementaryStreams,
killedBy: buildJobConfig wires input, elementary-stream, mux-stream and manifest keys consistently
statusReason: expected [ { key: '', …(1) } ] to deeply equal [ { key: 'input0', …(1) } ]

[Killed] ObjectLiteral
lib/video/transcoder/transcoder-job.builder.ts:89:7
     elementaryStreams,
     muxStreams,
     manifests: [
-      {
-        fileName: 'manifest.m3u8',
-        type: 'HLS',
-        muxStreams: muxStreams.map((m) => m.key),
-      },
+      {},
     ],
     encryptions: [
killedBy: buildJobConfig wires HLS manifest at the conventional output path
statusReason: expected undefined to be 'manifest.m3u8' // Object.is equality

[Killed] ObjectLiteral
lib/video/transcoder/transcoder-job.builder.ts:102:13
       },
     ],
     pubsubDestination: { topic: input.topic },
-    labels: { videoid: input.videoId as string },
+    labels: {},
   };
 }
killedBy: buildJobConfig labels the job with the videoId for webhook correlation
statusReason: expected undefined to be 'v1' // Object.is equality
