[Killed] ConditionalExpression
src/lib/video/video.controller.ts:56:9
     @Req() req: VideoScopedRequest,
   ): Promise<{ videoId: VideoId; uploadSessionUri: string; expiresAt: string }> {
     const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
-    if (!moduleOk) throw new ModuleNotFoundException();
+    if (true) throw new ModuleNotFoundException();
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
     if (!lesson) throw new LessonNotFoundException();
killedBy: VideoController rejects upload-session when lesson is not found
statusReason: expected CoursesException: Module not found. { …(3) } to be an instance of LessonNotFoundException

[Killed] ConditionalExpression
src/lib/video/video.controller.ts:58:9
     const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
     if (!moduleOk) throw new ModuleNotFoundException();
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
-    if (!lesson) throw new LessonNotFoundException();
+    if (true) throw new LessonNotFoundException();
 
     return this.svc.createUploadSession({
killedBy: VideoController delegates to createUploadSession on the service for the happy path
statusReason: Lesson not found.
