[Killed] BlockStatement
src/lib/video/video.repository.ts:22:55
     return this.db.collection('_ids').doc().id as T;
   }
 
-  async getVideo(vid: VideoId): Promise<Video | null> {
-    const snap = await this.db.collection('videos').doc(vid).get();
-    return snap.exists ? (snap.data() as Video) : null;
-  }
+  async getVideo(vid: VideoId): Promise<Video | null> {}
 
   async getVideoByLesson(lid: LessonId): Promise<Video | null> {
killedBy: VideoRepository — simple reads and writes getVideo returns the stored video, or null when absent
statusReason: expected undefined to deeply equal { id: 'v1', …(7) }

[Killed] BlockStatement
src/lib/video/video.repository.ts:27:64
     return snap.exists ? (snap.data() as Video) : null;
   }
 
-  async getVideoByLesson(lid: LessonId): Promise<Video | null> {
-    const q = await this.db
-      .collection('videos')
-      .where('lessonId', '==', lid)
-      .limit(1)
-      .get();
-    return q.empty ? null : (q.docs[0]!.data() as Video);
-  }
+  async getVideoByLesson(lid: LessonId): Promise<Video | null> {}
 
   async getVideoKey(kid: VideoKeyId): Promise<VideoKey | null> {
killedBy: VideoRepository — simple reads and writes getVideoByLesson finds the video whose lessonId matches
statusReason: expected undefined to be 'v2' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.repository.ts:30:14
   async getVideoByLesson(lid: LessonId): Promise<Video | null> {
     const q = await this.db
       .collection('videos')
-      .where('lessonId', '==', lid)
+      .where("", '==', lid)
       .limit(1)
       .get();
killedBy: VideoRepository — simple reads and writes getVideoByLesson finds the video whose lessonId matches
statusReason: expected undefined to be 'v2' // Object.is equality

[Killed] BlockStatement
src/lib/video/video.repository.ts:36:64
     return q.empty ? null : (q.docs[0]!.data() as Video);
   }
 
-  async getVideoKey(kid: VideoKeyId): Promise<VideoKey | null> {
-    const snap = await this.db.collection('videoKeys').doc(kid).get();
-    return snap.exists ? (snap.data() as VideoKey) : null;
-  }
+  async getVideoKey(kid: VideoKeyId): Promise<VideoKey | null> {}
 
   async createVideo(video: Video): Promise<void> {
killedBy: VideoRepository — simple reads and writes getVideoKey returns the stored key, or null when absent
statusReason: expected undefined to deeply equal { id: 'k1', videoId: 'v1', …(2) }

[Killed] BlockStatement
src/lib/video/video.repository.ts:41:50
     return snap.exists ? (snap.data() as VideoKey) : null;
   }
 
-  async createVideo(video: Video): Promise<void> {
-    await this.db.collection('videos').doc(video.id).set(video);
-  }
+  async createVideo(video: Video): Promise<void> {}
 
   async updateVideo(vid: VideoId, patch: Partial<Video>): Promise<void> {
killedBy: VideoRepository — simple reads and writes createVideo writes the video at videos/{id}
statusReason: expected undefined to deeply equal { id: 'v1', …(7) }

[Killed] BlockStatement
src/lib/video/video.repository.ts:45:73
     await this.db.collection('videos').doc(video.id).set(video);
   }
 
-  async updateVideo(vid: VideoId, patch: Partial<Video>): Promise<void> {
-    await this.db.collection('videos').doc(vid).update(patch);
-  }
+  async updateVideo(vid: VideoId, patch: Partial<Video>): Promise<void> {}
 
   async finalizeUploadWithJob(args: {
killedBy: VideoRepository — simple reads and writes updateVideo merges the patch into the existing document
statusReason: expected 'PENDING_UPLOAD' to be 'UPLOADED' // Object.is equality

[Killed] StringLiteral
src/lib/video/video.repository.ts:59:45
   }): Promise<Video> {
     const videoRef = this.db.collection('videos').doc(args.vid);
     const keyRef = this.db.collection('videoKeys').doc(args.key.id);
-    const lessonQ = this.db.collectionGroup('lessons').where('id', '==', args.lid).limit(1);
+    const lessonQ = this.db.collectionGroup("").where('id', '==', args.lid).limit(1);
 
     return this.db.runTransaction(async (tx) => {
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: Lesson disappeared in transaction.

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:63:11
 
     return this.db.runTransaction(async (tx) => {
       const videoSnap = await tx.get(videoRef);
-      if (!videoSnap.exists) throw new Error('Video disappeared in transaction.');
+      if (false) throw new Error('Video disappeared in transaction.');
       const lessonSnap = await tx.get(lessonQ);
       if (lessonSnap.empty) throw new Error('Lesson disappeared in transaction.');
killedBy: VideoRepository.finalizeUploadWithJob throws when the video disappeared before the transaction ran
statusReason: expected [Function] to throw error including 'Video disappeared in transaction.' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:63:11
 
     return this.db.runTransaction(async (tx) => {
       const videoSnap = await tx.get(videoRef);
-      if (!videoSnap.exists) throw new Error('Video disappeared in transaction.');
+      if (videoSnap.exists) throw new Error('Video disappeared in transaction.');
       const lessonSnap = await tx.get(lessonQ);
       if (lessonSnap.empty) throw new Error('Lesson disappeared in transaction.');
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: Video disappeared in transaction.

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:65:11
       const videoSnap = await tx.get(videoRef);
       if (!videoSnap.exists) throw new Error('Video disappeared in transaction.');
       const lessonSnap = await tx.get(lessonQ);
-      if (lessonSnap.empty) throw new Error('Lesson disappeared in transaction.');
+      if (true) throw new Error('Lesson disappeared in transaction.');
       const lessonDocRef = lessonSnap.docs[0]!.ref;
 
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: Lesson disappeared in transaction.

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:65:11
       const videoSnap = await tx.get(videoRef);
       if (!videoSnap.exists) throw new Error('Video disappeared in transaction.');
       const lessonSnap = await tx.get(lessonQ);
-      if (lessonSnap.empty) throw new Error('Lesson disappeared in transaction.');
+      if (false) throw new Error('Lesson disappeared in transaction.');
       const lessonDocRef = lessonSnap.docs[0]!.ref;
 
killedBy: VideoRepository.finalizeUploadWithJob throws when the lesson disappeared before the transaction ran
statusReason: expected [Function] to throw error including 'Lesson disappeared in transaction.' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/lib/video/video.repository.ts:71:16
       const current = videoSnap.data() as Video;
       const updated: Video = {
         ...current,
-        state: 'TRANSCODING',
+        state: "",
         source: { ...current.source, sizeBytes: args.actualSizeBytes },
         keyId: args.key.id,
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: expected '' to be 'TRANSCODING' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:72:17
       const updated: Video = {
         ...current,
         state: 'TRANSCODING',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
+        source: {},
         keyId: args.key.id,
         transcoderJobName: args.transcoderJobName,
killedBy: VideoRepository.finalizeUploadWithJob moves the video to TRANSCODING, writes the key, and links the lesson
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] BlockStatement
src/lib/video/video.repository.ts:96:22
     failureReason: string;
     actualSizeBytes: number;
     nowIso: string;
-  }): Promise<Video> {
-    const videoRef = this.db.collection('videos').doc(args.vid);
-    return this.db.runTransaction(async (tx) => {
-      const snap = await tx.get(videoRef);
-      if (!snap.exists) throw new Error('Video disappeared in transaction.');
-      const current = snap.data() as Video;
-      const updated: Video = {
-        ...current,
-        state: 'FAILED',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
-        failureReason: args.failureReason,
-        updatedAt: args.nowIso as Video['updatedAt'],
-      };
-      tx.set(videoRef, updated);
-      return updated;
-    });
-  }
+  }): Promise<Video> {}
 
   async applyTranscoderResult(args: {
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] StringLiteral
src/lib/video/video.repository.ts:97:41
     actualSizeBytes: number;
     nowIso: string;
   }): Promise<Video> {
-    const videoRef = this.db.collection('videos').doc(args.vid);
+    const videoRef = this.db.collection("").doc(args.vid);
     return this.db.runTransaction(async (tx) => {
       const snap = await tx.get(videoRef);
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: Video disappeared in transaction.

[Killed] BlockStatement
src/lib/video/video.repository.ts:98:49
     nowIso: string;
   }): Promise<Video> {
     const videoRef = this.db.collection('videos').doc(args.vid);
-    return this.db.runTransaction(async (tx) => {
-      const snap = await tx.get(videoRef);
-      if (!snap.exists) throw new Error('Video disappeared in transaction.');
-      const current = snap.data() as Video;
-      const updated: Video = {
-        ...current,
-        state: 'FAILED',
-        source: { ...current.source, sizeBytes: args.actualSizeBytes },
-        failureReason: args.failureReason,
-        updatedAt: args.nowIso as Video['updatedAt'],
-      };
-      tx.set(videoRef, updated);
-      return updated;
-    });
+    return this.db.runTransaction(async (tx) => {});
   }
 
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: Cannot read properties of undefined (reading 'state')

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:100:11
     const videoRef = this.db.collection('videos').doc(args.vid);
     return this.db.runTransaction(async (tx) => {
       const snap = await tx.get(videoRef);
-      if (!snap.exists) throw new Error('Video disappeared in transaction.');
+      if (false) throw new Error('Video disappeared in transaction.');
       const current = snap.data() as Video;
       const updated: Video = {
killedBy: VideoRepository.markFailedFromSubmission throws when the video does not exist
statusReason: expected [Function] to throw error including 'Video disappeared in transaction.' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:100:11
     const videoRef = this.db.collection('videos').doc(args.vid);
     return this.db.runTransaction(async (tx) => {
       const snap = await tx.get(videoRef);
-      if (!snap.exists) throw new Error('Video disappeared in transaction.');
+      if (snap.exists) throw new Error('Video disappeared in transaction.');
       const current = snap.data() as Video;
       const updated: Video = {
killedBy: VideoRepository.markFailedFromSubmission moves the video to FAILED and records the reason and actual size
statusReason: Video disappeared in transaction.

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:125:11
     const videoRef = this.db.collection('videos').doc(args.videoId);
     return this.db.runTransaction(async (tx) => {
       const snap = await tx.get(videoRef);
-      if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
+      if (false) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
       if (current.transcoderJobName !== args.jobName) {
killedBy: VideoRepository.applyTranscoderResult reports VIDEO_NOT_FOUND when the video is absent
statusReason: Cannot read properties of undefined (reading 'transcoderJobName')

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:125:41
     const videoRef = this.db.collection('videos').doc(args.videoId);
     return this.db.runTransaction(async (tx) => {
       const snap = await tx.get(videoRef);
-      if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
+      if (!snap.exists) return { acted: true, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
       if (current.transcoderJobName !== args.jobName) {
killedBy: VideoRepository.applyTranscoderResult reports VIDEO_NOT_FOUND when the video is absent
statusReason: expected { acted: true, …(1) } to deeply equal { acted: false, …(1) }

[Killed] EqualityOperator
src/lib/video/video.repository.ts:127:11
       const snap = await tx.get(videoRef);
       if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
-      if (current.transcoderJobName !== args.jobName) {
+      if (current.transcoderJobName === args.jobName) {
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports JOB_NAME_MISMATCH when the stored job name differs
statusReason: expected { acted: true } to deeply equal { acted: false, …(1) }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:127:11
       const snap = await tx.get(videoRef);
       if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
-      if (current.transcoderJobName !== args.jobName) {
+      if (false) {
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports JOB_NAME_MISMATCH when the stored job name differs
statusReason: expected { acted: true } to deeply equal { acted: false, …(1) }

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:128:25
       if (!snap.exists) return { acted: false, reason: 'VIDEO_NOT_FOUND' as const };
       const current = snap.data() as Video;
       if (current.transcoderJobName !== args.jobName) {
-        return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
+        return { acted: true, reason: 'JOB_NAME_MISMATCH' as const };
       }
       const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
killedBy: VideoRepository.applyTranscoderResult reports JOB_NAME_MISMATCH when the stored job name differs
statusReason: expected { acted: true, …(1) } to deeply equal { acted: false, …(1) }

[Killed] EqualityOperator
src/lib/video/video.repository.ts:130:27
       if (current.transcoderJobName !== args.jobName) {
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
-      const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
+      const targetState = args.outcome.kind !== 'READY' ? 'READY' : 'FAILED';
       if (current.state === targetState) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected { acted: false, reason: 'WRONG_STATE' } to deeply equal { acted: false, …(1) }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:130:27
       if (current.transcoderJobName !== args.jobName) {
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
-      const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
+      const targetState = false ? 'READY' : 'FAILED';
       if (current.state === targetState) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected { acted: false, reason: 'WRONG_STATE' } to deeply equal { acted: false, …(1) }

[Killed] EqualityOperator
src/lib/video/video.repository.ts:131:11
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
       const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
-      if (current.state === targetState) {
+      if (current.state !== targetState) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected { acted: false, reason: 'WRONG_STATE' } to deeply equal { acted: false, …(1) }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:131:11
         return { acted: false, reason: 'JOB_NAME_MISMATCH' as const };
       }
       const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
-      if (current.state === targetState) {
+      if (false) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected { acted: false, reason: 'WRONG_STATE' } to deeply equal { acted: false, …(1) }

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:132:25
       }
       const targetState = args.outcome.kind === 'READY' ? 'READY' : 'FAILED';
       if (current.state === targetState) {
-        return { acted: false, reason: 'ALREADY_APPLIED' as const };
+        return { acted: true, reason: 'ALREADY_APPLIED' as const };
       }
       if (current.state !== 'TRANSCODING') {
killedBy: VideoRepository.applyTranscoderResult reports ALREADY_APPLIED when the video is already in the target state
statusReason: expected { acted: true, …(1) } to deeply equal { acted: false, …(1) }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:134:11
       if (current.state === targetState) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
-      if (current.state !== 'TRANSCODING') {
+      if (false) {
         return { acted: false, reason: 'WRONG_STATE' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports WRONG_STATE when the video is neither TRANSCODING nor the target state
statusReason: expected { acted: true } to deeply equal { acted: false, reason: 'WRONG_STATE' }

[Killed] EqualityOperator
src/lib/video/video.repository.ts:134:11
       if (current.state === targetState) {
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
-      if (current.state !== 'TRANSCODING') {
+      if (current.state === 'TRANSCODING') {
         return { acted: false, reason: 'WRONG_STATE' as const };
       }
killedBy: VideoRepository.applyTranscoderResult reports WRONG_STATE when the video is neither TRANSCODING nor the target state
statusReason: expected { acted: true } to deeply equal { acted: false, reason: 'WRONG_STATE' }

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:135:25
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
       if (current.state !== 'TRANSCODING') {
-        return { acted: false, reason: 'WRONG_STATE' as const };
+        return { acted: true, reason: 'WRONG_STATE' as const };
       }
 
killedBy: VideoRepository.applyTranscoderResult reports WRONG_STATE when the video is neither TRANSCODING nor the target state
statusReason: expected { acted: true, reason: 'WRONG_STATE' } to deeply equal { acted: false, reason: 'WRONG_STATE' }

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:135:16
         return { acted: false, reason: 'ALREADY_APPLIED' as const };
       }
       if (current.state !== 'TRANSCODING') {
-        return { acted: false, reason: 'WRONG_STATE' as const };
+        return {};
       }
 
killedBy: VideoRepository.applyTranscoderResult reports WRONG_STATE when the video is neither TRANSCODING nor the target state
statusReason: expected {} to deeply equal { acted: false, reason: 'WRONG_STATE' }

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:139:9
       }
 
       const updated: Video =
-        args.outcome.kind === 'READY'
+        false
           ? {
               ...current,
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected 'FAILED' to be 'READY' // Object.is equality

[Killed] EqualityOperator
src/lib/video/video.repository.ts:139:9
       }
 
       const updated: Video =
-        args.outcome.kind === 'READY'
+        args.outcome.kind !== 'READY'
           ? {
               ...current,
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected 'FAILED' to be 'READY' // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:143:23
           ? {
               ...current,
               state: 'READY',
-              output: {
-                bucket: args.outcome.outputBucket,
-                manifestPath: args.outcome.manifestPath,
-                durationSec: args.outcome.durationSec,
-              },
+              output: {},
               updatedAt: args.nowIso as Video['updatedAt'],
             }
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected {} to deeply equal { bucket: 'out-bucket', …(2) }

[Killed] StringLiteral
src/lib/video/video.repository.ts:153:30
           : {
               ...current,
               state: 'FAILED',
-              failureReason: `TRANSCODE_FAILED: ${args.outcome.reason}`,
+              failureReason: ``,
               updatedAt: args.nowIso as Video['updatedAt'],
             };
killedBy: VideoRepository.applyTranscoderResult applies a FAILED outcome: state FAILED with a prefixed failure reason
statusReason: expected '' to be 'TRANSCODE_FAILED: codec unsupported' // Object.is equality

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:157:23
               updatedAt: args.nowIso as Video['updatedAt'],
             };
       tx.set(videoRef, updated);
-      return { acted: true };
+      return { acted: false };
     });
   }
killedBy: VideoRepository.applyTranscoderResult applies a READY outcome: state READY with the transcoder output
statusReason: expected { acted: false } to deeply equal { acted: true }

[Killed] BlockStatement
src/lib/video/video.repository.ts:166:90
    * and null out Lesson.videoId if it currently points at vid.
    * Uses a transaction so the lesson ownership check and the update are atomic.
    */
-  async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {
-    const videoRef = this.db.collection('videos').doc(vid);
-    const keyQ = this.db.collection('videoKeys').where('videoId', '==', vid).limit(1);
-    // Relies on the invariant that Lesson.id === lesson document key, established at
-    // creation time in CoursesRepository.appendLesson. This collectionGroup query
-    // therefore always resolves to exactly one document when the lesson exists.
-    const lessonQ = this.db.collectionGroup('lessons').where('id', '==', lid).limit(1);
-
-    await this.db.runTransaction(async (tx) => {
-      const lessonSnap = await tx.get(lessonQ);
-      const keySnap = await tx.get(keyQ);
-
-      tx.delete(videoRef);
-      if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
-      if (!lessonSnap.empty) {
-        const lesson = lessonSnap.docs[0]!;
-        const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
-          // Use FieldValue.delete() to remove the optional field rather than writing null,
-          // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
-          tx.update(lesson.ref, { videoId: FieldValue.delete(), updatedAt: nowIso });
-        }
-      }
-    });
-  }
+  async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {}
 
 }
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/lib/video/video.repository.ts:167:41
    * Uses a transaction so the lesson ownership check and the update are atomic.
    */
   async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {
-    const videoRef = this.db.collection('videos').doc(vid);
+    const videoRef = this.db.collection("").doc(vid);
     const keyQ = this.db.collection('videoKeys').where('videoId', '==', vid).limit(1);
     // Relies on the invariant that Lesson.id === lesson document key, established at
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/lib/video/video.repository.ts:168:67
    */
   async deleteVideoAndDetach(vid: VideoId, lid: LessonId, nowIso: string): Promise<void> {
     const videoRef = this.db.collection('videos').doc(vid);
-    const keyQ = this.db.collection('videoKeys').where('videoId', '==', vid).limit(1);
+    const keyQ = this.db.collection('videoKeys').where('videoId', "", vid).limit(1);
     // Relies on the invariant that Lesson.id === lesson document key, established at
     // creation time in CoursesRepository.appendLesson. This collectionGroup query

[Killed] StringLiteral
src/lib/video/video.repository.ts:172:45
     // Relies on the invariant that Lesson.id === lesson document key, established at
     // creation time in CoursesRepository.appendLesson. This collectionGroup query
     // therefore always resolves to exactly one document when the lesson exists.
-    const lessonQ = this.db.collectionGroup('lessons').where('id', '==', lid).limit(1);
+    const lessonQ = this.db.collectionGroup("").where('id', '==', lid).limit(1);
 
     await this.db.runTransaction(async (tx) => {
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Survived] StringLiteral
src/lib/video/video.repository.ts:172:68
     // Relies on the invariant that Lesson.id === lesson document key, established at
     // creation time in CoursesRepository.appendLesson. This collectionGroup query
     // therefore always resolves to exactly one document when the lesson exists.
-    const lessonQ = this.db.collectionGroup('lessons').where('id', '==', lid).limit(1);
+    const lessonQ = this.db.collectionGroup('lessons').where('id', "", lid).limit(1);
 
     await this.db.runTransaction(async (tx) => {

[Killed] BlockStatement
src/lib/video/video.repository.ts:174:48
     // therefore always resolves to exactly one document when the lesson exists.
     const lessonQ = this.db.collectionGroup('lessons').where('id', '==', lid).limit(1);
 
-    await this.db.runTransaction(async (tx) => {
-      const lessonSnap = await tx.get(lessonQ);
-      const keySnap = await tx.get(keyQ);
-
-      tx.delete(videoRef);
-      if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
-      if (!lessonSnap.empty) {
-        const lesson = lessonSnap.docs[0]!;
-        const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
-          // Use FieldValue.delete() to remove the optional field rather than writing null,
-          // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
-          tx.update(lesson.ref, { videoId: FieldValue.delete(), updatedAt: nowIso });
-        }
-      }
-    });
+    await this.db.runTransaction(async (tx) => {});
   }
 
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:179:11
       const keySnap = await tx.get(keyQ);
 
       tx.delete(videoRef);
-      if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
+      if (false) tx.delete(keySnap.docs[0]!.ref);
       if (!lessonSnap.empty) {
         const lesson = lessonSnap.docs[0]!;
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:179:11
       const keySnap = await tx.get(keyQ);
 
       tx.delete(videoRef);
-      if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
+      if (keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
       if (!lessonSnap.empty) {
         const lesson = lessonSnap.docs[0]!;
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/lib/video/video.repository.ts:180:11
 
       tx.delete(videoRef);
       if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
-      if (!lessonSnap.empty) {
+      if (lessonSnap.empty) {
         const lesson = lessonSnap.docs[0]!;
         const currentVid = (lesson.data() as { videoId?: string }).videoId;
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality
