[Killed] BlockStatement
src/lib/video/video.repository.ts:180:30
 
       tx.delete(videoRef);
       if (!keySnap.empty) tx.delete(keySnap.docs[0]!.ref);
-      if (!lessonSnap.empty) {
-        const lesson = lessonSnap.docs[0]!;
-        const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
-          // Use FieldValue.delete() to remove the optional field rather than writing null,
-          // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
-          tx.update(lesson.ref, { videoId: FieldValue.delete(), updatedAt: nowIso });
-        }
-      }
+      if (!lessonSnap.empty) {}
     });
   }
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/lib/video/video.repository.ts:183:13
       if (!lessonSnap.empty) {
         const lesson = lessonSnap.docs[0]!;
         const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
+        if (currentVid !== vid) {
           // Use FieldValue.delete() to remove the optional field rather than writing null,
           // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/lib/video/video.repository.ts:183:13
       if (!lessonSnap.empty) {
         const lesson = lessonSnap.docs[0]!;
         const currentVid = (lesson.data() as { videoId?: string }).videoId;
-        if (currentVid === vid) {
+        if (false) {
           // Use FieldValue.delete() to remove the optional field rather than writing null,
           // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/lib/video/video.repository.ts:186:33
         if (currentVid === vid) {
           // Use FieldValue.delete() to remove the optional field rather than writing null,
           // preserving the Lesson.videoId type contract (VideoId | undefined, not nullable).
-          tx.update(lesson.ref, { videoId: FieldValue.delete(), updatedAt: nowIso });
+          tx.update(lesson.ref, {});
         }
       }
killedBy: VideoRepository.deleteVideoAndDetach deletes the video, deletes the key, and clears the lesson link
statusReason: expected true to be false // Object.is equality
