[Killed] ObjectLiteral
lib/video/webhook/fake-transcoder.controller.ts:16:10
   message: { data: string; messageId: string; publishTime: string };
   subscription: string;
 } {
-  return {
-    message: {
-      data: Buffer.from(JSON.stringify(payload)).toString('base64'),
-      messageId: `fake-${Date.now()}`,
-      publishTime: new Date().toISOString(),
-    },
-    subscription: 'fake-subscription',
-  };
+  return {};
 }
 
killedBy: FakeTranscoderController complete: builds a SUCCEEDED Pub/Sub envelope and delegates to the real handler
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] ObjectLiteral
lib/video/webhook/fake-transcoder.controller.ts:17:14
   subscription: string;
 } {
   return {
-    message: {
-      data: Buffer.from(JSON.stringify(payload)).toString('base64'),
-      messageId: `fake-${Date.now()}`,
-      publishTime: new Date().toISOString(),
-    },
+    message: {},
     subscription: 'fake-subscription',
   };
killedBy: FakeTranscoderController complete: builds a SUCCEEDED Pub/Sub envelope and delegates to the real handler
statusReason: The first argument must be of type string or an instance of Buffer, ArrayBuffer, or Array or an Array-like Object. Received undefined

[Killed] ObjectLiteral
lib/video/webhook/fake-transcoder.controller.ts:50:26
     @Body() body: FakeFailBody,
     @Res() res: Response,
   ): Promise<void> {
-    const env = envelope({
-      job: {
-        name: `projects/fake/locations/fake/jobs/${vid}`,
-        state: 'FAILED',
-        labels: { videoid: vid },
-        error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
-      },
-      eventTime: new Date().toISOString(),
-    });
+    const env = envelope({});
     await this.real.handle(env, res);
   }
killedBy: FakeTranscoderController fail: builds a FAILED envelope and passes the reason
statusReason: Cannot read properties of undefined (reading 'state')
