[Survived] StringLiteral
lib/video/webhook/transcoder-events.controller.ts:24:25
     try {
       event = await this.transcoder.parseEvent(body);
     } catch (err) {
-      this.logger.error(`Discarding malformed event: ${(err as Error).message}`);
+      this.logger.error(``);
       res.status(200).json({ acked: true, reason: 'MALFORMED' });
       return;

[Killed] ObjectLiteral
lib/video/webhook/transcoder-events.controller.ts:25:28
       event = await this.transcoder.parseEvent(body);
     } catch (err) {
       this.logger.error(`Discarding malformed event: ${(err as Error).message}`);
-      res.status(200).json({ acked: true, reason: 'MALFORMED' });
+      res.status(200).json({});
       return;
     }
killedBy: TranscoderEventsController.handle returns 200 when payload cannot be parsed (poison-pill drop)
statusReason: expected {} to match object { acked: true }

[Survived] StringLiteral
lib/video/webhook/transcoder-events.controller.ts:40:25
       );
       res.status(200).json({ acked: true, reason: outcome.reason });
     } catch (err) {
-      this.logger.error(`Transient failure: ${(err as Error).message}`);
+      this.logger.error(``);
       res.status(500).send();
     }
