[Killed] BlockStatement
src/lib/transcoder/fake-transcoder.adapter.ts:35:76
 export class FakeTranscoderAdapter implements VideoTranscoder {
   private readonly jobs = new Map<string, FakeJobRecord>();
 
-  async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {
-    const jobName = `fake-job-${input.videoId}-${Date.now()}-${this.jobs.size}`;
-    this.jobs.set(jobName, { input, cancelled: false });
-    return { jobName };
-  }
+  async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {}
 
   async parseEvent(raw: unknown): Promise<TranscoderEvent> {
killedBy: FakeTranscoderAdapter.submitJob returns a synthetic job name derived from videoId
statusReason: Cannot destructure property 'jobName' of '(intermediate value)' as it is undefined.

[Killed] StringLiteral
src/lib/transcoder/fake-transcoder.adapter.ts:36:21
   private readonly jobs = new Map<string, FakeJobRecord>();
 
   async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {
-    const jobName = `fake-job-${input.videoId}-${Date.now()}-${this.jobs.size}`;
+    const jobName = ``;
     this.jobs.set(jobName, { input, cancelled: false });
     return { jobName };
killedBy: FakeTranscoderAdapter.submitJob returns a synthetic job name derived from videoId
statusReason: expected '' to match /^fake-job-v1-/

[Survived] BooleanLiteral
src/lib/transcoder/fake-transcoder.adapter.ts:37:48
 
   async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {
     const jobName = `fake-job-${input.videoId}-${Date.now()}-${this.jobs.size}`;
-    this.jobs.set(jobName, { input, cancelled: false });
+    this.jobs.set(jobName, { input, cancelled: true });
     return { jobName };
   }

[Survived] OptionalChaining
src/lib/transcoder/fake-transcoder.adapter.ts:43:21
 
   async parseEvent(raw: unknown): Promise<TranscoderEvent> {
     const envelope = raw as PubSubEnvelope;
-    const dataB64 = envelope.message?.data;
+    const dataB64 = envelope.message.data;
     if (!dataB64) throw new Error('Pub/Sub envelope missing message.data.');
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:44:9
   async parseEvent(raw: unknown): Promise<TranscoderEvent> {
     const envelope = raw as PubSubEnvelope;
     const dataB64 = envelope.message?.data;
-    if (!dataB64) throw new Error('Pub/Sub envelope missing message.data.');
+    if (true) throw new Error('Pub/Sub envelope missing message.data.');
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Pub/Sub envelope missing message.data.

[Killed] BooleanLiteral
src/lib/transcoder/fake-transcoder.adapter.ts:44:9
   async parseEvent(raw: unknown): Promise<TranscoderEvent> {
     const envelope = raw as PubSubEnvelope;
     const dataB64 = envelope.message?.data;
-    if (!dataB64) throw new Error('Pub/Sub envelope missing message.data.');
+    if (dataB64) throw new Error('Pub/Sub envelope missing message.data.');
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Pub/Sub envelope missing message.data.

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:47:9
     if (!dataB64) throw new Error('Pub/Sub envelope missing message.data.');
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
-    if (!job) throw new Error('Pub/Sub payload missing job.');
+    if (true) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Pub/Sub payload missing job.

[Killed] BooleanLiteral
src/lib/transcoder/fake-transcoder.adapter.ts:47:9
     if (!dataB64) throw new Error('Pub/Sub envelope missing message.data.');
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
-    if (!job) throw new Error('Pub/Sub payload missing job.');
+    if (job) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Pub/Sub payload missing job.

[Survived] OptionalChaining
src/lib/transcoder/fake-transcoder.adapter.ts:48:21
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
     if (!job) throw new Error('Pub/Sub payload missing job.');
-    const videoId = job.labels?.['videoid'];
+    const videoId = job.labels['videoid'];
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';

[Killed] BooleanLiteral
src/lib/transcoder/fake-transcoder.adapter.ts:49:9
     const job = payload.job;
     if (!job) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
-    if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
+    if (videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Pub/Sub payload missing labels.videoid.

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:49:9
     const job = payload.job;
     if (!job) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
-    if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
+    if (false) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
killedBy: FakeTranscoderAdapter.parseEvent throws on missing labels.videoid
statusReason: promise resolved "{ type: 'JOB_SUCCEEDED', …(4) }" instead of rejecting

[Survived] LogicalOperator
src/lib/transcoder/fake-transcoder.adapter.ts:50:21
     if (!job) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
-    const jobName = job.name ?? '';
+    const jobName = job.name && '';
 
     if (job.state === 'SUCCEEDED') {

[Killed] EqualityOperator
src/lib/transcoder/fake-transcoder.adapter.ts:52:9
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
-    if (job.state === 'SUCCEEDED') {
+    if (job.state !== 'SUCCEEDED') {
       return {
         type: 'JOB_SUCCEEDED',
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Unexpected job.state: SUCCEEDED

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:52:9
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
-    if (job.state === 'SUCCEEDED') {
+    if (false) {
       return {
         type: 'JOB_SUCCEEDED',
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_SUCCEEDED payload
statusReason: Unexpected job.state: SUCCEEDED

[Killed] EqualityOperator
src/lib/transcoder/fake-transcoder.adapter.ts:61:9
         durationSec: 60, // synthetic; tests assert > 0
       };
     }
-    if (job.state === 'FAILED') {
+    if (job.state !== 'FAILED') {
       const raw = job.error?.message ?? 'unknown';
       return {
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_FAILED payload
statusReason: Unexpected job.state: FAILED

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:61:9
         durationSec: 60, // synthetic; tests assert > 0
       };
     }
-    if (job.state === 'FAILED') {
+    if (false) {
       const raw = job.error?.message ?? 'unknown';
       return {
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_FAILED payload
statusReason: Unexpected job.state: FAILED

[Killed] LogicalOperator
src/lib/transcoder/fake-transcoder.adapter.ts:62:19
       };
     }
     if (job.state === 'FAILED') {
-      const raw = job.error?.message ?? 'unknown';
+      const raw = job.error?.message && 'unknown';
       return {
         type: 'JOB_FAILED',
killedBy: FakeTranscoderAdapter.parseEvent parses a JOB_FAILED payload
statusReason: expected 'unknown' to contain 'unsupported codec'

[Survived] OptionalChaining
src/lib/transcoder/fake-transcoder.adapter.ts:62:19
       };
     }
     if (job.state === 'FAILED') {
-      const raw = job.error?.message ?? 'unknown';
+      const raw = job.error.message ?? 'unknown';
       return {
         type: 'JOB_FAILED',

[Killed] MethodExpression
src/lib/transcoder/fake-transcoder.adapter.ts:67:17
         type: 'JOB_FAILED',
         jobName,
         videoId: videoId as VideoId,
-        reason: raw.slice(0, 500),
+        reason: raw,
       };
     }
killedBy: FakeTranscoderAdapter.parseEvent caps reason at 500 chars
statusReason: expected 600 to be 500 // Object.is equality

[Killed] BlockStatement
src/lib/transcoder/fake-transcoder.adapter.ts:73:51
     throw new Error(`Unexpected job.state: ${String(job.state)}`);
   }
 
-  async cancelJob(jobName: string): Promise<void> {
-    const rec = this.jobs.get(jobName);
-    if (rec) rec.cancelled = true;
-  }
+  async cancelJob(jobName: string): Promise<void> {}
 
   // Test helper — not part of the VideoTranscoder interface.
killedBy: FakeTranscoderAdapter.cancelJob marks known jobs cancelled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:75:9
 
   async cancelJob(jobName: string): Promise<void> {
     const rec = this.jobs.get(jobName);
-    if (rec) rec.cancelled = true;
+    if (false) rec.cancelled = true;
   }
 
killedBy: FakeTranscoderAdapter.cancelJob marks known jobs cancelled
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/transcoder/fake-transcoder.adapter.ts:75:9
 
   async cancelJob(jobName: string): Promise<void> {
     const rec = this.jobs.get(jobName);
-    if (rec) rec.cancelled = true;
+    if (true) rec.cancelled = true;
   }
 
killedBy: FakeTranscoderAdapter.cancelJob is a no-op for unknown jobs
statusReason: promise rejected "TypeError: Cannot set properties of undef…" instead of resolving

[Killed] BlockStatement
src/lib/transcoder/fake-transcoder.adapter.ts:79:55
   }
 
   // Test helper — not part of the VideoTranscoder interface.
-  peekJob(jobName: string): FakeJobRecord | undefined {
-    return this.jobs.get(jobName);
-  }
+  peekJob(jobName: string): FakeJobRecord | undefined {}
 }
 
killedBy: FakeTranscoderAdapter.submitJob records the job for later lookup
statusReason: expected undefined to be defined
