[Killed] BlockStatement
src/lib/transcoder/gcp-transcoder.adapter.ts:44:76
 export class GcpTranscoderAdapter implements VideoTranscoder {
   constructor(private readonly opts: GcpTranscoderAdapterOptions) {}
 
-  async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {
-    const cfg = buildJobConfig(input);
-    const sdkConfig = {
-      ...cfg,
-      encryptions: cfg.encryptions?.map((e) => ({
-        id: e.id,
-        aes128: { keyBytes: Buffer.from(input.encryptionKey.bytes) },
-      })),
-    };
-    const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
-    const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
-    return { jobName: job.name ?? '' };
-  }
+  async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {}
 
   async parseEvent(raw: unknown): Promise<TranscoderEvent> {
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: Cannot read properties of undefined (reading 'jobName')

[Killed] ObjectLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:46:23
 
   async submitJob(input: TranscoderJobInput): Promise<TranscoderJobHandle> {
     const cfg = buildJobConfig(input);
-    const sdkConfig = {
-      ...cfg,
-      encryptions: cfg.encryptions?.map((e) => ({
-        id: e.id,
-        aes128: { keyBytes: Buffer.from(input.encryptionKey.bytes) },
-      })),
-    };
+    const sdkConfig = {};
     const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
     const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ArrowFunction
src/lib/transcoder/gcp-transcoder.adapter.ts:48:41
     const cfg = buildJobConfig(input);
     const sdkConfig = {
       ...cfg,
-      encryptions: cfg.encryptions?.map((e) => ({
-        id: e.id,
-        aes128: { keyBytes: Buffer.from(input.encryptionKey.bytes) },
-      })),
+      encryptions: cfg.encryptions?.map(() => undefined),
     };
     const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: expected undefined to be 'k1' // Object.is equality

[Survived] OptionalChaining
src/lib/transcoder/gcp-transcoder.adapter.ts:48:20
     const cfg = buildJobConfig(input);
     const sdkConfig = {
       ...cfg,
-      encryptions: cfg.encryptions?.map((e) => ({
+      encryptions: cfg.encryptions.map((e) => ({
         id: e.id,
         aes128: { keyBytes: Buffer.from(input.encryptionKey.bytes) },

[Killed] StringLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:53:20
         aes128: { keyBytes: Buffer.from(input.encryptionKey.bytes) },
       })),
     };
-    const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
+    const parent = ``;
     const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
     return { jobName: job.name ?? '' };
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: expected '' to be 'projects/proj/locations/us-central1' // Object.is equality

[Killed] ObjectLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:54:52
       })),
     };
     const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
-    const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
+    const [job] = await this.opts.client.createJob({});
     return { jobName: job.name ?? '' };
   }
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: expected undefined to be 'projects/proj/locations/us-central1' // Object.is equality

[Killed] LogicalOperator
src/lib/transcoder/gcp-transcoder.adapter.ts:55:23
     };
     const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
     const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
-    return { jobName: job.name ?? '' };
+    return { jobName: job.name && '' };
   }
 
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: expected '' to be 'projects/proj/locations/us-central1/j…' // Object.is equality

[Killed] ObjectLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:55:12
     };
     const parent = `projects/${this.opts.projectId}/locations/${this.opts.location}`;
     const [job] = await this.opts.client.createJob({ parent, job: { config: sdkConfig } });
-    return { jobName: job.name ?? '' };
+    return {};
   }
 
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: expected undefined to be 'projects/proj/locations/us-central1/j…' // Object.is equality

[Killed] ConditionalExpression
src/lib/transcoder/gcp-transcoder.adapter.ts:61:9
   async parseEvent(raw: unknown): Promise<TranscoderEvent> {
     const envelope = raw as PubSubEnvelope;
     const dataB64 = envelope.message?.data;
-    if (!dataB64) throw new Error('Pub/Sub envelope missing message.data.');
+    if (false) throw new Error('Pub/Sub envelope missing message.data.');
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
killedBy: GcpTranscoderAdapter.parseEvent — malformed input throws on missing message.data
statusReason: expected [Function] to throw error matching /data/ but got 'The first argument must be of type st…'

[Killed] StringLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:65:34
     const payload = JSON.parse(Buffer.from(dataB64, 'base64').toString('utf-8')) as TranscoderPayload;
     const job = payload.job;
     if (!job) throw new Error('Pub/Sub payload missing job.');
-    const videoId = job.labels?.['videoid'];
+    const videoId = job.labels?.[""];
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
killedBy: GcpTranscoderAdapter.parseEvent — JOB_SUCCEEDED calls getJob to obtain output duration and returns a JOB_SUCCEEDED event
statusReason: Pub/Sub payload missing labels.videoid.

[Killed] ConditionalExpression
src/lib/transcoder/gcp-transcoder.adapter.ts:66:9
     const job = payload.job;
     if (!job) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
-    if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
+    if (true) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
killedBy: GcpTranscoderAdapter.parseEvent — JOB_SUCCEEDED calls getJob to obtain output duration and returns a JOB_SUCCEEDED event
statusReason: Pub/Sub payload missing labels.videoid.

[NoCoverage] StringLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:67:33
     if (!job) throw new Error('Pub/Sub payload missing job.');
     const videoId = job.labels?.['videoid'];
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
-    const jobName = job.name ?? '';
+    const jobName = job.name ?? "Stryker was here!";
 
     if (job.state === 'SUCCEEDED') {

[Killed] BlockStatement
src/lib/transcoder/gcp-transcoder.adapter.ts:69:36
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
-    if (job.state === 'SUCCEEDED') {
-      const [full] = await this.opts.client.getJob({ name: jobName });
-      const durationSec = Number(full.outputDurationSec ?? 0);
-      return {
-        type: 'JOB_SUCCEEDED',
-        jobName,
-        videoId: videoId as VideoId,
-        manifestPath: `videos/${videoId}/hls/manifest.m3u8`,
-        durationSec,
-      };
-    }
+    if (job.state === 'SUCCEEDED') {}
     if (job.state === 'FAILED') {
       return {
killedBy: GcpTranscoderAdapter.parseEvent — JOB_SUCCEEDED calls getJob to obtain output duration and returns a JOB_SUCCEEDED event
statusReason: Unexpected job.state: SUCCEEDED

[Killed] ConditionalExpression
src/lib/transcoder/gcp-transcoder.adapter.ts:69:9
     if (!videoId) throw new Error('Pub/Sub payload missing labels.videoid.');
     const jobName = job.name ?? '';
 
-    if (job.state === 'SUCCEEDED') {
+    if (true) {
       const [full] = await this.opts.client.getJob({ name: jobName });
       const durationSec = Number(full.outputDurationSec ?? 0);
killedBy: GcpTranscoderAdapter.parseEvent — JOB_FAILED does not call getJob and returns a JOB_FAILED event
statusReason: (intermediate value) is not iterable

[Killed] LogicalOperator
src/lib/transcoder/gcp-transcoder.adapter.ts:71:34
 
     if (job.state === 'SUCCEEDED') {
       const [full] = await this.opts.client.getJob({ name: jobName });
-      const durationSec = Number(full.outputDurationSec ?? 0);
+      const durationSec = Number(full.outputDurationSec && 0);
       return {
         type: 'JOB_SUCCEEDED',
killedBy: GcpTranscoderAdapter.parseEvent — JOB_SUCCEEDED calls getJob to obtain output duration and returns a JOB_SUCCEEDED event
statusReason: expected +0 to be 123 // Object.is equality

[Killed] BlockStatement
src/lib/transcoder/gcp-transcoder.adapter.ts:80:33
         durationSec,
       };
     }
-    if (job.state === 'FAILED') {
-      return {
-        type: 'JOB_FAILED',
-        jobName,
-        videoId: videoId as VideoId,
-        reason: (job.error?.message ?? 'unknown').slice(0, 500),
-      };
-    }
+    if (job.state === 'FAILED') {}
     throw new Error(`Unexpected job.state: ${String(job.state)}`);
   }
killedBy: GcpTranscoderAdapter.parseEvent — JOB_FAILED does not call getJob and returns a JOB_FAILED event
statusReason: Unexpected job.state: FAILED

[Killed] ObjectLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:81:14
       };
     }
     if (job.state === 'FAILED') {
-      return {
-        type: 'JOB_FAILED',
-        jobName,
-        videoId: videoId as VideoId,
-        reason: (job.error?.message ?? 'unknown').slice(0, 500),
-      };
+      return {};
     }
     throw new Error(`Unexpected job.state: ${String(job.state)}`);
killedBy: GcpTranscoderAdapter.parseEvent — JOB_FAILED does not call getJob and returns a JOB_FAILED event
statusReason: expected FAILED

[Killed] StringLiteral
src/lib/transcoder/gcp-transcoder.adapter.ts:82:15
     }
     if (job.state === 'FAILED') {
       return {
-        type: 'JOB_FAILED',
+        type: "",
         jobName,
         videoId: videoId as VideoId,
killedBy: GcpTranscoderAdapter.parseEvent — JOB_FAILED does not call getJob and returns a JOB_FAILED event
statusReason: expected FAILED

[Killed] LogicalOperator
src/lib/transcoder/gcp-transcoder.adapter.ts:85:18
         type: 'JOB_FAILED',
         jobName,
         videoId: videoId as VideoId,
-        reason: (job.error?.message ?? 'unknown').slice(0, 500),
+        reason: (job.error?.message && 'unknown').slice(0, 500),
       };
     }
killedBy: GcpTranscoderAdapter.parseEvent — JOB_FAILED does not call getJob and returns a JOB_FAILED event
statusReason: expected 'unknown' to contain 'codec failure'

[Survived] MethodExpression
src/lib/transcoder/gcp-transcoder.adapter.ts:85:17
         type: 'JOB_FAILED',
         jobName,
         videoId: videoId as VideoId,
-        reason: (job.error?.message ?? 'unknown').slice(0, 500),
+        reason: job.error?.message ?? 'unknown',
       };
     }

[Killed] BlockStatement
src/lib/transcoder/gcp-transcoder.adapter.ts:91:51
     throw new Error(`Unexpected job.state: ${String(job.state)}`);
   }
 
-  async cancelJob(jobName: string): Promise<void> {
-    try {
-      await this.opts.client.cancelJob({ name: jobName });
-    } catch (err) {
-      const code = (err as { code?: number }).code;
-      if (code === 5) return; // gRPC NOT_FOUND — tolerate.
-      throw err;
-    }
-  }
+  async cancelJob(jobName: string): Promise<void> {}
 }
 
killedBy: GcpTranscoderAdapter.cancelJob calls client.cancelJob with the job name
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/transcoder/gcp-transcoder.adapter.ts:92:9
   }
 
   async cancelJob(jobName: string): Promise<void> {
-    try {
-      await this.opts.client.cancelJob({ name: jobName });
-    } catch (err) {
+    try {} catch (err) {
       const code = (err as { code?: number }).code;
       if (code === 5) return; // gRPC NOT_FOUND — tolerate.
killedBy: GcpTranscoderAdapter.cancelJob calls client.cancelJob with the job name
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/lib/transcoder/gcp-transcoder.adapter.ts:94:19
   async cancelJob(jobName: string): Promise<void> {
     try {
       await this.opts.client.cancelJob({ name: jobName });
-    } catch (err) {
-      const code = (err as { code?: number }).code;
-      if (code === 5) return; // gRPC NOT_FOUND — tolerate.
-      throw err;
-    }
+    } catch (err) {}
   }
 }
killedBy: GcpTranscoderAdapter.cancelJob propagates other errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/transcoder/gcp-transcoder.adapter.ts:96:11
       await this.opts.client.cancelJob({ name: jobName });
     } catch (err) {
       const code = (err as { code?: number }).code;
-      if (code === 5) return; // gRPC NOT_FOUND — tolerate.
+      if (true) return; // gRPC NOT_FOUND — tolerate.
       throw err;
     }
killedBy: GcpTranscoderAdapter.cancelJob propagates other errors
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/lib/transcoder/gcp-transcoder.adapter.ts:96:11
       await this.opts.client.cancelJob({ name: jobName });
     } catch (err) {
       const code = (err as { code?: number }).code;
-      if (code === 5) return; // gRPC NOT_FOUND — tolerate.
+      if (code !== 5) return; // gRPC NOT_FOUND — tolerate.
       throw err;
     }
killedBy: GcpTranscoderAdapter.cancelJob swallows NOT_FOUND from the SDK
statusReason: promise rejected "Error: not found { code: 5 }" instead of resolving
