[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:39:87
 const MAX_SUBMIT_ATTEMPTS = 3;
 const BACKOFF_MS = [1_000, 2_000, 4_000];
 
-const EXT_BY_CONTENT_TYPE: Record<SupportedVideoContentType, 'mp4' | 'mov' | 'mkv'> = {
-  'video/mp4': 'mp4',
-  'video/quicktime': 'mov',
-  'video/x-matroska': 'mkv',
-};
+const EXT_BY_CONTENT_TYPE: Record<SupportedVideoContentType, 'mp4' | 'mov' | 'mkv'> = {};
 
 const DELETABLE_STATES: Readonly<Set<Video['state']>> = new Set([
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: expected 'videos/v-new/source.undefined' to be 'videos/v-new/source.mp4' // Object.is equality

[Killed] ArrayDeclaration
api-video/src/lib/video.service.ts:45:65
   'video/x-matroska': 'mkv',
 };
 
-const DELETABLE_STATES: Readonly<Set<Video['state']>> = new Set([
-  'PENDING_UPLOAD',
-  'UPLOADED',
-  'FAILED',
-  'TRANSCODING',
-  'READY',
-]);
+const DELETABLE_STATES: Readonly<Set<Video['state']>> = new Set([]);
 
 export interface CreateUploadSessionInput {
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: Operation is not valid in state PENDING_UPLOAD.

[Killed] BlockStatement
api-video/src/lib/video.service.ts:71:34
   sleep?: (ms: number) => Promise<void>;
 }
 
-function nowIso(): ISODateString {
-  return new Date().toISOString() as ISODateString;
-}
+function nowIso(): ISODateString {}
 
 @Injectable()
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1', 'l1', Any<String> ]

Received:

  1st vi.fn() call:

  [
    "v1",

[Survived] StringLiteral
api-video/src/lib/video.service.ts:77:40
 
 @Injectable()
 export class VideoService {
-  private readonly logger = new Logger('VideoService');
+  private readonly logger = new Logger("");
   private readonly sleep: (ms: number) => Promise<void>;
 

[Killed] BlockStatement
api-video/src/lib/video.service.ts:86:5
     @Inject(VIDEO_CONFIG) private readonly cfg: VideoConfig,
     @Inject(VIDEO_TRANSCODER) private readonly transcoder: VideoTranscoder,
     deps?: VideoServiceDeps,
-  ) {
-    this.sleep = deps?.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
-  }
+  ) {}
 
   async createUploadSession(args: CreateUploadSessionInput): Promise<CreateUploadSessionResult> {
killedBy: VideoService.completeUpload — slice B retries submitJob up to 3 times before failing
statusReason: this.sleep is not a function

[Killed] OptionalChaining
api-video/src/lib/video.service.ts:87:18
     @Inject(VIDEO_TRANSCODER) private readonly transcoder: VideoTranscoder,
     deps?: VideoServiceDeps,
   ) {
-    this.sleep = deps?.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
+    this.sleep = deps.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
   }
 
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: Cannot read properties of undefined (reading 'sleep')

[NoCoverage] ArrowFunction
api-video/src/lib/video.service.ts:87:54
     @Inject(VIDEO_TRANSCODER) private readonly transcoder: VideoTranscoder,
     deps?: VideoServiceDeps,
   ) {
-    this.sleep = deps?.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
+    this.sleep = deps?.sleep ?? ((ms) => new Promise(() => undefined));
   }
 

[Killed] BlockStatement
api-video/src/lib/video.service.ts:90:97
     this.sleep = deps?.sleep ?? ((ms) => new Promise((r) => setTimeout(r, ms)));
   }
 
-  async createUploadSession(args: CreateUploadSessionInput): Promise<CreateUploadSessionResult> {
-    if (args.lessonVideoId) throw new LessonAlreadyHasVideoException();
-    const videoId = this.repo.newId<VideoId>();
-    const ext = EXT_BY_CONTENT_TYPE[args.input.contentType];
-    const path = `videos/${videoId}/source.${ext}`;
-    const now = nowIso();
-    const video: Video = {
-      id: videoId,
-      ownerInstructorId: args.uid,
-      courseId: args.courseId,
-      lessonId: args.lessonId,
-      state: 'PENDING_UPLOAD',
-      source: { bucket: this.cfg.sourceBucket, path, sizeBytes: args.input.sizeBytes },
-      createdAt: now,
-      updatedAt: now,
-    };
-    await this.repo.createVideo(video);
-    const session = await this.storage.createResumableSession({
-      bucket: this.cfg.sourceBucket,
-      path,
-      contentType: args.input.contentType,
-      videoId,
-    });
-    return { videoId, uploadSessionUri: session.uri, expiresAt: session.expiresAt };
-  }
+  async createUploadSession(args: CreateUploadSessionInput): Promise<CreateUploadSessionResult> {}
 
   async getVideo(vid: VideoId): Promise<Video> {
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: Cannot read properties of undefined (reading 'videoId')

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:91:9
   }
 
   async createUploadSession(args: CreateUploadSessionInput): Promise<CreateUploadSessionResult> {
-    if (args.lessonVideoId) throw new LessonAlreadyHasVideoException();
+    if (false) throw new LessonAlreadyHasVideoException();
     const videoId = this.repo.newId<VideoId>();
     const ext = EXT_BY_CONTENT_TYPE[args.input.contentType];
killedBy: VideoService.createUploadSession rejects when the lesson already has a video
statusReason: expected TypeError: Cannot read properties of unde… to be an instance of LessonAlreadyHasVideoException

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:91:9
   }
 
   async createUploadSession(args: CreateUploadSessionInput): Promise<CreateUploadSessionResult> {
-    if (args.lessonVideoId) throw new LessonAlreadyHasVideoException();
+    if (true) throw new LessonAlreadyHasVideoException();
     const videoId = this.repo.newId<VideoId>();
     const ext = EXT_BY_CONTENT_TYPE[args.input.contentType];
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: This lesson already has a video. Replace flow is not yet supported.

[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:96:26
     const ext = EXT_BY_CONTENT_TYPE[args.input.contentType];
     const path = `videos/${videoId}/source.${ext}`;
     const now = nowIso();
-    const video: Video = {
-      id: videoId,
-      ownerInstructorId: args.uid,
-      courseId: args.courseId,
-      lessonId: args.lessonId,
-      state: 'PENDING_UPLOAD',
-      source: { bucket: this.cfg.sourceBucket, path, sizeBytes: args.input.sizeBytes },
-      createdAt: now,
-      updatedAt: now,
-    };
+    const video: Video = {};
     await this.repo.createVideo(video);
     const session = await this.storage.createResumableSession({
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: expected undefined to be 'PENDING_UPLOAD' // Object.is equality

[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:107:63
       updatedAt: now,
     };
     await this.repo.createVideo(video);
-    const session = await this.storage.createResumableSession({
-      bucket: this.cfg.sourceBucket,
-      path,
-      contentType: args.input.contentType,
-      videoId,
-    });
+    const session = await this.storage.createResumableSession({});
     return { videoId, uploadSessionUri: session.uri, expiresAt: session.expiresAt };
   }
killedBy: VideoService.createUploadSession creates a Video doc and returns the session URI
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[NoCoverage] BlockStatement
api-video/src/lib/video.service.ts:116:48
     return { videoId, uploadSessionUri: session.uri, expiresAt: session.expiresAt };
   }
 
-  async getVideo(vid: VideoId): Promise<Video> {
-    const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
-    return v;
-  }
+  async getVideo(vid: VideoId): Promise<Video> {}
 
   async markFailed(vid: VideoId, reason: string): Promise<Video> {

[NoCoverage] ConditionalExpression
api-video/src/lib/video.service.ts:118:9
 
   async getVideo(vid: VideoId): Promise<Video> {
     const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
+    if (false) throw new VideoNotFoundException();
     return v;
   }

[NoCoverage] BooleanLiteral
api-video/src/lib/video.service.ts:118:9
 
   async getVideo(vid: VideoId): Promise<Video> {
     const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
+    if (v) throw new VideoNotFoundException();
     return v;
   }

[Killed] BlockStatement
api-video/src/lib/video.service.ts:122:66
     return v;
   }
 
-  async markFailed(vid: VideoId, reason: string): Promise<Video> {
-    const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
-    if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
-    const updatedAt = nowIso();
-    await this.repo.updateVideo(vid, { state: 'FAILED', failureReason: reason, updatedAt });
-    return { ...v, state: 'FAILED', failureReason: reason, updatedAt };
-  }
+  async markFailed(vid: VideoId, reason: string): Promise<Video> {}
 
   async completeUpload(vid: VideoId): Promise<Video> {
killedBy: VideoService.markFailed advances PENDING_UPLOAD to FAILED with a reason
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1', ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:124:9
 
   async markFailed(vid: VideoId, reason: string): Promise<Video> {
     const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
+    if (true) throw new VideoNotFoundException();
     if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
     const updatedAt = nowIso();
killedBy: VideoService.markFailed advances PENDING_UPLOAD to FAILED with a reason
statusReason: Video not found.

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:125:9
   async markFailed(vid: VideoId, reason: string): Promise<Video> {
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
-    if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
+    if (false) throw new InvalidVideoStateException(v.state);
     const updatedAt = nowIso();
     await this.repo.updateVideo(vid, { state: 'FAILED', failureReason: reason, updatedAt });
killedBy: VideoService.markFailed rejects FAILED transition from UPLOADED
statusReason: promise resolved "{ id: 'v1', …(8) }" instead of rejecting

[Killed] EqualityOperator
api-video/src/lib/video.service.ts:125:9
   async markFailed(vid: VideoId, reason: string): Promise<Video> {
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
-    if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
+    if (v.state === 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
     const updatedAt = nowIso();
     await this.repo.updateVideo(vid, { state: 'FAILED', failureReason: reason, updatedAt });
killedBy: VideoService.markFailed advances PENDING_UPLOAD to FAILED with a reason
statusReason: Operation is not valid in state PENDING_UPLOAD.

[Killed] StringLiteral
api-video/src/lib/video.service.ts:127:47
     if (!v) throw new VideoNotFoundException();
     if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
     const updatedAt = nowIso();
-    await this.repo.updateVideo(vid, { state: 'FAILED', failureReason: reason, updatedAt });
+    await this.repo.updateVideo(vid, { state: "", failureReason: reason, updatedAt });
     return { ...v, state: 'FAILED', failureReason: reason, updatedAt };
   }
killedBy: VideoService.markFailed advances PENDING_UPLOAD to FAILED with a reason
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1', ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
    "v1",

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:134:9
   async completeUpload(vid: VideoId): Promise<Video> {
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
-    if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
+    if (true) throw new InvalidVideoStateException(v.state);
 
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_MISSING when HEAD returns null
statusReason: expected VideoException: Operation is not valid in… { …(3) } to be an instance of UploadObjectMissingException

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:137:9
     if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
 
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
-    if (!head) throw new UploadObjectMissingException();
+    if (true) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
     if (head.size > declared * SIZE_TOLERANCE) {
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes object when over tolerance
statusReason: expected VideoException: No source object exists a… { …(3) } to be an instance of UploadObjectSizeMismatchException

[Killed] BooleanLiteral
api-video/src/lib/video.service.ts:137:9
     if (v.state !== 'PENDING_UPLOAD') throw new InvalidVideoStateException(v.state);
 
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
-    if (!head) throw new UploadObjectMissingException();
+    if (head) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
     if (head.size > declared * SIZE_TOLERANCE) {
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_MISSING when HEAD returns null
statusReason: expected TypeError: Cannot read properties of null… to be an instance of UploadObjectMissingException

[Killed] LogicalOperator
api-video/src/lib/video.service.ts:138:22
 
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
     if (!head) throw new UploadObjectMissingException();
-    const declared = v.source.sizeBytes ?? 0;
+    const declared = v.source.sizeBytes && 0;
     if (head.size > declared * SIZE_TOLERANCE) {
       await this.storage
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "VideoException: Uploaded object size exce… { …(3) }" instead of resolving

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:139:9
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
     if (!head) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
-    if (head.size > declared * SIZE_TOLERANCE) {
+    if (true) {
       await this.storage
         .deleteObject({ bucket: v.source.bucket, path: v.source.path })
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "VideoException: Uploaded object size exce… { …(3) }" instead of resolving

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:139:9
     const head = await this.storage.headObject({ bucket: v.source.bucket, path: v.source.path });
     if (!head) throw new UploadObjectMissingException();
     const declared = v.source.sizeBytes ?? 0;
-    if (head.size > declared * SIZE_TOLERANCE) {
+    if (false) {
       await this.storage
         .deleteObject({ bucket: v.source.bucket, path: v.source.path })
killedBy: VideoService.completeUpload — slice A (guard tests) throws UPLOAD_OBJECT_SIZE_MISMATCH and deletes object when over tolerance
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
api-video/src/lib/video.service.ts:147:9
     }
 
     let probe;
-    try {
-      probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
-    } catch (err) {
+    try {} catch (err) {
       this.logger.warn(`ffprobe failed for ${vid}: ${(err as Error).message}`);
       return this.repo.markFailedFromSubmission({
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Survived] ObjectLiteral
api-video/src/lib/video.service.ts:148:46
 
     let probe;
     try {
-      probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
+      probe = await this.storage.probeSource({});
     } catch (err) {
       this.logger.warn(`ffprobe failed for ${vid}: ${(err as Error).message}`);

[Killed] BlockStatement
api-video/src/lib/video.service.ts:149:19
     let probe;
     try {
       probe = await this.storage.probeSource({ bucket: v.source.bucket, path: v.source.path });
-    } catch (err) {
-      this.logger.warn(`ffprobe failed for ${vid}: ${(err as Error).message}`);
-      return this.repo.markFailedFromSubmission({
-        vid,
-        failureReason: `SOURCE_PROBE_FAILED: ${(err as Error).message}`.slice(0, 500),
-        actualSizeBytes: head.size,
-        nowIso: nowIso(),
-      });
-    }
+    } catch (err) {}
 
     const keyBytes = new Uint8Array(randomBytes(16));
killedBy: VideoService.completeUpload — slice B ffprobe failure → markFailedFromSubmission with SOURCE_PROBE_FAILED
statusReason: Cannot read properties of undefined (reading 'height')

[Survived] MethodExpression
api-video/src/lib/video.service.ts:153:24
       this.logger.warn(`ffprobe failed for ${vid}: ${(err as Error).message}`);
       return this.repo.markFailedFromSubmission({
         vid,
-        failureReason: `SOURCE_PROBE_FAILED: ${(err as Error).message}`.slice(0, 500),
+        failureReason: `SOURCE_PROBE_FAILED: ${(err as Error).message}`,
         actualSizeBytes: head.size,
         nowIso: nowIso(),

[Survived] StringLiteral
api-video/src/lib/video.service.ts:161:23
 
     const keyBytes = new Uint8Array(randomBytes(16));
     const keyId = this.repo.newId<VideoKeyId>();
-    const sourceUri = `gs://${v.source.bucket}/${v.source.path}`;
+    const sourceUri = ``;
     const outputUriPrefix = `gs://${this.cfg.outputBucket}/videos/${vid}/hls/`;
     const submit = await this.submitWithRetry({

[Survived] StringLiteral
api-video/src/lib/video.service.ts:162:29
     const keyBytes = new Uint8Array(randomBytes(16));
     const keyId = this.repo.newId<VideoKeyId>();
     const sourceUri = `gs://${v.source.bucket}/${v.source.path}`;
-    const outputUriPrefix = `gs://${this.cfg.outputBucket}/videos/${vid}/hls/`;
+    const outputUriPrefix = ``;
     const submit = await this.submitWithRetry({
       videoId: vid,

[Survived] LogicalOperator
api-video/src/lib/video.service.ts:169:14
       outputUriPrefix,
       encryptionKey: { id: keyId, bytes: keyBytes },
       sourceHeight: probe.height,
-      topic: this.cfg.transcoderTopic ?? '',
+      topic: this.cfg.transcoderTopic && '',
     });
     if (!submit.ok) {

[Survived] StringLiteral
api-video/src/lib/video.service.ts:169:42
       outputUriPrefix,
       encryptionKey: { id: keyId, bytes: keyBytes },
       sourceHeight: probe.height,
-      topic: this.cfg.transcoderTopic ?? '',
+      topic: this.cfg.transcoderTopic ?? "Stryker was here!",
     });
     if (!submit.ok) {

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:171:9
       sourceHeight: probe.height,
       topic: this.cfg.transcoderTopic ?? '',
     });
-    if (!submit.ok) {
+    if (true) {
       return this.repo.markFailedFromSubmission({
         vid,
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] BlockStatement
api-video/src/lib/video.service.ts:171:21
       sourceHeight: probe.height,
       topic: this.cfg.transcoderTopic ?? '',
     });
-    if (!submit.ok) {
-      return this.repo.markFailedFromSubmission({
-        vid,
-        failureReason: `TRANSCODER_SUBMIT_FAILED: ${submit.lastError}`.slice(0, 500),
-        actualSizeBytes: head.size,
-        nowIso: nowIso(),
-      });
-    }
+    if (!submit.ok) {}
 
     return this.repo.finalizeUploadWithJob({
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected 'TRANSCODING' to be 'FAILED' // Object.is equality

[Survived] MethodExpression
api-video/src/lib/video.service.ts:174:24
     if (!submit.ok) {
       return this.repo.markFailedFromSubmission({
         vid,
-        failureReason: `TRANSCODER_SUBMIT_FAILED: ${submit.lastError}`.slice(0, 500),
+        failureReason: `TRANSCODER_SUBMIT_FAILED: ${submit.lastError}`,
         actualSizeBytes: head.size,
         nowIso: nowIso(),

[Killed] BlockStatement
api-video/src/lib/video.service.ts:192:80
 
   private async submitWithRetry(
     input: Parameters<VideoTranscoder['submitJob']>[0],
-  ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
-    let lastError = 'unknown';
-    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
-      try {
-        const handle = await this.transcoder.submitJob(input);
-        return { ok: true, jobName: handle.jobName };
-      } catch (err) {
-        lastError = (err as Error).message;
-        this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
-          await this.sleep(BACKOFF_MS[attempt]!);
-        }
-      }
-    }
-    return { ok: false, lastError };
-  }
+  ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {}
 
   async handleTranscoderEvent(
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: promise rejected "TypeError: Cannot read properties of unde…" instead of resolving

[Killed] EqualityOperator
api-video/src/lib/video.service.ts:194:27
     input: Parameters<VideoTranscoder['submitJob']>[0],
   ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
     let lastError = 'unknown';
-    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
+    for (let attempt = 0; attempt >= MAX_SUBMIT_ATTEMPTS; attempt++) {
       try {
         const handle = await this.transcoder.submitJob(input);
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] BlockStatement
api-video/src/lib/video.service.ts:194:69
     input: Parameters<VideoTranscoder['submitJob']>[0],
   ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
     let lastError = 'unknown';
-    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
-      try {
-        const handle = await this.transcoder.submitJob(input);
-        return { ok: true, jobName: handle.jobName };
-      } catch (err) {
-        lastError = (err as Error).message;
-        this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
-          await this.sleep(BACKOFF_MS[attempt]!);
-        }
-      }
-    }
+    for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {}
     return { ok: false, lastError };
   }
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] BlockStatement
api-video/src/lib/video.service.ts:195:11
   ): Promise<{ ok: true; jobName: string } | { ok: false; lastError: string }> {
     let lastError = 'unknown';
     for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
-      try {
-        const handle = await this.transcoder.submitJob(input);
-        return { ok: true, jobName: handle.jobName };
-      } catch (err) {
+      try {} catch (err) {
         lastError = (err as Error).message;
         this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
api-video/src/lib/video.service.ts:197:22
     for (let attempt = 0; attempt < MAX_SUBMIT_ATTEMPTS; attempt++) {
       try {
         const handle = await this.transcoder.submitJob(input);
-        return { ok: true, jobName: handle.jobName };
+        return { ok: false, jobName: handle.jobName };
       } catch (err) {
         lastError = (err as Error).message;
killedBy: VideoService.completeUpload — slice A (guard tests) accepts size up to declared × 1.05
statusReason: expected undefined to be defined

[Survived] BlockStatement
api-video/src/lib/video.service.ts:198:21
       try {
         const handle = await this.transcoder.submitJob(input);
         return { ok: true, jobName: handle.jobName };
-      } catch (err) {
-        lastError = (err as Error).message;
-        this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
-          await this.sleep(BACKOFF_MS[attempt]!);
-        }
-      }
+      } catch (err) {}
     }
     return { ok: false, lastError };

[Survived] ArithmeticOperator
api-video/src/lib/video.service.ts:200:47
         return { ok: true, jobName: handle.jobName };
       } catch (err) {
         lastError = (err as Error).message;
-        this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
+        this.logger.warn(`submitJob attempt ${attempt - 1} failed: ${lastError}`);
         if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
           await this.sleep(BACKOFF_MS[attempt]!);

[Survived] StringLiteral
api-video/src/lib/video.service.ts:200:26
         return { ok: true, jobName: handle.jobName };
       } catch (err) {
         lastError = (err as Error).message;
-        this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
+        this.logger.warn(``);
         if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
           await this.sleep(BACKOFF_MS[attempt]!);

[Survived] ArithmeticOperator
api-video/src/lib/video.service.ts:201:23
       } catch (err) {
         lastError = (err as Error).message;
         this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
+        if (attempt < MAX_SUBMIT_ATTEMPTS + 1) {
           await this.sleep(BACKOFF_MS[attempt]!);
         }

[Survived] BlockStatement
api-video/src/lib/video.service.ts:201:48
       } catch (err) {
         lastError = (err as Error).message;
         this.logger.warn(`submitJob attempt ${attempt + 1} failed: ${lastError}`);
-        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {
-          await this.sleep(BACKOFF_MS[attempt]!);
-        }
+        if (attempt < MAX_SUBMIT_ATTEMPTS - 1) {}
       }
     }

[Killed] BooleanLiteral
api-video/src/lib/video.service.ts:206:18
         }
       }
     }
-    return { ok: false, lastError };
+    return { ok: true, lastError };
   }
 
killedBy: VideoService.completeUpload — slice B exhausts retries → markFailedFromSubmission with TRANSCODER_SUBMIT_FAILED
statusReason: expected 'TRANSCODING' to be 'FAILED' // Object.is equality

[Killed] BlockStatement
api-video/src/lib/video.service.ts:211:51
 
   async handleTranscoderEvent(
     event: TranscoderEvent,
-  ): Promise<{ acted: boolean; reason?: string }> {
-    const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
-    if (event.type === 'JOB_SUCCEEDED') {
-      return this.repo.applyTranscoderResult({
-        ...common,
-        outcome: {
-          kind: 'READY',
-          manifestPath: event.manifestPath,
-          durationSec: event.durationSec,
-          outputBucket: this.cfg.outputBucket,
-        },
-      });
-    }
-    return this.repo.applyTranscoderResult({
-      ...common,
-      outcome: { kind: 'FAILED', reason: event.reason },
-    });
-  }
+  ): Promise<{ acted: boolean; reason?: string }> {}
 
   async delete(vid: VideoId): Promise<void> {
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected undefined to deeply equal { acted: true }

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:213:9
     event: TranscoderEvent,
   ): Promise<{ acted: boolean; reason?: string }> {
     const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
-    if (event.type === 'JOB_SUCCEEDED') {
+    if (true) {
       return this.repo.applyTranscoderResult({
         ...common,
killedBy: VideoService.handleTranscoderEvent forwards JOB_FAILED with FAILED outcome carrying reason
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {
