[Killed] BlockStatement
api-video/src/lib/video.service.ts:213:41
     event: TranscoderEvent,
   ): Promise<{ acted: boolean; reason?: string }> {
     const common = { videoId: event.videoId, jobName: event.jobName, nowIso: nowIso() };
-    if (event.type === 'JOB_SUCCEEDED') {
-      return this.repo.applyTranscoderResult({
-        ...common,
-        outcome: {
-          kind: 'READY',
-          manifestPath: event.manifestPath,
-          durationSec: event.durationSec,
-          outputBucket: this.cfg.outputBucket,
-        },
-      });
-    }
+    if (event.type === 'JOB_SUCCEEDED') {}
     return this.repo.applyTranscoderResult({
       ...common,
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:216:18
     if (event.type === 'JOB_SUCCEEDED') {
       return this.repo.applyTranscoderResult({
         ...common,
-        outcome: {
-          kind: 'READY',
-          manifestPath: event.manifestPath,
-          durationSec: event.durationSec,
-          outputBucket: this.cfg.outputBucket,
-        },
+        outcome: {},
       });
     }
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] StringLiteral
api-video/src/lib/video.service.ts:217:17
       return this.repo.applyTranscoderResult({
         ...common,
         outcome: {
-          kind: 'READY',
+          kind: "",
           manifestPath: event.manifestPath,
           durationSec: event.durationSec,
killedBy: VideoService.handleTranscoderEvent forwards JOB_SUCCEEDED with READY outcome carrying manifest path + duration + output bucket
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

@@ -1,11 +1,12 @@
  [

[Killed] StringLiteral
api-video/src/lib/video.service.ts:226:24
     }
     return this.repo.applyTranscoderResult({
       ...common,
-      outcome: { kind: 'FAILED', reason: event.reason },
+      outcome: { kind: "", reason: event.reason },
     });
   }
killedBy: VideoService.handleTranscoderEvent forwards JOB_FAILED with FAILED outcome carrying reason
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:226:16
     }
     return this.repo.applyTranscoderResult({
       ...common,
-      outcome: { kind: 'FAILED', reason: event.reason },
+      outcome: {},
     });
   }
killedBy: VideoService.handleTranscoderEvent forwards JOB_FAILED with FAILED outcome carrying reason
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
api-video/src/lib/video.service.ts:230:45
     });
   }
 
-  async delete(vid: VideoId): Promise<void> {
-    const v = await this.repo.getVideo(vid);
-    if (!v) throw new VideoNotFoundException();
-    if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
-
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
-      await this.transcoder.cancelJob(v.transcoderJobName).catch((err) =>
-        this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
-      );
-    }
-    if (v.state === 'READY' && v.output?.bucket) {
-      await this.storage.deletePrefix({
-        bucket: v.output.bucket,
-        prefix: `videos/${vid}/`,
-      });
-    }
-    await this.storage
-      .deleteObject({ bucket: v.source.bucket, path: v.source.path })
-      .catch(() => undefined);
-    await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
-  }
+  async delete(vid: VideoId): Promise<void> {}
 
   async deleteForLesson(lid: LessonId): Promise<void> {
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'src-bucket', …(1) } ]

Number of calls: 0

[Killed] BooleanLiteral
api-video/src/lib/video.service.ts:233:9
   async delete(vid: VideoId): Promise<void> {
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
-    if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
+    if (DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
 
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: Operation is not valid in state PENDING_UPLOAD.

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:233:9
   async delete(vid: VideoId): Promise<void> {
     const v = await this.repo.getVideo(vid);
     if (!v) throw new VideoNotFoundException();
-    if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
+    if (false) throw new InvalidVideoStateException(v.state);
 
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
killedBy: VideoService.delete — slice B state widening rejects unknown post-slice-B states
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
api-video/src/lib/video.service.ts:235:9
     if (!v) throw new VideoNotFoundException();
     if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
 
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
+    if (v.state === 'TRANSCODING' || v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch((err) =>
         this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
killedBy: VideoService.delete — slice B state widening TRANSCODING with no transcoderJobName: skips cancelJob
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:235:9
     if (!v) throw new VideoNotFoundException();
     if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
 
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
+    if (false) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch((err) =>
         this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
killedBy: VideoService.delete cancels transcoder job and deletes when state is TRANSCODING
statusReason: expected "vi.fn()" to be called with arguments: [ 'jobs/abc' ]

Number of calls: 0

[Survived] ArrowFunction
api-video/src/lib/video.service.ts:236:66
     if (!DELETABLE_STATES.has(v.state)) throw new InvalidVideoStateException(v.state);
 
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
-      await this.transcoder.cancelJob(v.transcoderJobName).catch((err) =>
-        this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
+      await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined,
       );
     }

[Killed] BlockStatement
api-video/src/lib/video.service.ts:240:50
         this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
       );
     }
-    if (v.state === 'READY' && v.output?.bucket) {
-      await this.storage.deletePrefix({
-        bucket: v.output.bucket,
-        prefix: `videos/${vid}/`,
-      });
-    }
+    if (v.state === 'READY' && v.output?.bucket) {}
     await this.storage
       .deleteObject({ bucket: v.source.bucket, path: v.source.path })
killedBy: VideoService.delete — slice B state widening READY: deletes output prefix from output bucket best-effort
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'out', …(1) } ]

Number of calls: 0

[Killed] EqualityOperator
api-video/src/lib/video.service.ts:240:9
         this.logger.warn(`cancelJob failed for ${v.transcoderJobName}: ${(err as Error).message}`),
       );
     }
-    if (v.state === 'READY' && v.output?.bucket) {
+    if (v.state !== 'READY' && v.output?.bucket) {
       await this.storage.deletePrefix({
         bucket: v.output.bucket,
killedBy: VideoService.delete — slice B state widening READY: deletes output prefix from output bucket best-effort
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'out', …(1) } ]

Number of calls: 0

[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:241:39
       );
     }
     if (v.state === 'READY' && v.output?.bucket) {
-      await this.storage.deletePrefix({
-        bucket: v.output.bucket,
-        prefix: `videos/${vid}/`,
-      });
+      await this.storage.deletePrefix({});
     }
     await this.storage
killedBy: VideoService.delete — slice B state widening READY: deletes output prefix from output bucket best-effort
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'out', …(1) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] ObjectLiteral
api-video/src/lib/video.service.ts:247:21
       });
     }
     await this.storage
-      .deleteObject({ bucket: v.source.bucket, path: v.source.path })
+      .deleteObject({})
       .catch(() => undefined);
     await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
killedBy: VideoService.delete deletes the object and Firestore docs when state allows
statusReason: expected "vi.fn()" to be called with arguments: [ { bucket: 'src-bucket', …(1) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
api-video/src/lib/video.service.ts:252:55
     await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
   }
 
-  async deleteForLesson(lid: LessonId): Promise<void> {
-    const v = await this.repo.getVideoByLesson(lid);
-    if (!v) return;
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
-      await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
-    }
-    if (v.state === 'READY' && v.output?.bucket) {
-      await this.storage.deletePrefix({
-        bucket: v.output.bucket,
-        prefix: `videos/${v.id}/`,
-      });
-    }
-    await this.storage
-      .deleteObject({ bucket: v.source.bucket, path: v.source.path })
-      .catch(() => undefined);
-    await this.repo.deleteVideoAndDetach(v.id, v.lessonId, nowIso());
-  }
+  async deleteForLesson(lid: LessonId): Promise<void> {}
 }
 
killedBy: VideoService.deleteForLesson (cascade) cascades regardless of video state
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
api-video/src/lib/video.service.ts:254:9
 
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
-    if (!v) return;
+    if (v) return;
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
killedBy: VideoService.deleteForLesson (cascade) no-ops when no video attached
statusReason: Cannot read properties of null (reading 'state')

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:254:9
 
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
-    if (!v) return;
+    if (true) return;
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
killedBy: VideoService.deleteForLesson (cascade) cascades regardless of video state
statusReason: expected "vi.fn()" to be called at least once

[Survived] EqualityOperator
api-video/src/lib/video.service.ts:255:9
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
     if (!v) return;
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
+    if (v.state !== 'TRANSCODING' && v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
     }

[NoCoverage] BlockStatement
api-video/src/lib/video.service.ts:255:59
   async deleteForLesson(lid: LessonId): Promise<void> {
     const v = await this.repo.getVideoByLesson(lid);
     if (!v) return;
-    if (v.state === 'TRANSCODING' && v.transcoderJobName) {
-      await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
-    }
+    if (v.state === 'TRANSCODING' && v.transcoderJobName) {}
     if (v.state === 'READY' && v.output?.bucket) {
       await this.storage.deletePrefix({

[Killed] ConditionalExpression
api-video/src/lib/video.service.ts:258:9
     if (v.state === 'TRANSCODING' && v.transcoderJobName) {
       await this.transcoder.cancelJob(v.transcoderJobName).catch(() => undefined);
     }
-    if (v.state === 'READY' && v.output?.bucket) {
+    if (true) {
       await this.storage.deletePrefix({
         bucket: v.output.bucket,
killedBy: VideoService.deleteForLesson (cascade) cascades regardless of video state
statusReason: Cannot read properties of undefined (reading 'bucket')
