[Killed] BlockStatement
src/lib/playback/current-video.decorator.ts:15:10
 export function currentVideoFactory(
   _data: unknown,
   ctx: ExecutionContext,
-): Video {
-  const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-  if (!req.video) {
-    throw new Error(
-      '@CurrentVideo() used on a route without EnrollmentOrOwnerGuard.',
-    );
-  }
-  return req.video;
-}
+): Video {}
 
 export const CurrentVideo = createParamDecorator(currentVideoFactory);
killedBy: currentVideoFactory (the @CurrentVideo param-decorator factory) returns req.video when EnrollmentOrOwnerGuard has attached it
statusReason: expected undefined to be { id: 'v1', …(9) } // Object.is equality

[Killed] ConditionalExpression
src/lib/playback/current-video.decorator.ts:17:7
   ctx: ExecutionContext,
 ): Video {
   const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-  if (!req.video) {
+  if (true) {
     throw new Error(
       '@CurrentVideo() used on a route without EnrollmentOrOwnerGuard.',
killedBy: currentVideoFactory (the @CurrentVideo param-decorator factory) returns req.video when EnrollmentOrOwnerGuard has attached it
statusReason: @CurrentVideo() used on a route without EnrollmentOrOwnerGuard.

[Killed] BlockStatement
src/lib/playback/current-video.decorator.ts:17:19
   ctx: ExecutionContext,
 ): Video {
   const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-  if (!req.video) {
-    throw new Error(
-      '@CurrentVideo() used on a route without EnrollmentOrOwnerGuard.',
-    );
-  }
+  if (!req.video) {}
   return req.video;
 }
killedBy: currentVideoFactory (the @CurrentVideo param-decorator factory) throws when req.video is missing (guard skipped)
statusReason: expected [Function] to throw an error
