[Killed] BlockStatement
src/lib/playback/enrollment-or-owner.guard.ts:17:62
 export class EnrollmentOrOwnerGuard implements CanActivate {
   constructor(private readonly repo: VideoRepository) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-    const vid = req.params?.['vid'] as VideoId | undefined;
-    if (!vid) throw new VideoNotFoundException();
-
-    const video = await this.repo.getVideo(vid);
-    if (!video) throw new VideoNotFoundException();
-    if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
-
-    if (video.ownerInstructorId === req.user?.uid) {
-      req.video = video;
-      return true;
-    }
-
-    // TODO(EP-06): enrolled-student playback. Wire an EnrollmentRepository here:
-    //   if (await this.enrollment.isEnrolled(req.user.uid, video.courseId)) {
-    //     req.video = video;
-    //     return true;
-    //   }
-
-    throw new NotVideoOwnerException();
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: EnrollmentOrOwnerGuard throws VIDEO_NOT_FOUND when :vid is missing from params
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/playback/enrollment-or-owner.guard.ts:20:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
     const vid = req.params?.['vid'] as VideoId | undefined;
-    if (!vid) throw new VideoNotFoundException();
+    if (false) throw new VideoNotFoundException();
 
     const video = await this.repo.getVideo(vid);
killedBy: EnrollmentOrOwnerGuard short-circuits without calling the repo when :vid is missing
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] ConditionalExpression
src/lib/playback/enrollment-or-owner.guard.ts:20:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
     const vid = req.params?.['vid'] as VideoId | undefined;
-    if (!vid) throw new VideoNotFoundException();
+    if (true) throw new VideoNotFoundException();
 
     const video = await this.repo.getVideo(vid);
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: expected VideoException: Video not found. { …(3) } to be an instance of NotVideoOwnerException

[Killed] ConditionalExpression
src/lib/playback/enrollment-or-owner.guard.ts:23:9
     if (!vid) throw new VideoNotFoundException();
 
     const video = await this.repo.getVideo(vid);
-    if (!video) throw new VideoNotFoundException();
+    if (true) throw new VideoNotFoundException();
     if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
 
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: expected VideoException: Video not found. { …(3) } to be an instance of NotVideoOwnerException

[Killed] BooleanLiteral
src/lib/playback/enrollment-or-owner.guard.ts:23:9
     if (!vid) throw new VideoNotFoundException();
 
     const video = await this.repo.getVideo(vid);
-    if (!video) throw new VideoNotFoundException();
+    if (video) throw new VideoNotFoundException();
     if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
 
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: expected VideoException: Video not found. { …(3) } to be an instance of NotVideoOwnerException

[Killed] EqualityOperator
src/lib/playback/enrollment-or-owner.guard.ts:24:9
 
     const video = await this.repo.getVideo(vid);
     if (!video) throw new VideoNotFoundException();
-    if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
+    if (video.state === 'READY') throw new VideoNotReadyException(video.state);
 
     if (video.ownerInstructorId === req.user?.uid) {
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: expected VideoException: Video is not ready for pl… { …(3) } to be an instance of NotVideoOwnerException

[Killed] ConditionalExpression
src/lib/playback/enrollment-or-owner.guard.ts:24:9
 
     const video = await this.repo.getVideo(vid);
     if (!video) throw new VideoNotFoundException();
-    if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
+    if (true) throw new VideoNotReadyException(video.state);
 
     if (video.ownerInstructorId === req.user?.uid) {
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: expected VideoException: Video is not ready for pl… { …(3) } to be an instance of NotVideoOwnerException

[Killed] EqualityOperator
src/lib/playback/enrollment-or-owner.guard.ts:26:9
     if (!video) throw new VideoNotFoundException();
     if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
 
-    if (video.ownerInstructorId === req.user?.uid) {
+    if (video.ownerInstructorId !== req.user?.uid) {
       req.video = video;
       return true;
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
src/lib/playback/enrollment-or-owner.guard.ts:26:9
     if (!video) throw new VideoNotFoundException();
     if (video.state !== 'READY') throw new VideoNotReadyException(video.state);
 
-    if (video.ownerInstructorId === req.user?.uid) {
+    if (true) {
       req.video = video;
       return true;
killedBy: EnrollmentOrOwnerGuard throws NOT_VIDEO_OWNER (not TypeError) when req.user is entirely missing
statusReason: promise resolved "true" instead of rejecting

[Killed] BooleanLiteral
src/lib/playback/enrollment-or-owner.guard.ts:28:14
 
     if (video.ownerInstructorId === req.user?.uid) {
       req.video = video;
-      return true;
+      return false;
     }
 
killedBy: EnrollmentOrOwnerGuard attaches video and returns true when requester is the owner
statusReason: expected false to be true // Object.is equality
