[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:8:73
 export const ALLOWED_RENDITIONS = ['1080p', '720p', '480p', '360p'] as const;
 export type RenditionName = (typeof ALLOWED_RENDITIONS)[number];
 
-export function isAllowedRendition(name: string): name is RenditionName {
-  return (ALLOWED_RENDITIONS as readonly string[]).includes(name);
-}
+export function isAllowedRendition(name: string): name is RenditionName {}
 
 function assertM3u8Header(body: string): void {
killedBy: PlaybackController.rendition returns 200 with rewritten rendition for an allowed rendition (720p)
statusReason: Rendition "720p" is not available.

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:12:47
   return (ALLOWED_RENDITIONS as readonly string[]).includes(name);
 }
 
-function assertM3u8Header(body: string): void {
-  if (!body.startsWith('#EXTM3U')) {
-    throw new ManifestParseFailedException('missing #EXTM3U header');
-  }
-}
+function assertM3u8Header(body: string): void {}
 
 function renditionNameFromUri(uri: string): string {
killedBy: rewriteMaster throws ManifestParseFailedException on missing #EXTM3U header
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/lib/playback/manifest.rewriter.ts:13:7
 }
 
 function assertM3u8Header(body: string): void {
-  if (!body.startsWith('#EXTM3U')) {
+  if (body.startsWith('#EXTM3U')) {
     throw new ManifestParseFailedException('missing #EXTM3U header');
   }
killedBy: ManifestService.fetchMaster reads master from the output bucket and rewrites to proxy paths
statusReason: Manifest parse failed: missing #EXTM3U header.

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:13:36
 }
 
 function assertM3u8Header(body: string): void {
-  if (!body.startsWith('#EXTM3U')) {
-    throw new ManifestParseFailedException('missing #EXTM3U header');
-  }
+  if (!body.startsWith('#EXTM3U')) {}
 }
 
killedBy: rewriteMaster throws ManifestParseFailedException on missing #EXTM3U header
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:18:52
   }
 }
 
-function renditionNameFromUri(uri: string): string {
-  // Expect 'X/playlist.m3u8' (single segment), produced by Transcoder API.
-  const slash = uri.indexOf('/');
-  if (slash <= 0) {
-    throw new ManifestParseFailedException(
-      `cannot extract rendition name from URI "${uri}"`,
-    );
-  }
-  return uri.slice(0, slash);
-}
+function renditionNameFromUri(uri: string): string {}
 
 export function rewriteMaster(masterBody: string, videoId: VideoId): string {
killedBy: ManifestService.fetchMaster reads master from the output bucket and rewrites to proxy paths
statusReason: Manifest parse failed: unknown rendition "undefined" in master.

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:21:19
 function renditionNameFromUri(uri: string): string {
   // Expect 'X/playlist.m3u8' (single segment), produced by Transcoder API.
   const slash = uri.indexOf('/');
-  if (slash <= 0) {
-    throw new ManifestParseFailedException(
-      `cannot extract rendition name from URI "${uri}"`,
-    );
-  }
+  if (slash <= 0) {}
   return uri.slice(0, slash);
 }
killedBy: rewriteMaster throws when the URI line starts with a leading slash (slash position 0)
statusReason: expected [Function] to throw error matching /cannot extract rendition name/ but got 'Manifest parse failed: unknown rendit…'

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:21:7
 function renditionNameFromUri(uri: string): string {
   // Expect 'X/playlist.m3u8' (single segment), produced by Transcoder API.
   const slash = uri.indexOf('/');
-  if (slash <= 0) {
+  if (true) {
     throw new ManifestParseFailedException(
       `cannot extract rendition name from URI "${uri}"`,
killedBy: ManifestService.fetchMaster reads master from the output bucket and rewrites to proxy paths
statusReason: Manifest parse failed: cannot extract rendition name from URI "1080p/playlist.m3u8".

[Killed] MethodExpression
src/lib/playback/manifest.rewriter.ts:26:10
       `cannot extract rendition name from URI "${uri}"`,
     );
   }
-  return uri.slice(0, slash);
+  return uri;
 }
 
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Manifest parse failed: unknown rendition "1080p/playlist.m3u8" in master.

[Killed] UpdateOperator
src/lib/playback/manifest.rewriter.ts:33:37
   assertM3u8Header(masterBody);
   const out: string[] = [];
   const lines = masterBody.split('\n');
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; i < lines.length; i--) {
     const line = lines[i]!;
     out.push(line);
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:33:42
   assertM3u8Header(masterBody);
   const out: string[] = [];
   const lines = masterBody.split('\n');
-  for (let i = 0; i < lines.length; i++) {
-    const line = lines[i]!;
-    out.push(line);
-    if (line.startsWith('#EXT-X-STREAM-INF')) {
-      const nextIdx = i + 1;
-      const uri = lines[nextIdx]?.trim();
-      if (!uri || uri.startsWith('#')) {
-        throw new ManifestParseFailedException(
-          'expected URI line after #EXT-X-STREAM-INF',
-        );
-      }
-      const rendition = renditionNameFromUri(uri);
-      if (!isAllowedRendition(rendition)) {
-        throw new ManifestParseFailedException(
-          `unknown rendition "${rendition}" in master`,
-        );
-      }
-      out.push(`/api/playback/manifest/${videoId}/rendition/${rendition}`);
-      i++; // skip the original URI line
-    }
-  }
+  for (let i = 0; i < lines.length; i++) {}
   return out.join('\n');
 }
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: expected [ '' ] to include '/api/playback/manifest/v123/rendition…'

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:36:47
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i]!;
     out.push(line);
-    if (line.startsWith('#EXT-X-STREAM-INF')) {
-      const nextIdx = i + 1;
-      const uri = lines[nextIdx]?.trim();
-      if (!uri || uri.startsWith('#')) {
-        throw new ManifestParseFailedException(
-          'expected URI line after #EXT-X-STREAM-INF',
-        );
-      }
-      const rendition = renditionNameFromUri(uri);
-      if (!isAllowedRendition(rendition)) {
-        throw new ManifestParseFailedException(
-          `unknown rendition "${rendition}" in master`,
-        );
-      }
-      out.push(`/api/playback/manifest/${videoId}/rendition/${rendition}`);
-      i++; // skip the original URI line
-    }
+    if (line.startsWith('#EXT-X-STREAM-INF')) {}
   }
   return out.join('\n');
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: expected [ Array(12) ] to include '/api/playback/manifest/v123/rendition…'

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:36:9
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i]!;
     out.push(line);
-    if (line.startsWith('#EXT-X-STREAM-INF')) {
+    if (true) {
       const nextIdx = i + 1;
       const uri = lines[nextIdx]?.trim();
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Manifest parse failed: expected URI line after #EXT-X-STREAM-INF.

[Killed] ArithmeticOperator
src/lib/playback/manifest.rewriter.ts:37:23
     const line = lines[i]!;
     out.push(line);
     if (line.startsWith('#EXT-X-STREAM-INF')) {
-      const nextIdx = i + 1;
+      const nextIdx = i - 1;
       const uri = lines[nextIdx]?.trim();
       if (!uri || uri.startsWith('#')) {
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Manifest parse failed: expected URI line after #EXT-X-STREAM-INF.

[Killed] MethodExpression
src/lib/playback/manifest.rewriter.ts:38:19
     out.push(line);
     if (line.startsWith('#EXT-X-STREAM-INF')) {
       const nextIdx = i + 1;
-      const uri = lines[nextIdx]?.trim();
+      const uri = lines[nextIdx];
       if (!uri || uri.startsWith('#')) {
         throw new ManifestParseFailedException(
killedBy: rewriteMaster trims the URI lookahead so a leading-whitespace "#" line is rejected as no-URI
statusReason: expected [Function] to throw error matching /expected URI line after #EXT-X-STREAM…/ but got 'Manifest parse failed: cannot extract…'

[Killed] OptionalChaining
src/lib/playback/manifest.rewriter.ts:38:19
     out.push(line);
     if (line.startsWith('#EXT-X-STREAM-INF')) {
       const nextIdx = i + 1;
-      const uri = lines[nextIdx]?.trim();
+      const uri = lines[nextIdx].trim();
       if (!uri || uri.startsWith('#')) {
         throw new ManifestParseFailedException(
killedBy: rewriteMaster throws when EXT-X-STREAM-INF is the trailing line (no next line at all)
statusReason: expected error to be instance of ManifestParseFailedException

[Killed] BooleanLiteral
src/lib/playback/manifest.rewriter.ts:39:11
     if (line.startsWith('#EXT-X-STREAM-INF')) {
       const nextIdx = i + 1;
       const uri = lines[nextIdx]?.trim();
-      if (!uri || uri.startsWith('#')) {
+      if (uri || uri.startsWith('#')) {
         throw new ManifestParseFailedException(
           'expected URI line after #EXT-X-STREAM-INF',
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: Manifest parse failed: expected URI line after #EXT-X-STREAM-INF.

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:39:40
     if (line.startsWith('#EXT-X-STREAM-INF')) {
       const nextIdx = i + 1;
       const uri = lines[nextIdx]?.trim();
-      if (!uri || uri.startsWith('#')) {
-        throw new ManifestParseFailedException(
-          'expected URI line after #EXT-X-STREAM-INF',
-        );
-      }
+      if (!uri || uri.startsWith('#')) {}
       const rendition = renditionNameFromUri(uri);
       if (!isAllowedRendition(rendition)) {
killedBy: rewriteMaster throws when EXT-X-STREAM-INF is the trailing line (no next line at all)
statusReason: expected error to be instance of ManifestParseFailedException

[Killed] StringLiteral
src/lib/playback/manifest.rewriter.ts:41:11
       const uri = lines[nextIdx]?.trim();
       if (!uri || uri.startsWith('#')) {
         throw new ManifestParseFailedException(
-          'expected URI line after #EXT-X-STREAM-INF',
+          "",
         );
       }
killedBy: rewriteMaster trims the URI lookahead so a leading-whitespace "#" line is rejected as no-URI
statusReason: expected [Function] to throw error matching /expected URI line after #EXT-X-STREAM…/ but got 'Manifest parse failed: .'

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:45:11
         );
       }
       const rendition = renditionNameFromUri(uri);
-      if (!isAllowedRendition(rendition)) {
+      if (false) {
         throw new ManifestParseFailedException(
           `unknown rendition "${rendition}" in master`,
killedBy: rewriteMaster throws when a rendition is outside the allow-list
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:45:43
         );
       }
       const rendition = renditionNameFromUri(uri);
-      if (!isAllowedRendition(rendition)) {
-        throw new ManifestParseFailedException(
-          `unknown rendition "${rendition}" in master`,
-        );
-      }
+      if (!isAllowedRendition(rendition)) {}
       out.push(`/api/playback/manifest/${videoId}/rendition/${rendition}`);
       i++; // skip the original URI line
killedBy: rewriteMaster throws when a rendition is outside the allow-list
statusReason: expected [Function] to throw an error

[Timeout] UpdateOperator
src/lib/playback/manifest.rewriter.ts:51:7
         );
       }
       out.push(`/api/playback/manifest/${videoId}/rendition/${rendition}`);
-      i++; // skip the original URI line
+      i--; // skip the original URI line
     }
   }

[Killed] StringLiteral
src/lib/playback/manifest.rewriter.ts:54:19
       i++; // skip the original URI line
     }
   }
-  return out.join('\n');
+  return out.join("");
 }
 
killedBy: rewriteMaster rewrites each rendition URI to the proxy path
statusReason: expected [ Array(1) ] to include '/api/playback/manifest/v123/rendition…'

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:59:46
 
 export type SegmentSigner = (filename: string) => Promise<string>;
 
-function isSegmentUri(line: string): boolean {
-  const t = line.trim();
-  if (!t) return false;
-  if (t.startsWith('#')) return false;
-  if (t.startsWith('http://') || t.startsWith('https://')) return false;
-  return true;
-}
+function isSegmentUri(line: string): boolean {}
 
 function rewriteKeyDirective(line: string, videoId: VideoId): string {
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] MethodExpression
src/lib/playback/manifest.rewriter.ts:60:13
 export type SegmentSigner = (filename: string) => Promise<string>;
 
 function isSegmentUri(line: string): boolean {
-  const t = line.trim();
+  const t = line;
   if (!t) return false;
   if (t.startsWith('#')) return false;
killedBy: rewriteRendition treats a whitespace-only line as non-segment (no signer call)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "",

[Killed] BooleanLiteral
src/lib/playback/manifest.rewriter.ts:61:18
 
 function isSegmentUri(line: string): boolean {
   const t = line.trim();
-  if (!t) return false;
+  if (!t) return true;
   if (t.startsWith('#')) return false;
   if (t.startsWith('http://') || t.startsWith('https://')) return false;
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [ 'segment_001.ts', …(2) ] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:61:7
 
 function isSegmentUri(line: string): boolean {
   const t = line.trim();
-  if (!t) return false;
+  if (true) return false;
   if (t.startsWith('#')) return false;
   if (t.startsWith('http://') || t.startsWith('https://')) return false;
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] MethodExpression
src/lib/playback/manifest.rewriter.ts:62:7
 function isSegmentUri(line: string): boolean {
   const t = line.trim();
   if (!t) return false;
-  if (t.startsWith('#')) return false;
+  if (t.endsWith('#')) return false;
   if (t.startsWith('http://') || t.startsWith('https://')) return false;
   return true;
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [ '#EXTM3U', '#EXT-X-VERSION:6', …(6) ] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:62:7
 function isSegmentUri(line: string): boolean {
   const t = line.trim();
   if (!t) return false;
-  if (t.startsWith('#')) return false;
+  if (true) return false;
   if (t.startsWith('http://') || t.startsWith('https://')) return false;
   return true;
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:63:7
   const t = line.trim();
   if (!t) return false;
   if (t.startsWith('#')) return false;
-  if (t.startsWith('http://') || t.startsWith('https://')) return false;
+  if (false) return false;
   return true;
 }
killedBy: rewriteRendition does not double-sign already-signed URIs (http/https)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "https://storage.googleapis.com/b/segment_001.ts?signature=xyz",

[Killed] MethodExpression
src/lib/playback/manifest.rewriter.ts:63:7
   const t = line.trim();
   if (!t) return false;
   if (t.startsWith('#')) return false;
-  if (t.startsWith('http://') || t.startsWith('https://')) return false;
+  if (t.endsWith('http://') || t.startsWith('https://')) return false;
   return true;
 }
killedBy: rewriteRendition does not sign http:// URIs either
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      "http://example/seg.ts",

[Killed] BooleanLiteral
src/lib/playback/manifest.rewriter.ts:64:10
   if (!t) return false;
   if (t.startsWith('#')) return false;
   if (t.startsWith('http://') || t.startsWith('https://')) return false;
-  return true;
+  return false;
 }
 
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:67:70
   return true;
 }
 
-function rewriteKeyDirective(line: string, videoId: VideoId): string {
-  // Match URI="…" tolerantly. METHOD=NONE has no URI= clause, so this is a no-op for it.
-  return line.replace(/URI="[^"]*"/, `URI="/api/playback/keys/${videoId}"`);
-}
+function rewriteKeyDirective(line: string, videoId: VideoId): string {}
 
 export async function rewriteRendition(
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'

[Killed] Regex
src/lib/playback/manifest.rewriter.ts:69:23
 
 function rewriteKeyDirective(line: string, videoId: VideoId): string {
   // Match URI="…" tolerantly. METHOD=NONE has no URI= clause, so this is a no-op for it.
-  return line.replace(/URI="[^"]*"/, `URI="/api/playback/keys/${videoId}"`);
+  return line.replace(/URI="["]*"/, `URI="/api/playback/keys/${videoId}"`);
 }
 
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:76:20
   renditionBody: string,
   videoId: VideoId,
   signSegment: SegmentSigner,
-): Promise<string> {
-  assertM3u8Header(renditionBody);
-  const out: string[] = [];
-  const lines = renditionBody.split('\n');
-  for (const line of lines) {
-    if (line.startsWith('#EXT-X-KEY')) {
-      out.push(rewriteKeyDirective(line, videoId));
-    } else if (isSegmentUri(line)) {
-      out.push(await signSegment(line.trim()));
-    } else {
-      out.push(line);
-    }
-  }
-  return out.join('\n');
-}
+): Promise<string> {}
 
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:80:29
   assertM3u8Header(renditionBody);
   const out: string[] = [];
   const lines = renditionBody.split('\n');
-  for (const line of lines) {
-    if (line.startsWith('#EXT-X-KEY')) {
-      out.push(rewriteKeyDirective(line, videoId));
-    } else if (isSegmentUri(line)) {
-      out.push(await signSegment(line.trim()));
-    } else {
-      out.push(line);
-    }
-  }
+  for (const line of lines) {}
   return out.join('\n');
 }
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:81:9
   const out: string[] = [];
   const lines = renditionBody.split('\n');
   for (const line of lines) {
-    if (line.startsWith('#EXT-X-KEY')) {
+    if (true) {
       out.push(rewriteKeyDirective(line, videoId));
     } else if (isSegmentUri(line)) {
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:81:40
   const out: string[] = [];
   const lines = renditionBody.split('\n');
   for (const line of lines) {
-    if (line.startsWith('#EXT-X-KEY')) {
-      out.push(rewriteKeyDirective(line, videoId));
-    } else if (isSegmentUri(line)) {
+    if (line.startsWith('#EXT-X-KEY')) {} else if (isSegmentUri(line)) {
       out.push(await signSegment(line.trim()));
     } else {
killedBy: rewriteRendition rewrites #EXT-X-KEY URI to /api/playback/keys/:vid and preserves IV
statusReason: expected '#EXTM3U\n#EXT-X-VERSION:6\n#EXT-X-TAR…' to contain '#EXT-X-KEY:METHOD=AES-128,URI="/api/p…'

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:83:36
   for (const line of lines) {
     if (line.startsWith('#EXT-X-KEY')) {
       out.push(rewriteKeyDirective(line, videoId));
-    } else if (isSegmentUri(line)) {
-      out.push(await signSegment(line.trim()));
-    } else {
+    } else if (isSegmentUri(line)) {} else {
       out.push(line);
     }
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] ConditionalExpression
src/lib/playback/manifest.rewriter.ts:83:16
   for (const line of lines) {
     if (line.startsWith('#EXT-X-KEY')) {
       out.push(rewriteKeyDirective(line, videoId));
-    } else if (isSegmentUri(line)) {
+    } else if (true) {
       out.push(await signSegment(line.trim()));
     } else {
killedBy: rewriteRendition signs each segment URI via the injected callback
statusReason: expected [ '#EXTM3U', '#EXT-X-VERSION:6', …(7) ] to deeply equal [ 'segment_001.ts', 'segment_002.ts' ]

[Killed] MethodExpression
src/lib/playback/manifest.rewriter.ts:84:34
     if (line.startsWith('#EXT-X-KEY')) {
       out.push(rewriteKeyDirective(line, videoId));
     } else if (isSegmentUri(line)) {
-      out.push(await signSegment(line.trim()));
+      out.push(await signSegment(line));
     } else {
       out.push(line);
killedBy: rewriteRendition trims whitespace off segment URIs before signing
statusReason: expected [ '\tsegment_001.ts\t' ] to deeply equal [ 'segment_001.ts' ]

[Killed] BlockStatement
src/lib/playback/manifest.rewriter.ts:85:12
       out.push(rewriteKeyDirective(line, videoId));
     } else if (isSegmentUri(line)) {
       out.push(await signSegment(line.trim()));
-    } else {
-      out.push(line);
-    }
+    } else {}
   }
   return out.join('\n');
killedBy: rewriteRendition does not double-sign already-signed URIs (http/https)
statusReason: expected '' to contain 'https://storage.googleapis.com/b/segm…'
