[Killed] BlockStatement
src/lib/playback/manifest.service.ts:17:52
     @Inject(VIDEO_CONFIG) private readonly cfg: VideoConfig,
   ) {}
 
-  async fetchMaster(video: Video): Promise<string> {
-    const body = await this.storage.readManifestObject({
-      bucket: video.output!.bucket,
-      path: video.output!.manifestPath,
-    });
-    return rewriteMaster(body, video.id);
-  }
+  async fetchMaster(video: Video): Promise<string> {}
 
   async fetchRendition(video: Video, rendition: RenditionName): Promise<string> {
killedBy: ManifestService.fetchMaster reads master from the output bucket and rewrites to proxy paths
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/lib/playback/manifest.service.ts:25:81
     return rewriteMaster(body, video.id);
   }
 
-  async fetchRendition(video: Video, rendition: RenditionName): Promise<string> {
-    const baseDir = path.posix.dirname(video.output!.manifestPath);
-    const renditionPath = `${baseDir}/${rendition}/playlist.m3u8`;
-    const body = await this.storage.readManifestObject({
-      bucket: video.output!.bucket,
-      path: renditionPath,
-    });
-    const signSegment = (filename: string) =>
-      this.storage.signObjectUrl({
-        bucket: video.output!.bucket,
-        path: `${baseDir}/${rendition}/${filename}`,
-        ttlSec: this.cfg.playbackSignedUrlTtlSec,
-      });
-    return rewriteRendition(body, video.id, signSegment);
-  }
+  async fetchRendition(video: Video, rendition: RenditionName): Promise<string> {}
 }
 
killedBy: ManifestService.fetchRendition reads the rendition playlist from the right path
statusReason: expected "vi.fn()" to be called with arguments: [ 'out', …(1) ]

Number of calls: 0

[Killed] ArrowFunction
src/lib/playback/manifest.service.ts:32:25
       bucket: video.output!.bucket,
       path: renditionPath,
     });
-    const signSegment = (filename: string) =>
-      this.storage.signObjectUrl({
-        bucket: video.output!.bucket,
-        path: `${baseDir}/${rendition}/${filename}`,
-        ttlSec: this.cfg.playbackSignedUrlTtlSec,
-      });
+    const signSegment = () => undefined;
     return rewriteRendition(body, video.id, signSegment);
   }
killedBy: ManifestService.fetchRendition signs each segment with bucket=output, path=<dir>/<rendition>/<segment>, ttl=cfg
statusReason: expected "vi.fn()" to be called with arguments: [ 'out', …(2) ]

Number of calls: 0
