[Killed] BlockStatement
src/lib/playback/playback.controller.ts:27:83
   ) {}
 
   @Get('manifest/:vid')
-  async master(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {
-    const body = await this.manifest.fetchMaster(video);
-    res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
-    res.setHeader('Cache-Control', 'no-store');
-    res.send(body);
-  }
+  async master(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {}
 
   @Get('manifest/:vid/rendition/:r')
killedBy: PlaybackController.master returns the rewritten master with HLS content-type and no-store
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'v1', …(9) } ]

Number of calls: 0

[Killed] StringLiteral
src/lib/playback/playback.controller.ts:29:19
   @Get('manifest/:vid')
   async master(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {
     const body = await this.manifest.fetchMaster(video);
-    res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
+    res.setHeader("", M3U8_CONTENT_TYPE);
     res.setHeader('Cache-Control', 'no-store');
     res.send(body);
killedBy: PlaybackController.master returns the rewritten master with HLS content-type and no-store
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] StringLiteral
src/lib/playback/playback.controller.ts:30:36
   async master(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {
     const body = await this.manifest.fetchMaster(video);
     res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
-    res.setHeader('Cache-Control', 'no-store');
+    res.setHeader('Cache-Control', "");
     res.send(body);
   }
killedBy: PlaybackController.master returns the rewritten master with HLS content-type and no-store
statusReason: expected '' to be 'no-store' // Object.is equality

[Killed] BlockStatement
src/lib/playback/playback.controller.ts:39:20
     @CurrentVideo() video: Video,
     @Param('r') r: string,
     @Res() res: Response,
-  ): Promise<void> {
-    if (!isAllowedRendition(r)) {
-      throw new RenditionNotFoundException(r);
-    }
-    const body = await this.manifest.fetchRendition(video, r as RenditionName);
-    res.setHeader('Content-Type', M3U8_CONTENT_TYPE);
-    res.setHeader('Cache-Control', 'no-store');
-    res.send(body);
-  }
+  ): Promise<void> {}
 
   @Get('keys/:vid')
killedBy: PlaybackController.rendition returns 404 RENDITION_NOT_FOUND for an unknown rendition (allow-list miss)
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/playback/playback.controller.ts:40:9
     @Param('r') r: string,
     @Res() res: Response,
   ): Promise<void> {
-    if (!isAllowedRendition(r)) {
+    if (false) {
       throw new RenditionNotFoundException(r);
     }
killedBy: PlaybackController.rendition returns 404 RENDITION_NOT_FOUND for an unknown rendition (allow-list miss)
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/lib/playback/playback.controller.ts:40:9
     @Param('r') r: string,
     @Res() res: Response,
   ): Promise<void> {
-    if (!isAllowedRendition(r)) {
+    if (true) {
       throw new RenditionNotFoundException(r);
     }
killedBy: PlaybackController.rendition returns 200 with rewritten rendition for an allowed rendition (720p)
statusReason: Rendition "720p" is not available.

[Killed] BlockStatement
src/lib/playback/playback.controller.ts:50:80
   }
 
   @Get('keys/:vid')
-  async key(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {
-    const buf = await this.keys.fetch(video);
-    res.setHeader('Content-Type', 'application/octet-stream');
-    res.setHeader('Content-Length', String(buf.length));
-    res.setHeader('Cache-Control', 'no-store');
-    res.end(buf);
-  }
+  async key(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {}
 }
 
killedBy: PlaybackController.key returns 16-byte octet-stream with Content-Length: 16 and no-store
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 'v1', …(9) } ]

Number of calls: 0

[Killed] StringLiteral
src/lib/playback/playback.controller.ts:52:35
   @Get('keys/:vid')
   async key(@CurrentVideo() video: Video, @Res() res: Response): Promise<void> {
     const buf = await this.keys.fetch(video);
-    res.setHeader('Content-Type', 'application/octet-stream');
+    res.setHeader('Content-Type', "");
     res.setHeader('Content-Length', String(buf.length));
     res.setHeader('Cache-Control', 'no-store');
killedBy: PlaybackController.key returns 16-byte octet-stream with Content-Length: 16 and no-store
statusReason: expected '' to be 'application/octet-stream' // Object.is equality

[Killed] StringLiteral
src/lib/playback/playback.controller.ts:54:36
     const buf = await this.keys.fetch(video);
     res.setHeader('Content-Type', 'application/octet-stream');
     res.setHeader('Content-Length', String(buf.length));
-    res.setHeader('Cache-Control', 'no-store');
+    res.setHeader('Cache-Control', "");
     res.end(buf);
   }
killedBy: PlaybackController.key returns 16-byte octet-stream with Content-Length: 16 and no-store
statusReason: expected '' to be 'no-store' // Object.is equality
