[Killed] EqualityOperator
src/lib/transcoder/transcoder-job.builder.ts:52:47
 }
 
 export function buildJobConfig(input: TranscoderJobInput): JobConfig {
-  const renditions = RENDITIONS.filter((r) => r.height <= input.sourceHeight);
+  const renditions = RENDITIONS.filter((r) => r.height < input.sourceHeight);
   if (renditions.length === 0) {
     throw new Error(
killedBy: buildJobConfig emits one elementary video stream per applicable rendition
statusReason: expected [ { key: 'video_720p', …(1) }, …(2) ] to have a length of 4 but got 3

[Killed] MethodExpression
src/lib/transcoder/transcoder-job.builder.ts:52:22
 }
 
 export function buildJobConfig(input: TranscoderJobInput): JobConfig {
-  const renditions = RENDITIONS.filter((r) => r.height <= input.sourceHeight);
+  const renditions = RENDITIONS;
   if (renditions.length === 0) {
     throw new Error(
killedBy: buildJobConfig filters renditions taller than the source
statusReason: expected [ 360, 480, 720, 1080 ] to deeply equal [ 360, 480 ]

[Killed] ConditionalExpression
src/lib/transcoder/transcoder-job.builder.ts:53:7
 
 export function buildJobConfig(input: TranscoderJobInput): JobConfig {
   const renditions = RENDITIONS.filter((r) => r.height <= input.sourceHeight);
-  if (renditions.length === 0) {
+  if (false) {
     throw new Error(
       `sourceHeight ${input.sourceHeight}px is below the lowest supported rendition ` +
killedBy: buildJobConfig throws when sourceHeight is below the lowest rendition
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/lib/transcoder/transcoder-job.builder.ts:53:7
 
 export function buildJobConfig(input: TranscoderJobInput): JobConfig {
   const renditions = RENDITIONS.filter((r) => r.height <= input.sourceHeight);
-  if (renditions.length === 0) {
+  if (true) {
     throw new Error(
       `sourceHeight ${input.sourceHeight}px is below the lowest supported rendition ` +
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: sourceHeight 1080px is below the lowest supported rendition (360px).

[Killed] ArithmeticOperator
src/lib/transcoder/transcoder-job.builder.ts:56:24
   if (renditions.length === 0) {
     throw new Error(
       `sourceHeight ${input.sourceHeight}px is below the lowest supported rendition ` +
-        `(${RENDITIONS[RENDITIONS.length - 1]!.height}px).`,
+        `(${RENDITIONS[RENDITIONS.length + 1]!.height}px).`,
     );
   }
killedBy: buildJobConfig throws when sourceHeight is below the lowest rendition
statusReason: expected [Function] to throw error matching /sourceHeight/ but got 'Cannot read properties of undefined (…'

[Killed] ArrayDeclaration
src/lib/transcoder/transcoder-job.builder.ts:60:49
     );
   }
 
-  const elementaryStreams: ElementaryStream[] = [
-    ...renditions.map((r) => ({
-      key: `video_${r.name}`,
-      videoStream: {
-        h264: {
-          heightPixels: r.height,
-          bitrateBps: r.bitrateBps,
-          frameRate: 30,
-          gopDuration: { seconds: KEY_FRAME_INTERVAL_S },
-        },
-      },
-    })),
-    { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
-  ];
+  const elementaryStreams: ElementaryStream[] = [];
 
   const muxStreams: MuxStream[] = renditions.map((r) => ({
killedBy: buildJobConfig emits one elementary video stream per applicable rendition
statusReason: expected [] to have a length of 4 but got +0

[Killed] ArrowFunction
src/lib/transcoder/transcoder-job.builder.ts:61:23
   }
 
   const elementaryStreams: ElementaryStream[] = [
-    ...renditions.map((r) => ({
-      key: `video_${r.name}`,
-      videoStream: {
-        h264: {
-          heightPixels: r.height,
-          bitrateBps: r.bitrateBps,
-          frameRate: 30,
-          gopDuration: { seconds: KEY_FRAME_INTERVAL_S },
-        },
-      },
-    })),
+    ...renditions.map(() => undefined),
     { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
   ];
killedBy: GcpTranscoderAdapter.submitJob passes the built JobConfig + key bytes to the client and returns the job name
statusReason: Cannot read properties of undefined (reading 'videoStream')

[Killed] ObjectLiteral
src/lib/transcoder/transcoder-job.builder.ts:61:31
   }
 
   const elementaryStreams: ElementaryStream[] = [
-    ...renditions.map((r) => ({
-      key: `video_${r.name}`,
-      videoStream: {
-        h264: {
-          heightPixels: r.height,
-          bitrateBps: r.bitrateBps,
-          frameRate: 30,
-          gopDuration: { seconds: KEY_FRAME_INTERVAL_S },
-        },
-      },
-    })),
+    ...renditions.map((r) => ({})),
     { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
   ];
killedBy: buildJobConfig emits one elementary video stream per applicable rendition
statusReason: expected [] to have a length of 4 but got +0

[Survived] StringLiteral
src/lib/transcoder/transcoder-job.builder.ts:62:12
 
   const elementaryStreams: ElementaryStream[] = [
     ...renditions.map((r) => ({
-      key: `video_${r.name}`,
+      key: ``,
       videoStream: {
         h264: {

[Survived] StringLiteral
src/lib/transcoder/transcoder-job.builder.ts:72:12
         },
       },
     })),
-    { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
+    { key: "", audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
   ];
 

[Killed] ArrowFunction
src/lib/transcoder/transcoder-job.builder.ts:75:50
     { key: 'audio_aac', audioStream: { codec: 'aac', bitrateBps: AUDIO_BITRATE_BPS } },
   ];
 
-  const muxStreams: MuxStream[] = renditions.map((r) => ({
-    key: `hls_${r.name}`,
-    container: 'ts',
-    elementaryStreams: [`video_${r.name}`, 'audio_aac'],
-    segmentSettings: { segmentDuration: { seconds: SEGMENT_DURATION_S } },
-    encryptionId: input.encryptionKey.id,
-  }));
+  const muxStreams: MuxStream[] = renditions.map(() => undefined);
 
   return {
killedBy: buildJobConfig emits one elementary video stream per applicable rendition
statusReason: Cannot read properties of undefined (reading 'key')

[Survived] ArrayDeclaration
src/lib/transcoder/transcoder-job.builder.ts:78:24
   const muxStreams: MuxStream[] = renditions.map((r) => ({
     key: `hls_${r.name}`,
     container: 'ts',
-    elementaryStreams: [`video_${r.name}`, 'audio_aac'],
+    elementaryStreams: [],
     segmentSettings: { segmentDuration: { seconds: SEGMENT_DURATION_S } },
     encryptionId: input.encryptionKey.id,

[Survived] StringLiteral
src/lib/transcoder/transcoder-job.builder.ts:78:44
   const muxStreams: MuxStream[] = renditions.map((r) => ({
     key: `hls_${r.name}`,
     container: 'ts',
-    elementaryStreams: [`video_${r.name}`, 'audio_aac'],
+    elementaryStreams: [`video_${r.name}`, ""],
     segmentSettings: { segmentDuration: { seconds: SEGMENT_DURATION_S } },
     encryptionId: input.encryptionKey.id,

[Survived] ArrowFunction
src/lib/transcoder/transcoder-job.builder.ts:92:36
       {
         fileName: 'manifest.m3u8',
         type: 'HLS',
-        muxStreams: muxStreams.map((m) => m.key),
+        muxStreams: muxStreams.map(() => undefined),
       },
     ],

[Killed] ObjectLiteral
src/lib/transcoder/transcoder-job.builder.ts:101:24
         aes128: {},
       },
     ],
-    pubsubDestination: { topic: input.topic },
+    pubsubDestination: {},
     labels: { videoid: input.videoId as string },
   };
killedBy: buildJobConfig routes job completion events to the configured Pub/Sub topic
statusReason: expected undefined to be 'projects/p/topics/t' // Object.is equality
