[Killed] BlockStatement
api-video/src/lib/video-owner.guard.ts:16:62
 export class VideoOwnerGuard implements CanActivate {
   constructor(private readonly repo: VideoRepository) {}
 
-  async canActivate(ctx: ExecutionContext): Promise<boolean> {
-    const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
-    const vid = req.params?.['vid'] as VideoId | undefined;
-    if (!vid) throw new VideoNotFoundException();
-
-    const video = await this.repo.getVideo(vid);
-    if (!video) throw new VideoNotFoundException();
-    if (video.ownerInstructorId !== req.user?.uid) {
-      throw new NotVideoOwnerException();
-    }
-    req.video = video;
-    return true;
-  }
+  async canActivate(ctx: ExecutionContext): Promise<boolean> {}
 }
 
killedBy: VideoOwnerGuard throws VIDEO_NOT_FOUND when :vid is missing
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
api-video/src/lib/video-owner.guard.ts:19:9
   async canActivate(ctx: ExecutionContext): Promise<boolean> {
     const req = ctx.switchToHttp().getRequest<VideoScopedRequest>();
     const vid = req.params?.['vid'] as VideoId | undefined;
-    if (!vid) throw new VideoNotFoundException();
+    if (vid) throw new VideoNotFoundException();
 
     const video = await this.repo.getVideo(vid);
killedBy: VideoOwnerGuard throws NOT_VIDEO_OWNER when owner differs
statusReason: expected VideoException: Video not found. { …(3) } to be an instance of NotVideoOwnerException

[Killed] ConditionalExpression
api-video/src/lib/video-owner.guard.ts:22:9
     if (!vid) throw new VideoNotFoundException();
 
     const video = await this.repo.getVideo(vid);
-    if (!video) throw new VideoNotFoundException();
+    if (false) throw new VideoNotFoundException();
     if (video.ownerInstructorId !== req.user?.uid) {
       throw new NotVideoOwnerException();
killedBy: VideoOwnerGuard throws VIDEO_NOT_FOUND when video does not exist
statusReason: expected TypeError: Cannot read properties of null… to be an instance of VideoNotFoundException

[Killed] ConditionalExpression
api-video/src/lib/video-owner.guard.ts:23:9
 
     const video = await this.repo.getVideo(vid);
     if (!video) throw new VideoNotFoundException();
-    if (video.ownerInstructorId !== req.user?.uid) {
+    if (false) {
       throw new NotVideoOwnerException();
     }
killedBy: VideoOwnerGuard throws NOT_VIDEO_OWNER when owner differs
statusReason: promise resolved "true" instead of rejecting

[Killed] ConditionalExpression
api-video/src/lib/video-owner.guard.ts:23:9
 
     const video = await this.repo.getVideo(vid);
     if (!video) throw new VideoNotFoundException();
-    if (video.ownerInstructorId !== req.user?.uid) {
+    if (true) {
       throw new NotVideoOwnerException();
     }
killedBy: VideoOwnerGuard attaches video and returns true on success
statusReason: promise rejected "VideoException: You do not own this video. { …(3) }" instead of resolving
