[Killed] BlockStatement
api-video/src/lib/video.controller.ts:55:81
     @Param('lid') lid: LessonId,
     @Body() body: CreateUploadSessionDto,
     @Req() req: VideoScopedRequest,
-  ): Promise<{ videoId: VideoId; uploadSessionUri: string; expiresAt: string }> {
-    const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
-    if (!moduleOk) throw new ModuleNotFoundException();
-    const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
-    if (!lesson) throw new LessonNotFoundException();
-
-    return this.svc.createUploadSession({
-      uid: req.user!.uid,
-      courseId: cid,
-      lessonId: lid,
-      lessonVideoId: lesson.videoId,
-      input: body,
-    });
-  }
+  ): Promise<{ videoId: VideoId; uploadSessionUri: string; expiresAt: string }> {}
 
   @Get('videos/:vid')
killedBy: VideoController rejects upload-session when module is not found
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
api-video/src/lib/video.controller.ts:57:9
     @Req() req: VideoScopedRequest,
   ): Promise<{ videoId: VideoId; uploadSessionUri: string; expiresAt: string }> {
     const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
-    if (!moduleOk) throw new ModuleNotFoundException();
+    if (false) throw new ModuleNotFoundException();
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
     if (!lesson) throw new LessonNotFoundException();
killedBy: VideoController rejects upload-session when module is not found
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
api-video/src/lib/video.controller.ts:57:9
     @Req() req: VideoScopedRequest,
   ): Promise<{ videoId: VideoId; uploadSessionUri: string; expiresAt: string }> {
     const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
-    if (!moduleOk) throw new ModuleNotFoundException();
+    if (moduleOk) throw new ModuleNotFoundException();
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
     if (!lesson) throw new LessonNotFoundException();
killedBy: VideoController rejects upload-session when module is not found
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
api-video/src/lib/video.controller.ts:59:9
     const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
     if (!moduleOk) throw new ModuleNotFoundException();
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
-    if (!lesson) throw new LessonNotFoundException();
+    if (false) throw new LessonNotFoundException();
 
     return this.svc.createUploadSession({
killedBy: VideoController rejects upload-session when lesson is not found
statusReason: expected TypeError: Cannot read properties of null… to be an instance of LessonNotFoundException

[Killed] BooleanLiteral
api-video/src/lib/video.controller.ts:59:9
     const moduleOk = await this.coursesRepo.moduleExists(cid, mid);
     if (!moduleOk) throw new ModuleNotFoundException();
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
-    if (!lesson) throw new LessonNotFoundException();
+    if (lesson) throw new LessonNotFoundException();
 
     return this.svc.createUploadSession({
killedBy: VideoController rejects upload-session when lesson is not found
statusReason: expected TypeError: Cannot read properties of null… to be an instance of LessonNotFoundException

[Killed] ObjectLiteral
api-video/src/lib/video.controller.ts:61:41
     const lesson = await this.coursesRepo.getLesson(cid, mid, lid);
     if (!lesson) throw new LessonNotFoundException();
 
-    return this.svc.createUploadSession({
-      uid: req.user!.uid,
-      courseId: cid,
-      lessonId: lid,
-      lessonVideoId: lesson.videoId,
-      input: body,
-    });
+    return this.svc.createUploadSession({});
   }
 
killedBy: VideoController delegates to createUploadSession on the service for the happy path
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received:

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
api-video/src/lib/video.controller.ts:72:66
 
   @Get('videos/:vid')
   @UseGuards(VideoOwnerGuard)
-  async getVideo(@Req() req: VideoScopedRequest): Promise<Video> {
-    return req.video!;
-  }
+  async getVideo(@Req() req: VideoScopedRequest): Promise<Video> {}
 
   @Post('videos/:vid/upload-complete')
killedBy: VideoController returns the loaded video on getVideo (guard pre-loaded)
statusReason: expected undefined to be { id: 'v1', …(7) } // Object.is equality

[Killed] BlockStatement
api-video/src/lib/video.controller.ts:78:72
 
   @Post('videos/:vid/upload-complete')
   @UseGuards(VideoOwnerGuard)
-  async completeUpload(@Req() req: VideoScopedRequest): Promise<Video> {
-    return this.svc.completeUpload(req.video!.id);
-  }
+  async completeUpload(@Req() req: VideoScopedRequest): Promise<Video> {}
 
   @Patch('videos/:vid')
killedBy: VideoController passes through to service.completeUpload
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1' ]

Number of calls: 0

[Killed] BlockStatement
api-video/src/lib/video.controller.ts:87:21
   async markFailed(
     @Body() body: UpdateVideoFailedDto,
     @Req() req: VideoScopedRequest,
-  ): Promise<Video> {
-    return this.svc.markFailed(req.video!.id, body.failureReason);
-  }
+  ): Promise<Video> {}
 
   @Delete('videos/:vid')
killedBy: VideoController passes through to service.markFailed
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1', 'x' ]

Number of calls: 0

[Killed] BlockStatement
api-video/src/lib/video.controller.ts:94:63
   @Delete('videos/:vid')
   @UseGuards(VideoOwnerGuard)
   @HttpCode(204)
-  async delete(@Req() req: VideoScopedRequest): Promise<void> {
-    await this.svc.delete(req.video!.id);
-  }
+  async delete(@Req() req: VideoScopedRequest): Promise<void> {}
 }
 
killedBy: VideoController passes through to service.delete
statusReason: expected "vi.fn()" to be called with arguments: [ 'v1' ]

Number of calls: 0
