[Killed] BlockStatement
src/lib/webhook/fake-transcoder.controller.ts:15:3
 function envelope(payload: object): {
   message: { data: string; messageId: string; publishTime: string };
   subscription: string;
-} {
-  return {
-    message: {
-      data: Buffer.from(JSON.stringify(payload)).toString('base64'),
-      messageId: `fake-${Date.now()}`,
-      publishTime: new Date().toISOString(),
-    },
-    subscription: 'fake-subscription',
-  };
-}
+} {}
 
 @Controller('internal/fake-transcoder')
killedBy: FakeTranscoderController complete: builds a SUCCEEDED Pub/Sub envelope and delegates to the real handler
statusReason: Cannot read properties of undefined (reading 'message')

[Survived] StringLiteral
src/lib/webhook/fake-transcoder.controller.ts:19:18
   return {
     message: {
       data: Buffer.from(JSON.stringify(payload)).toString('base64'),
-      messageId: `fake-${Date.now()}`,
+      messageId: ``,
       publishTime: new Date().toISOString(),
     },

[Killed] BlockStatement
src/lib/webhook/fake-transcoder.controller.ts:31:83
   constructor(private readonly real: TranscoderEventsController) {}
 
   @Post('complete/:vid')
-  async complete(@Param('vid') vid: VideoId, @Res() res: Response): Promise<void> {
-    const env = envelope({
-      job: {
-        name: `projects/fake/locations/fake/jobs/${vid}`,
-        state: 'SUCCEEDED',
-        labels: { videoid: vid },
-        output: { uri: `gs://fake-out/videos/${vid}/hls/` },
-      },
-      eventTime: new Date().toISOString(),
-    });
-    await this.real.handle(env, res);
-  }
+  async complete(@Param('vid') vid: VideoId, @Res() res: Response): Promise<void> {}
 
   @Post('fail/:vid')
killedBy: FakeTranscoderController complete: builds a SUCCEEDED Pub/Sub envelope and delegates to the real handler
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/lib/webhook/fake-transcoder.controller.ts:33:12
   @Post('complete/:vid')
   async complete(@Param('vid') vid: VideoId, @Res() res: Response): Promise<void> {
     const env = envelope({
-      job: {
-        name: `projects/fake/locations/fake/jobs/${vid}`,
-        state: 'SUCCEEDED',
-        labels: { videoid: vid },
-        output: { uri: `gs://fake-out/videos/${vid}/hls/` },
-      },
+      job: {},
       eventTime: new Date().toISOString(),
     });
killedBy: FakeTranscoderController complete: builds a SUCCEEDED Pub/Sub envelope and delegates to the real handler
statusReason: expected undefined to be 'SUCCEEDED' // Object.is equality

[Survived] StringLiteral
src/lib/webhook/fake-transcoder.controller.ts:34:15
   async complete(@Param('vid') vid: VideoId, @Res() res: Response): Promise<void> {
     const env = envelope({
       job: {
-        name: `projects/fake/locations/fake/jobs/${vid}`,
+        name: ``,
         state: 'SUCCEEDED',
         labels: { videoid: vid },

[Killed] ObjectLiteral
src/lib/webhook/fake-transcoder.controller.ts:36:17
       job: {
         name: `projects/fake/locations/fake/jobs/${vid}`,
         state: 'SUCCEEDED',
-        labels: { videoid: vid },
+        labels: {},
         output: { uri: `gs://fake-out/videos/${vid}/hls/` },
       },
killedBy: FakeTranscoderController complete: builds a SUCCEEDED Pub/Sub envelope and delegates to the real handler
statusReason: expected undefined to be 'v1' // Object.is equality

[Survived] StringLiteral
src/lib/webhook/fake-transcoder.controller.ts:37:24
         name: `projects/fake/locations/fake/jobs/${vid}`,
         state: 'SUCCEEDED',
         labels: { videoid: vid },
-        output: { uri: `gs://fake-out/videos/${vid}/hls/` },
+        output: { uri: `` },
       },
       eventTime: new Date().toISOString(),

[Killed] BlockStatement
src/lib/webhook/fake-transcoder.controller.ts:49:20
     @Param('vid') vid: VideoId,
     @Body() body: FakeFailBody,
     @Res() res: Response,
-  ): Promise<void> {
-    const env = envelope({
-      job: {
-        name: `projects/fake/locations/fake/jobs/${vid}`,
-        state: 'FAILED',
-        labels: { videoid: vid },
-        error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
-      },
-      eventTime: new Date().toISOString(),
-    });
-    await this.real.handle(env, res);
-  }
+  ): Promise<void> {}
 }
 
killedBy: FakeTranscoderController fail: builds a FAILED envelope and passes the reason
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ObjectLiteral
src/lib/webhook/fake-transcoder.controller.ts:51:12
     @Res() res: Response,
   ): Promise<void> {
     const env = envelope({
-      job: {
-        name: `projects/fake/locations/fake/jobs/${vid}`,
-        state: 'FAILED',
-        labels: { videoid: vid },
-        error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
-      },
+      job: {},
       eventTime: new Date().toISOString(),
     });
killedBy: FakeTranscoderController fail: builds a FAILED envelope and passes the reason
statusReason: expected undefined to be 'FAILED' // Object.is equality

[Killed] StringLiteral
src/lib/webhook/fake-transcoder.controller.ts:53:16
     const env = envelope({
       job: {
         name: `projects/fake/locations/fake/jobs/${vid}`,
-        state: 'FAILED',
+        state: "",
         labels: { videoid: vid },
         error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
killedBy: FakeTranscoderController fail: builds a FAILED envelope and passes the reason
statusReason: expected '' to be 'FAILED' // Object.is equality

[Survived] ObjectLiteral
src/lib/webhook/fake-transcoder.controller.ts:54:17
       job: {
         name: `projects/fake/locations/fake/jobs/${vid}`,
         state: 'FAILED',
-        labels: { videoid: vid },
+        labels: {},
         error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
       },

[Killed] LogicalOperator
src/lib/webhook/fake-transcoder.controller.ts:55:37
         name: `projects/fake/locations/fake/jobs/${vid}`,
         state: 'FAILED',
         labels: { videoid: vid },
-        error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
+        error: { code: 13, message: body.reason && 'fake-transcoder synthetic failure' },
       },
       eventTime: new Date().toISOString(),
killedBy: FakeTranscoderController fail: builds a FAILED envelope and passes the reason
statusReason: expected 'fake-transcoder synthetic failure' to be 'codec failure' // Object.is equality

[Killed] StringLiteral
src/lib/webhook/fake-transcoder.controller.ts:55:52
         name: `projects/fake/locations/fake/jobs/${vid}`,
         state: 'FAILED',
         labels: { videoid: vid },
-        error: { code: 13, message: body.reason ?? 'fake-transcoder synthetic failure' },
+        error: { code: 13, message: body.reason ?? "" },
       },
       eventTime: new Date().toISOString(),
killedBy: FakeTranscoderController fail: uses a default reason when none is provided
statusReason: expected '' to be 'fake-transcoder synthetic failure' // Object.is equality
