[Survived] StringLiteral
src/lib/webhook/transcoder-events.controller.ts:11:40
 @Controller('internal/transcoder-events')
 @UseGuards(PubSubPushGuard)
 export class TranscoderEventsController {
-  private readonly logger = new Logger('TranscoderEventsController');
+  private readonly logger = new Logger("");
 
   constructor(

[Killed] BlockStatement
src/lib/webhook/transcoder-events.controller.ts:19:76
   ) {}
 
   @Post()
-  async handle(@Body() body: unknown, @Res() res: Response): Promise<void> {
-    let event;
-    try {
-      event = await this.transcoder.parseEvent(body);
-    } catch (err) {
-      this.logger.error(`Discarding malformed event: ${(err as Error).message}`);
-      res.status(200).json({ acked: true, reason: 'MALFORMED' });
-      return;
-    }
-
-    try {
-      const outcome = await this.svc.handleTranscoderEvent(event);
-      if (outcome.acted) {
-        res.status(204).send();
-        return;
-      }
-      this.logger.log(
-        `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
-      );
-      res.status(200).json({ acked: true, reason: outcome.reason });
-    } catch (err) {
-      this.logger.error(`Transient failure: ${(err as Error).message}`);
-      res.status(500).send();
-    }
-  }
+  async handle(@Body() body: unknown, @Res() res: Response): Promise<void> {}
 }
 
killedBy: TranscoderEventsController.handle returns 204 when service.acted=true
statusReason: expected +0 to be 204 // Object.is equality

[Killed] BlockStatement
src/lib/webhook/transcoder-events.controller.ts:21:9
   @Post()
   async handle(@Body() body: unknown, @Res() res: Response): Promise<void> {
     let event;
-    try {
-      event = await this.transcoder.parseEvent(body);
-    } catch (err) {
+    try {} catch (err) {
       this.logger.error(`Discarding malformed event: ${(err as Error).message}`);
       res.status(200).json({ acked: true, reason: 'MALFORMED' });
killedBy: TranscoderEventsController.handle returns 200 with structured log payload on ALREADY_APPLIED
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/lib/webhook/transcoder-events.controller.ts:23:19
     let event;
     try {
       event = await this.transcoder.parseEvent(body);
-    } catch (err) {
-      this.logger.error(`Discarding malformed event: ${(err as Error).message}`);
-      res.status(200).json({ acked: true, reason: 'MALFORMED' });
-      return;
-    }
+    } catch (err) {}
 
     try {
killedBy: TranscoderEventsController.handle returns 200 when payload cannot be parsed (poison-pill drop)
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BooleanLiteral
src/lib/webhook/transcoder-events.controller.ts:25:37
       event = await this.transcoder.parseEvent(body);
     } catch (err) {
       this.logger.error(`Discarding malformed event: ${(err as Error).message}`);
-      res.status(200).json({ acked: true, reason: 'MALFORMED' });
+      res.status(200).json({ acked: false, reason: 'MALFORMED' });
       return;
     }
killedBy: TranscoderEventsController.handle returns 200 when payload cannot be parsed (poison-pill drop)
statusReason: expected { acked: false, reason: 'MALFORMED' } to match object { acked: true }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/lib/webhook/transcoder-events.controller.ts:29:9
       return;
     }
 
-    try {
-      const outcome = await this.svc.handleTranscoderEvent(event);
-      if (outcome.acted) {
-        res.status(204).send();
-        return;
-      }
-      this.logger.log(
-        `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
-      );
-      res.status(200).json({ acked: true, reason: outcome.reason });
-    } catch (err) {
+    try {} catch (err) {
       this.logger.error(`Transient failure: ${(err as Error).message}`);
       res.status(500).send();
killedBy: TranscoderEventsController.handle returns 204 when service.acted=true
statusReason: expected +0 to be 204 // Object.is equality

[Killed] BlockStatement
src/lib/webhook/transcoder-events.controller.ts:31:26
 
     try {
       const outcome = await this.svc.handleTranscoderEvent(event);
-      if (outcome.acted) {
-        res.status(204).send();
-        return;
-      }
+      if (outcome.acted) {}
       this.logger.log(
         `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
killedBy: TranscoderEventsController.handle returns 204 when service.acted=true
statusReason: expected 200 to be 204 // Object.is equality

[Killed] ConditionalExpression
src/lib/webhook/transcoder-events.controller.ts:31:11
 
     try {
       const outcome = await this.svc.handleTranscoderEvent(event);
-      if (outcome.acted) {
+      if (false) {
         res.status(204).send();
         return;
killedBy: TranscoderEventsController.handle returns 204 when service.acted=true
statusReason: expected 200 to be 204 // Object.is equality

[Survived] StringLiteral
src/lib/webhook/transcoder-events.controller.ts:36:9
         return;
       }
       this.logger.log(
-        `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
+        ``,
       );
       res.status(200).json({ acked: true, reason: outcome.reason });

[Killed] BooleanLiteral
src/lib/webhook/transcoder-events.controller.ts:38:37
       this.logger.log(
         `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
       );
-      res.status(200).json({ acked: true, reason: outcome.reason });
+      res.status(200).json({ acked: false, reason: outcome.reason });
     } catch (err) {
       this.logger.error(`Transient failure: ${(err as Error).message}`);
killedBy: TranscoderEventsController.handle returns 200 with structured log payload on ALREADY_APPLIED
statusReason: expected { acked: false, …(1) } to deeply equal { acked: true, …(1) }

[Killed] ObjectLiteral
src/lib/webhook/transcoder-events.controller.ts:38:28
       this.logger.log(
         `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
       );
-      res.status(200).json({ acked: true, reason: outcome.reason });
+      res.status(200).json({});
     } catch (err) {
       this.logger.error(`Transient failure: ${(err as Error).message}`);
killedBy: TranscoderEventsController.handle returns 200 with structured log payload on ALREADY_APPLIED
statusReason: expected {} to deeply equal { acked: true, …(1) }

[Killed] BlockStatement
src/lib/webhook/transcoder-events.controller.ts:39:19
         `No-op for videoId=${event.videoId} jobName=${event.jobName}: ${outcome.reason}`,
       );
       res.status(200).json({ acked: true, reason: outcome.reason });
-    } catch (err) {
-      this.logger.error(`Transient failure: ${(err as Error).message}`);
-      res.status(500).send();
-    }
+    } catch (err) {}
   }
 }
killedBy: TranscoderEventsController.handle returns 500 when service throws (transient — Pub/Sub will retry)
statusReason: expected +0 to be 500 // Object.is equality
